
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("АдресСхемы", АдресСхемы) ИЛИ НЕ ЭтоАдресВременногоХранилища(АдресСхемы) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеФильтры = Неопределено;
	Параметры.Свойство("Фильтры", ТекущиеФильтры);
	Если Не ТипЗнч(ТекущиеФильтры)=Тип("ФиксированныйМассив") Тогда
		Фильтры = Новый ФиксированныйМассив(Новый Массив);
	Иначе
		Фильтры = ТекущиеФильтры;
	КонецЕсли; 
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	Компоновщик.Инициализировать(ИсточникНастроек);
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	АдресНастроек = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, УникальныйИдентификатор);
	
	Элементы.Поле.СписокВыбора.Очистить();
	Для каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		Если НЕ ТипЗнч(ЭлементОтбора)=Тип("ЭлементОтбораКомпоновкиДанных") ИЛИ НЕ ТипЗнч(ЭлементОтбора.ЛевоеЗначение)=Тип("ПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ЭлементОтбора.Представление) Тогда
			Представление = ЭлементОтбора.Представление;
		Иначе
			ДоступноеПоле = Компоновщик.Настройки.ДоступныеПоляОтбора.НайтиПоле(ЭлементОтбора.ЛевоеЗначение);
			Представление = ДоступноеПоле.Заголовок;
		КонецЕсли; 
		Элементы.Поле.СписокВыбора.Добавить(Строка(ЭлементОтбора.ЛевоеЗначение), Представление);
	КонецЦикла; 
	Элементы.Поле.СписокВыбора.Добавить("...", НСтр("ru='Прочие поля';uk='Інші поля'"),, БиблиотекаКартинок.Выбрать);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДоступноеПоле = Компоновщик.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ВыбранноеЗначение));
	Элементы.Поле.СписокВыбора.Вставить(Элементы.Поле.СписокВыбора.Количество()-1, ВыбранноеЗначение, ДоступноеПоле.Заголовок); 
	Поле = ВыбранноеЗначение;
	ПолеПриИзменении(Элементы.Поле);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение="..." Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("АдресСхемы", АдресСхемы);
		СтруктураОткрытия.Вставить("АдресНастроек", АдресНастроек);
		ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаДоступныеПоляОтбора", СтруктураОткрытия, ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	ПолеПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПолеПриИзмененииСервер()
	
	Элементы.ВидСравнения.СписокВыбора.Очистить();
	Если ПустаяСтрока(Поле) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступноеПоле = Компоновщик.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Поле));
	ОписаниеТипов = ДоступноеПоле.ТипЗначения;
	НедоступныеВидыСравнения = ОпределитьНедоступныеВидыСравнения(Поле, ОписаниеТипов);
	Для каждого Тип Из ОписаниеТипов.Типы() Цикл
		Если Тип=Тип("Число") Тогда
			// Числа
			ДобавитьВидСравнения("Больше", НСтр("ru='Больше';uk='Більше'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("БольшеИлиРавно", НСтр("ru='Больше или равно';uk='Більше або рівно'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("Меньше", НСтр("ru='Меньше';uk='Менше'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("МеньшеИлиРавно", НСтр("ru='Меньше или равно';uk='Менше або рівно'"), НедоступныеВидыСравнения);
		ИначеЕсли Тип=Тип("Дата") Тогда
			// Даты
			ДобавитьВидСравнения("Больше", НСтр("ru='Больше';uk='Більше'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("БольшеИлиРавно", НСтр("ru='Больше или равно';uk='Більше або рівно'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("Меньше", НСтр("ru='Меньше';uk='Менше'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("МеньшеИлиРавно", НСтр("ru='Меньше или равно';uk='Менше або рівно'"), НедоступныеВидыСравнения);
		ИначеЕсли Тип=Тип("Строка") Тогда
			// Строки
			ДобавитьВидСравнения("Содержит", НСтр("ru='Содержит';uk='Містить'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("НеСодержит", НСтр("ru='Не содержит';uk='Не містить'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("НачинаетсяС", НСтр("ru='Начинается с';uk='Починається з'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("НеНачинаетсяС", НСтр("ru='Не начинается с';uk='Не починається з'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("Подобно", НСтр("ru='Подобно';uk='Подібно'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("НеПодобно", НСтр("ru='Не подобно';uk='Не подібно'"), НедоступныеВидыСравнения);
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			ПустаяСсылка = Новый(Тип);
			КоличествоЗначений = ОтчетыУНФ.ОпределитьКоличествоЭлементов(Тип);
			МетаданныеОбъекта = ПустаяСсылка.Метаданные();
			Если (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта) 
				ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта)) 
				И МетаданныеОбъекта.Иерархический Тогда
				ДобавитьВидСравнения("ВСпискеПоИерархии", НСтр("ru='В группах';uk='У групах'"), НедоступныеВидыСравнения);
				ДобавитьВидСравнения("НеВСпискеПоИерархии", НСтр("ru='Не в группах';uk='Не в групах'"), НедоступныеВидыСравнения);
			КонецЕсли;
			Если КоличествоЗначений>2 Тогда
				ДобавитьВидСравнения("ВСписке", НСтр("ru='В списке';uk='У списку'"), НедоступныеВидыСравнения);
				ДобавитьВидСравнения("НеВСписке", НСтр("ru='Не в списке';uk='Не в списку'"), НедоступныеВидыСравнения);
			КонецЕсли; 
			ДобавитьВидСравнения("Равно", НСтр("ru='Равно';uk='Рівно'"), НедоступныеВидыСравнения);
			ДобавитьВидСравнения("НеРавно",НСтр("ru='Не равно';uk='Не рівно'"), НедоступныеВидыСравнения);
		КонецЕсли;	
	КонецЦикла; 
	
	ВидСравнения = "";
	Для каждого ОписаниеФильтра Из Фильтры Цикл
		Если НЕ ОписаниеФильтра.Поле=Поле Тогда
			Продолжить;
		КонецЕсли;
		ИмяВидаСравнения = ПолучитьПолноеИмяПредопределенногоЗначения(ОписаниеФильтра.ВидСравнения);
		ИмяВидаСравнения = Сред(ИмяВидаСравнения, Найти(ИмяВидаСравнения, ".")+1);
		Если НЕ Элементы.ВидСравнения.СписокВыбора.НайтиПоЗначению(ИмяВидаСравнения)=Неопределено Тогда
			ВидСравнения = ИмяВидаСравнения;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	Если ПустаяСтрока(ВидСравнения) И Элементы.ВидСравнения.СписокВыбора.Количество()>0 Тогда
		ВидСравнения = Элементы.ВидСравнения.СписокВыбора[0].Значение;
	КонецЕсли;
	ВидСравненияПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Функция ОпределитьНедоступныеВидыСравнения(Поле, Тип)
	
	Результат = Новый Массив;
	Для каждого ОписаниеФильтра Из Фильтры Цикл
		Если НЕ ОписаниеФильтра.Поле=Поле Тогда
			Продолжить;
		КонецЕсли;
		Если ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно Тогда
			Результат.Добавить("НеРавно");
			Результат.Добавить("НеВСписке");
			Результат.Добавить("ВСпискеПоИерархии");
			Результат.Добавить("НеВСпискеПоИерархии");
			Результат.Добавить("Больше");
			Результат.Добавить("БольшеИлиРавно");
			Результат.Добавить("Меньше");
			Результат.Добавить("МеньшеИлиРавно");
			Результат.Добавить("Содержит");
			Результат.Добавить("НеСодержит");
			Результат.Добавить("НачинаетсяС");
			Результат.Добавить("НеНачинаетсяС");
			Результат.Добавить("Подобно");
			Результат.Добавить("НеПодобно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно Тогда
			Результат.Добавить("Равно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке Тогда

		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке Тогда
			Результат.Добавить("Равно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
			Результат.Добавить("Равно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			Результат.Добавить("Равно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше 
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			Результат.Добавить("Больше");
			Результат.Добавить("БольшеИлиРавно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше 
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			Результат.Добавить("Меньше");
			Результат.Добавить("МеньшеИлиРавно");
		ИначеЕсли ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.Содержит
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НеСодержит
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НачинаетсяС
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НеНачинаетсяС
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.Подобно
			ИЛИ ОписаниеФильтра.ВидСравнения=ВидСравненияКомпоновкиДанных.НеПодобно Тогда
			Результат.Добавить("Равно");
		КонецЕсли; 
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьВидСравнения(ВидСравнения, Представление, НедоступныеВидыСравнения)
	
	Если НЕ НедоступныеВидыСравнения.Найти(ВидСравнения)=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ Элементы.ВидСравнения.СписокВыбора.НайтиПоЗначению(ВидСравнения)=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Элементы.ВидСравнения.СписокВыбора.Добавить(ВидСравнения, Представление);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияПриИзменении(Элемент)
	
	ВидСравненияПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВидСравненияПриИзмененииСервер()
	
	Если НЕ ЗначениеЗаполнено(ВидСравнения) Тогда
		Значение = Неопределено;
		Возврат;
	КонецЕсли; 
	НовыйВидСравнения = ВидСравненияКомпоновкиДанных[ВидСравнения];
	ОбновитьТипЗначения();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьОтбор(Команда)
	
	Если ПустаяСтрока(Поле) ИЛИ ПустаяСтрока(ВидСравнения) ИЛИ НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Событие", "ДобавлениеОтбора");
	СтруктураВозврата.Вставить("Поле", Поле);
	СтруктураВозврата.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных[ВидСравнения]);
	СтруктураВозврата.Вставить("Значение", Значение);
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТипЗначения()
	
	ДоступноеПоле = Компоновщик.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Поле));
	Тип = ДоступноеПоле.ТипЗначения;
	ЭтоСсылка = Ложь;
	Для каждого ДоступныйТип Из Тип.Типы() Цикл
		Если ОбщегоНазначения.ЭтоСсылка(ДоступныйТип) Тогда
			ЭтоСсылка = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Если ЭтоСсылка И (ВидСравнения="ВИерархиии" ИЛИ ВидСравнения="НеВИерархиии" ИЛИ ВидСравнения="ВСпискеПоИерархии" ИЛИ ВидСравнения="НеВСпискеПоИерархии") Тогда
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Авто;
	КонецЕсли; 
	
	СтароеЗначение = Значение;
	Если ЭтоСсылка И НЕ ВидСравнения="Равно" И НЕ ВидСравнения="НеРавно" Тогда
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
		Значение = Новый СписокЗначений;
		Значение.ТипЗначения = Тип;
		Если ТипЗнч(СтароеЗначение)=Тип("СписокЗначений") Тогда
			Для каждого СтарыйЭлемент Из СтароеЗначение Цикл
				ЗначениеЭлемента = Тип.ПривестиЗначение(СтарыйЭлемент.Значение);
				Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
					Значение.Добавить(ЗначениеЭлемента);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		Для каждого ДоступныйТип Из Тип.Типы() Цикл
			Если ЗначениеЗаполнено(СтароеЗначение) И ТипЗнч(СтароеЗначение)=ДоступныйТип Тогда
				Значение.Добавить(СтароеЗначение);
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		Элементы.Значение.ОграничениеТипа = Тип;
		Значение = Тип.ПривестиЗначение(Значение);
		Если ТипЗнч(СтароеЗначение)=Тип("СписокЗначений") И СтароеЗначение.Количество()>0 Тогда
			ПервыйЭлемент = СтароеЗначение[0].Значение;
			Для каждого ДоступныйТип Из Тип.Типы() Цикл
				Если ТипЗнч(ПервыйЭлемент)=ДоступныйТип Тогда
					Значение = ПервыйЭлемент;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

