////////////////////////////////////////////////////////////////////////////////
// Клиентские события формы отчета
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик расшифровки табличного документа формы отчета.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - Форма отчета.
//   Элемент     - ПолеФормы        - Табличный документ.
//   Расшифровка          - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "Расширение поля формы для поля табличного документа.ОбработкаРасшифровки" в синтакс-помощнике.
//
Процедура ОбработкаРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	УправлениеНебольшойФирмойОтчетыКлиент.ОбработкаРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработчик дополнительной расшифровки (меню табличного документа формы отчета).
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - Форма отчета.
//   Элемент     - ПолеФормы        - Табличный документ.
//   Расшифровка          - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "Расширение поля формы для поля табличного документа.ОбработкаДополнительнойРасшифровки" в синтакс-помощнике.
//
Процедура ОбработкаДополнительнойРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик команд, добавленных динамически и подключенных к обработчику "Подключаемый_Команда".
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - Форма отчета.
//   Команда     - КомандаФормы     - Команда, которая была вызвана.
//   Результат   - Булево           - Истина, если вызов команды обработан.
//
// См. также:
//   Пример добавления команды в комментарии к обработчику ПриСозданииНаСервере().
//
Процедура ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	// Гунько 2021-01-18
	Если Команда.Имя = "ДобавленнаяКоманда_СформироватьЗаказРезервирование" Тогда
		Если НЕ ФормаОтчета.ОтчетТабличныйДокумент.ТекущаяОбласть.Расшифровка = Неопределено Тогда
			
			лФормаЗаказ = ПолучитьФорму("Документ.ЗаказПокупателя.ФормаОбъекта"); 
			лДанныеФормы = лФормаЗаказ.Объект;
			
			лДанныеФормы = ОтчетыУНФВызовСервера.гвСоздатьЗаказПокупателяНаСервере(ФормаОтчета.ОтчетДанныеРасшифровки, ФормаОтчета.ОтчетТабличныйДокумент.ТекущаяОбласть.Расшифровка, лДанныеФормы);
			
			Если лДанныеФормы = Неопределено Тогда
				Сообщить("При резервуванні повинен бути активним серійний номер який резервуємо.");	
			Иначе 	
				
				КопироватьДанныеФормы(лДанныеФормы, лФормаЗаказ.Объект);
				
				лФормаЗаказ.Открыть();
				лФормаЗаказ.Элементы.Запасы.ТекущаяСтрока = лФормаЗаказ.Объект.Запасы[0].ПолучитьИдентификатор(); 
				лФормаЗаказ.ЗапасыНоменклатураПриИзменении(Новый Структура);
				
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли Команда.Имя = "ДобавленнаяКоманда_СформироватьЗаказНаПроизводство" Тогда
		Если НЕ ФормаОтчета.ОтчетТабличныйДокумент.ТекущаяОбласть.Расшифровка = Неопределено Тогда
			
			лФормаЗаказ = ПолучитьФорму("Документ.ЗаказНаПроизводство.ФормаОбъекта"); 
			лДанныеФормы = лФормаЗаказ.Объект;
			
			лДанныеФормы = ОтчетыУНФВызовСервера.гвСоздатьЗаказНаПроизводствоНаСервере(ФормаОтчета.ОтчетДанныеРасшифровки, ФормаОтчета.ОтчетТабличныйДокумент.ТекущаяОбласть.Расшифровка, лДанныеФормы);
			
			Если лДанныеФормы = Неопределено Тогда
				Сообщить("При формуванні замовлення повинен бути активним серійний номер який замовляємо.");	
			Иначе				
				КопироватьДанныеФормы(лДанныеФормы, лФормаЗаказ.Объект);
				лФормаЗаказ.гвСоздатьНапоминание = Истина;
				лФормаЗаказ.Открыть();				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Команда.Имя = "ДобавленнаяКоманда_Переместить" Тогда	
		Если НЕ ФормаОтчета.ОтчетТабличныйДокумент.ТекущаяОбласть.Расшифровка = Неопределено Тогда
			
			лФормаПеремещение = ПолучитьФорму("Документ.ПеремещениеЗапасов.ФормаОбъекта"); 
			лДанныеФормы = лФормаПеремещение.Объект;
			
			лДанныеФормы = ОтчетыУНФВызовСервера.гвСоздатьПеремещениеЗапасовНаСервере(ФормаОтчета.ОтчетДанныеРасшифровки, ФормаОтчета.ОтчетТабличныйДокумент.ТекущаяОбласть.Расшифровка, лДанныеФормы);
			
			Если лДанныеФормы = Неопределено Тогда
				Сообщить("При формуванні переміщення повинен бути активним серійний номер який переміщуємо.");	
			Иначе				
				КопироватьДанныеФормы(лДанныеФормы, лФормаПеремещение.Объект);				
				лФормаПеремещение.Открыть();				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;	
	// ...Гунько 2021-01-18
	
КонецПроцедуры

// Обработчик результата выбора подчиненной формы.
//
// Параметры:
//   ФормаОтчета       - УправляемаяФорма - Форма отчета.
//   ВыбранноеЗначение - Произвольное значение - Результат выбора в подчиненной форме.
//   ИсточникВыбора    - УправляемаяФорма - Форма, где осуществлен выбор.
//   Результат         - Булево           - Истина, если результат выбора обработан.
//
// См. также:
//   "УправляемаяФорма.ОбработкаВыбора" в синтакс-помощнике.
//
Процедура ОбработкаВыбора(ФормаОтчета, ВыбранноеЗначение, ИсточникВыбора, Результат) Экспорт
	
КонецПроцедуры

// Обработчик широковещательного оповещения формы отчета.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - Форма отчета.
//   ИмяСобытия  - Передается из параметров обработчика "как есть".
//   Параметр    - Передается из параметров обработчика "как есть".
//   Источник    - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ОбработкаОповещения" в синтакс-помощнике.
//
Процедура ОбработкаОповещения(ФормаОтчета, ИмяСобытия, Параметр, Источник, ОповещениеОбработано) Экспорт
	
КонецПроцедуры

// Обработчик нажатия на кнопку выбора периода в отдельной форме.
//
// Параметры:
//   ФормаОтчета - УправляемаяФорма - Форма отчета.
//   Период - СтандартныйПериод - Значение настройки компоновщика, соответствующей выбранному периоду.
//   СтандартнаяОбработка - Булево - Если Истина, то будет использован стандартный диалог выбора периода.
//       Если установить в Ложь то стандартный диалог не откроется.
//   ОбработчикРезультата - ОписаниеОповещения - Обработчик результата выбора периода.
//       В качестве результата в ОбработчикРезультата могут быть переданы значения типов:
//       Неопределено - Пользователь отказался от ввода периода.
//       СтандартныйПериод - Выбранный период.
//
//  Если в конфигурации используется собственный диалог выбора периода,
//      тогда параметр СтандартнаяОбработка следует установить в Ложь,
//      а выбранный период следует вернуть в ОбработчикРезультата.
//
Процедура ПриНажатииКнопкиВыбораПериода(ФормаОтчета, Период, СтандартнаяОбработка, ОбработчикРезультата) Экспорт
	
КонецПроцедуры

#КонецОбласти
