&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") = 1 И Область.Текст <> "" Тогда
		ДобавитьСтроку(Область.Верх);
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") = 1 И Область.Текст <> "" Тогда
		УдалитьСтроку(Область.Верх);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтроку(НомерСтроки)
	
	 СпециальногоДобавленияСтроки(ЭтаФорма.ТабличныйДокумент, "ТабличныйДокумент", "МногострочнаяЧасть", НомерСтроки); 
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(НомерСтроки)
	
	 СпециальногоУдаленияСтроки(ЭтаФорма.ТабличныйДокумент, "ТабличныйДокумент", "МногострочнаяЧасть", НомерСтроки);  
	
КонецПроцедуры

&НаСервере
Процедура СпециальногоДобавленияСтроки(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИмяГруппы, НомерЯчейкиОбласти) 

	СчетчикСтрок = ТекТабличноеПоле.Область(НомерЯчейкиОбласти, 6, НомерЯчейкиОбласти, 6).Значение;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Пока СчетчикСтрок > 0 Цикл
		СчетчикСтрок = СчетчикСтрок - 1;
		
		СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, 10000000);
		
		НазначитьИмяОбластиМЧ = Ложь;
		ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерЯчейкиОбласти - 1, , НомерЯчейкиОбласти - 1, );
		
		ВставляемаяОбласть.Защита = Ложь;
		ИмяМногострочнойЧасти = Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=0") +  Формат(СлучайноеЧисло, "ЧГ=0");
		
		ТекТабличноеПоле.ВставитьОбласть( ВставляемаяОбласть,,ТипСмещенияТабличногоДокумента.ПоВертикали );
		ТекТабличноеПоле.Область(НомерЯчейкиОбласти, , НомерЯчейкиОбласти, ).Имя = "МногострочнаяЧасть" +  ИмяМногострочнойЧасти;
		
		ОчиститьТекст(ТекТабличноеПоле, НомерЯчейкиОбласти);
		
		НовОбластьЯчейкиУдалитьСтроку = ТекТабличноеПоле.Область(НомерЯчейкиОбласти, 1, НомерЯчейкиОбласти , 1);
		НовОбластьЯчейкиУдалитьСтроку.Имя = "УдалитьСтроку" + ИмяМногострочнойЧасти;
		НовОбластьЯчейкиУдалитьСтроку.Гиперссылка = Истина;
		НовОбластьЯчейкиУдалитьСтроку.Защита = Истина;
		НовОбластьЯчейкиУдалитьСтроку.Текст = "х";
		
		СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, 10000000);
		ИмяМногострочнойЧасти = Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=0") +  Формат(СлучайноеЧисло, "ЧГ=0");

		// Назначаем имя ячейки исходной области,
		// (т.к. в результате вставки новой области оно было очищено)
		ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерЯчейкиОбласти - 1, , НомерЯчейкиОбласти - 1, );
		ОбластьЯчейкиИсходнойОбласти.Имя = "МногострочнаяЧасть" + ИмяМногострочнойЧасти;
		
		ОбластьИсходнойУдалить = ТекТабличноеПоле.Область(НомерЯчейкиОбласти - 1, 1, НомерЯчейкиОбласти - 1, 1);
		Если ОбластьИсходнойУдалить.Текст = "х" Тогда
			ОбластьИсходнойУдалить.Имя = "УдалитьСтроку" + ИмяМногострочнойЧасти;
			ОбластьИсходнойУдалить.Гиперссылка = Истина;
			ОбластьИсходнойУдалить.Защита = Истина;		
		КонецЕсли;
		
		НомерЯчейкиОбласти = НомерЯчейкиОбласти + 1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОчиститьТекст(ТекТабличноеПоле, НомерЯчейкиОбласти)
	
	МаксКолВоКолонок = 6;// На текущий момент в примерах отчетах не больше 5 колонок 
	
	ТекКолонка = 1;
	
	Пока ТекКолонка < МаксКолВоКолонок Цикл
		Попытка
			ТекТабличноеПоле.Область(НомерЯчейкиОбласти, ТекКолонка, НомерЯчейкиОбласти, ТекКолонка).Значение = 0;
		Исключение
		КонецПопытки;
		
		Попытка
			ТекТабличноеПоле.Область(НомерЯчейкиОбласти, ТекКолонка, НомерЯчейкиОбласти, ТекКолонка).Текст = "";
		Исключение
		КонецПопытки;
		
		ТекКолонка = ТекКолонка + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СпециальногоУдаленияСтроки(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИмяГруппы, НомерЯчейкиОбласти) Экспорт
	
	// Определим область удаляемой строки.
	УдаляемаяОбласть = ТекТабличноеПоле.Область(НомерЯчейкиОбласти,, НомерЯчейкиОбласти,);
	// Непосредственно удаляем область строки табличного документа.
	ТекТабличноеПоле.УдалитьОбласть(УдаляемаяОбласть,ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	ПересчитатьИтоги(НомерЯчейкиОбласти - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	
 	СформироватьОтчет(ВидОтчета);

	ВидимостьКнопокРасшКредИсходящие(Истина)
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокРасшКредИсходящие(ТаблицаЗаполнена = Ложь)

	Элементы.ОтправитьОтчет.Доступность = ТаблицаЗаполнена;
	Элементы.СохранитьОтчет.Доступность = ТаблицаЗаполнена

КонецПроцедуры

&НаСервере
Процедура СформироватьТабДокПоВидуОтчета(ВидОтчета)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ВидОтчета = "Розшифровка звіту про фін.результати" Тогда
		ТабДок = РасшифровкаПоФинРез();
	ИначеЕсли ВидОтчета = "Розшифровка рядків балансу" Тогда
		ТабДок = РасшифровкаБаланса();
	Иначе
		ТабДок = ХозДеятельность();
	КонецЕсли;
	
	ЭтаФорма.ТабличныйДокумент = ТабДок;

КонецПроцедуры

&НаСервере
Функция РасшифровкаПоФинРез()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбьект.ПолучитьМакет("ФинРезультаты");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода;
	ОбластьЗаголовок.Параметры.Организация = ОбработкаОбьект.Организация;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ШапкаТалицы = Макет.ПолучитьОбласть("ШапкаТалицы");
	ТабДок.Вывести(ШапкаТалицы);

	МногострочнаяЧасть = Макет.ПолучитьОбласть("МногострочнаяЧасть");
	
	ТабДок.Вывести(МногострочнаяЧасть);
	
 	Обл = ТабДок.Области.Найти("УдалитьСтроку");
	Обл.Гиперссылка = Ложь;
	Обл.Текст = "";
	
	Обл = ТабДок.Области.Найти("МногострочнаяЧасть");
	Обл.Защита = Ложь;
	
	ДобавлениеСтроки = Макет.ПолучитьОбласть("ДобавлениеСтроки");
	ДобавлениеСтроки.Область("R1C6").Значение = 1;
	ТабДок.Вывести(ДобавлениеСтроки);
	
	ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ТабДок.Вывести(ПодвалТаблицы);

	Для Каждого СтрокаПоказателя Из ОбработкаОбьект.ТаблицаПоказателей Цикл
		
		Если НЕ СтрокаПоказателя.ВыводитьВОтчет Тогда
			Продолжить;	
		КонецЕсли;
		
		ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДок.Вывести(ПустаяСтрока);
		
		ШапкаТалицыСокр = Макет.ПолучитьОбласть("ШапкаТалицыСокр");
		ШапкаТалицыСокр.Области.ШапкаТалицыСокр.Имя = "ШапкаТалицы" + СтрокаПоказателя.НомерСтроки;
		ШапкаТалицыСокр.Параметры.Заголовок = СтрокаПоказателя.СтрокаБаланса;
		
		ТабДок.Вывести(ШапкаТалицыСокр);
		
		МногострочнаяЧасть = Макет.ПолучитьОбласть("МногострочнаяЧастьСокр"); 
		
		ТабДок.Вывести(МногострочнаяЧасть);
		
		Обл = ТабДок.Области.Найти("УдалитьСтрокуСокр");
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл.Имя = "УдалитьСтрокуСокр" + СтрокаПоказателя.НомерСтроки;
		Обл = ТабДок.Области.Найти("МногострочнаяЧастьСокр");
		Обл.Защита = Ложь;
		Обл.Имя = "МногострочнаяЧастьСокр" + СтрокаПоказателя.НомерСтроки;
		
		ДобавлениеСтроки = Макет.ПолучитьОбласть("ДобавлениеСтроки");
		ДобавлениеСтроки.Область("R1C6").Значение = 1;
		
		Для Каждого СтрокаОбл Из ДобавлениеСтроки.Области Цикл
			СтрокаОбл.Имя = СтрокаОбл.Имя + СтрокаПоказателя.НомерСтроки;	
		КонецЦикла;
		
		ТабДок.Вывести(ДобавлениеСтроки);
		
		ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицыСокр");
		
		Для Каждого СтрокаОбл Из ДобавлениеСтроки.Области Цикл
			СтрокаОбл.Имя = СтрокаОбл.Имя + СтрокаПоказателя.НомерСтроки;	
		КонецЦикла;
		
		ТабДок.Вывести(ПодвалТаблицы);
		
	КонецЦикла;

	ПодвалОтчета = Макет.ПолучитьОбласть("ПодвалОтчета");
	ТабДок.Вывести(ПодвалОтчета);
		
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция РасшифровкаБаланса()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбьект.ПолучитьМакет("РасшифровкаБаланса");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода;
	ОбластьЗаголовок.Параметры.Организация = ОбработкаОбьект.Организация;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Для Каждого СтрокаПоказателя Из ОбработкаОбьект.ТаблицаПоказателей Цикл
		
		Если НЕ СтрокаПоказателя.ВыводитьВОтчет Тогда
			Продолжить;	
		КонецЕсли;
		
		ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДок.Вывести(ПустаяСтрока);
		
		ШапкаТалицы = Макет.ПолучитьОбласть("ШапкаТалицы" + СтрокаПоказателя.ИмяМакета);
		ШапкаТалицы.Области["ШапкаТалицы" + СтрокаПоказателя.ИмяМакета].Имя = "ШапкаТалицы" + СтрокаПоказателя.НомерСтроки;
		ШапкаТалицы.Параметры.Заголовок = СтрокаПоказателя.СтрокаБаланса;
		
		ТабДок.Вывести(ШапкаТалицы);
		
		МногострочнаяЧасть = Макет.ПолучитьОбласть("МногострочнаяЧасть" + СтрокаПоказателя.ИмяМакета); 
		
		ТабДок.Вывести(МногострочнаяЧасть);
		
		Обл = ТабДок.Области.Найти("УдалитьСтроку" + СтрокаПоказателя.ИмяМакета);
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл.Имя = "УдалитьСтроку" + СтрокаПоказателя.НомерСтроки;
		Обл = ТабДок.Области.Найти("МногострочнаяЧасть" + СтрокаПоказателя.ИмяМакета);
		Обл.Защита = Ложь;
		Обл.Имя = "МногострочнаяЧастьСокр" + СтрокаПоказателя.НомерСтроки;
		
		ДобавлениеСтроки = Макет.ПолучитьОбласть("ДобавлениеСтроки");
		ДобавлениеСтроки.Область("R1C6").Значение = 1;
		
		Для Каждого СтрокаОбл Из ДобавлениеСтроки.Области Цикл
			СтрокаОбл.Имя = СтрокаОбл.Имя + СтрокаПоказателя.НомерСтроки;	
		КонецЦикла;
		
		ТабДок.Вывести(ДобавлениеСтроки);
		
		ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы" + СтрокаПоказателя.ИмяМакета);
		
		Для Каждого СтрокаОбл Из ДобавлениеСтроки.Области Цикл
			СтрокаОбл.Имя = СтрокаОбл.Имя + СтрокаПоказателя.НомерСтроки;	
		КонецЦикла;
		
		ТабДок.Вывести(ПодвалТаблицы);
		
	КонецЦикла;

	ПодвалОтчета = Макет.ПолучитьОбласть("ПодвалОтчета");
	ТабДок.Вывести(ПодвалОтчета);
		
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ХозДеятельность()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбьект.ПолучитьМакет("ХозДеятельность");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода;
	ОбластьЗаголовок.Параметры.Организация = ОбработкаОбьект.Организация;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ШапкаТалицы = Макет.ПолучитьОбласть("ШапкаТалицыПродажи");
	ТабДок.Вывести(ШапкаТалицы);

	МногострочнаяЧасть = Макет.ПолучитьОбласть("МногострочнаяЧастьПродажи");
	
	ТабДок.Вывести(МногострочнаяЧасть);
	
 	Обл = ТабДок.Области.Найти("УдалитьСтрокуПродажи");
	Обл.Гиперссылка = Ложь;
	Обл.Текст = "";
	
	Обл = ТабДок.Области.Найти("МногострочнаяЧастьПродажи");
	Обл.Защита = Ложь;
	
	ДобавлениеСтроки = Макет.ПолучитьОбласть("ДобавлениеСтроки");
	ДобавлениеСтроки.Область("R1C6").Значение = 1;
	ТабДок.Вывести(ДобавлениеСтроки);
	
	ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицыПродажи");
	ТабДок.Вывести(ПодвалТаблицы);
	
	Для Каждого СтрокаПоказателя Из ОбработкаОбьект.ТаблицаПоказателей Цикл
		
		Если НЕ СтрокаПоказателя.ВыводитьВОтчет Тогда
			Продолжить;	
		КонецЕсли;
		
		ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДок.Вывести(ПустаяСтрока);
		
		ШапкаТалицы = Макет.ПолучитьОбласть("ШапкаТалицы" + СтрокаПоказателя.ИмяМакета);
		ШапкаТалицы.Области["ШапкаТалицы" + СтрокаПоказателя.ИмяМакета].Имя = "ШапкаТалицы" + СтрокаПоказателя.НомерСтроки;
		
		Попытка
			ШапкаТалицы.Параметры.Период = ПредставлениеПериода;
		Исключение
		КонецПопытки;
		
		Попытка
			ШапкаТалицы.Параметры.ТекущаяДата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Попытка
			ШапкаТалицы.Параметры.ВидКонтрагента = СтрокаПоказателя.СтрокаБаланса;
		Исключение
		КонецПопытки;
		
		ТабДок.Вывести(ШапкаТалицы);
		
		МногострочнаяЧасть = Макет.ПолучитьОбласть("МногострочнаяЧасть" + СтрокаПоказателя.ИмяМакета); 
		
		ТабДок.Вывести(МногострочнаяЧасть);
		
		Обл = ТабДок.Области.Найти("УдалитьСтроку" + СтрокаПоказателя.ИмяМакета);
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл.Имя = "УдалитьСтроку" + СтрокаПоказателя.НомерСтроки;
		Обл = ТабДок.Области.Найти("МногострочнаяЧасть" + СтрокаПоказателя.ИмяМакета);
		Обл.Защита = Ложь;
		Обл.Имя = "МногострочнаяЧастьСокр" + СтрокаПоказателя.НомерСтроки;
		
		ДобавлениеСтроки = Макет.ПолучитьОбласть("ДобавлениеСтроки");
		ДобавлениеСтроки.Область("R1C6").Значение = 1;
		
		Для Каждого СтрокаОбл Из ДобавлениеСтроки.Области Цикл
			СтрокаОбл.Имя = СтрокаОбл.Имя + СтрокаПоказателя.НомерСтроки;	
		КонецЦикла;
		
		ТабДок.Вывести(ДобавлениеСтроки);
		
		ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы" + СтрокаПоказателя.ИмяМакета);
		
		Для Каждого СтрокаОбл Из ДобавлениеСтроки.Области Цикл
			СтрокаОбл.Имя = СтрокаОбл.Имя + СтрокаПоказателя.НомерСтроки;	
		КонецЦикла;
		
		ПодвалТаблицы.Области["ПодвалТаблицы" + СтрокаПоказателя.ИмяМакета].Имя = "ПодвалТаблицы" + + СтрокаПоказателя.НомерСтроки;
		
		ТабДок.Вывести(ПодвалТаблицы);
		
	КонецЦикла;

	ПодвалОтчета = Макет.ПолучитьОбласть("ПодвалОтчета");
	ТабДок.Вывести(ПодвалОтчета);
		
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция СформироватьОтчет(ВидОтчета)
	
	СформироватьТабДокПоВидуОтчета(ВидОтчета);
	
КонецФункции

&НаКлиенте
Процедура ТабличныйДокументПриИзменении(Элемент)

	ПересчитатьИтоги(Элемент.ТекущаяОбласть.Верх);

КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиХозДеятельность(НомерРедактируемойСтроки)
		
	ТабДок = ЭтаФорма.ТабличныйДокумент;
	
	ТЗОбластей = Новый ТаблицаЗначений;
	ТЗОбластей.Колонки.Добавить("Имя");
	ТЗОбластей.Колонки.Добавить("Позиция");
	
	Для Каждого СтрокаОбл Из ТабДок.Области Цикл	
		Если Найти(СтрокаОбл.Имя, "ДобавлениеСтроки") > 0 ИЛИ Найти(СтрокаОбл.Имя, "ШапкаТалицы") > 0 Тогда //ИЛИ Найти(СтрокаОбл.Имя, "ПодвалТаблицы") > 0 Тогда
			Если СтрокаОбл.Верх = НомерРедактируемойСтроки Тогда
				Возврат;	
			КонецЕсли;
		
			НоваяСтрока = ТЗОбластей.Добавить();
			НоваяСтрока.Имя = СтрокаОбл.Имя;
			НоваяСтрока.Позиция = СтрокаОбл.Верх;			
		КонецЕсли;
	КонецЦикла;
	
	ТЗОбластей.Сортировать("Позиция");
	
	Для Каждого СтрокаОбл Из ТЗОбластей Цикл
		Если Найти(СтрокаОбл.Имя, "ДобавлениеСтроки") > 0 Тогда			
			Если СтрокаОбл.Позиция > НомерРедактируемойСтроки Тогда
				Область = ТабДок.Области.Найти(СтрокаОбл.Имя);
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;

	Если Область = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьШапки = Неопределено;
	ТЗОбластей.Сортировать("Позиция Убыв");
	НачСтрока = 5; 
	Для Каждого СтрокаОбл Из ТЗОбластей Цикл
		Если Найти(СтрокаОбл.Имя, "ШапкаТалицы") > 0 Тогда
			Если СтрокаОбл.Позиция < НомерРедактируемойСтроки Тогда
				ОбластьШапки = ТабДок.Области.Найти(СтрокаОбл.Имя);
				НачСтрока = ОбластьШапки.Верх + 1;	
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	
	ОбщаяСумма = 0;
	ОбщаяСумма2 = 0; //За последний год 
	НомерКолонки = 3;
	
	Если ОбластьШапки <> Неопределено Тогда
		Если ОбластьШапки.Имя = "ШапкаТалицы1" ИЛИ ОбластьШапки.Имя = "ШапкаТалицы2" Тогда
			НомерКолонки = 4;	
		КонецЕсли;
	КонецЕсли;
	
	РасчитатьСуммуПоНомеруКолонки(НачСтрока, НомерКолонки, Область, ОбщаяСумма, ТабДок);

	Если ОбластьШапки <> Неопределено Тогда
		Если ОбластьШапки.Имя = "ШапкаТалицыПродажи" Тогда
			НомерКолонки2 = 5;
			РасчитатьСуммуПоНомеруКолонки(НачСтрока, НомерКолонки2, Область, ОбщаяСумма2, ТабДок);
		КонецЕсли;
	КонецЕсли; 
	
	ОбластьПодвал = ТабДок.Области.Найти("ПодвалТаблицы" + СтрЗаменить(ОбластьШапки.Имя, "ШапкаТалицы", ""));
	
	Если ОбластьПодвал = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Областьподвал.Верх < Область.Верх Тогда //это не главная табл. возможно сокр.
		Возврат;	
	КонецЕсли;
	
	Если ОбщаяСумма = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	НомерКолонкиПроцент = 5;
	
	Если ОбластьПодвал.Имя = "ПодвалТаблицыПродажи" Тогда
		НомерКолонкиПроцент = 4;
	КонецЕсли;

	ТабДок.Область(Область.Верх + 1, НомерКолонкиПроцент, Область.Верх + 1, НомерКолонкиПроцент).Текст = "100%"; 
	
	НачСтрокаЦикл = НачСтрока;
	
	Пока НачСтрокаЦикл <= Область.Верх Цикл
		
		ЯчейкаСуммы = ТабДок.Область(НачСтрокаЦикл, НомерКолонки, НачСтрокаЦикл, НомерКолонки);
		
		Попытка
			СуммаЯчейки = Число(ЯчейкаСуммы.Текст);
			ПроцентЯчейки = Формат(СуммаЯчейки / ОбщаяСумма * 100,"ЧДЦ=2") + "%";
			ТабДок.Область(НачСтрокаЦикл, НомерКолонкиПроцент, НачСтрокаЦикл, НомерКолонкиПроцент).Текст = ПроцентЯчейки; 
		Исключение
		КонецПопытки;
		
		
		НачСтрокаЦикл = НачСтрокаЦикл + 1;
		
	КонецЦикла;	
	
	Если ОбластьПодвал.Имя <> "ПодвалТаблицыПродажи" Тогда
		Возврат;
	КонецЕсли;

	НомерКолонкиПроцент = 6;
	
	ТабДок.Область(Область.Верх + 1, НомерКолонкиПроцент, Область.Верх + 1, НомерКолонкиПроцент).Текст = "100%"; 
	
	Пока НачСтрока <= Область.Верх Цикл
		
		ЯчейкаСуммы = ТабДок.Область(НачСтрока, НомерКолонки2, НачСтрока, НомерКолонки2);
		
		Попытка
			СуммаЯчейки = Число(ЯчейкаСуммы.Текст);
			ПроцентЯчейки = Формат(СуммаЯчейки / ОбщаяСумма2 * 100,"ЧДЦ=2") + "%";
			ТабДок.Область(НачСтрока, НомерКолонкиПроцент, НачСтрока, НомерКолонкиПроцент).Текст = ПроцентЯчейки; 
		Исключение
		КонецПопытки;
		
		
		НачСтрока = НачСтрока + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСуммуПоНомеруКолонки(Знач НачСтрока, Знач НомерКолонки, Знач Область, ОбщаяСумма, Знач ТабДок)
	
	Перем ЯчейкаСуммы;
	
	Пока НачСтрока < Область.Верх Цикл
		ЯчейкаСуммы = ТабДок.Область(НачСтрока, НомерКолонки, НачСтрока, НомерКолонки);
		Если ЯчейкаСуммы.Текст <> "" Тогда
			Попытка
				ОбщаяСумма = ОбщаяСумма + Число(ЯчейкаСуммы.Текст);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		НачСтрока = НачСтрока + 1;
		
	КонецЦикла;
	
	ТабДок.Область(Область.Верх + 1, НомерКолонки, Область.Верх + 1, НомерКолонки).Текст = ОбщаяСумма;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтоги(НомерРедактируемойСтроки)
	
	Если НЕ ЭтаФорма.АвтоИтоги  Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЭтаФорма.ВидОтчета = "Інформація про господарську діяльність" Тогда
		ПересчитатьИтогиХозДеятельность(НомерРедактируемойСтроки);
		Возврат;
	КонецЕсли;
	
	ТабДок = ЭтаФорма.ТабличныйДокумент;
	
	//Область = ТабДок.Области.Найти("ДобавлениеСтроки");
	
	ТЗОбластей = Новый ТаблицаЗначений;
	ТЗОбластей.Колонки.Добавить("Имя");
	ТЗОбластей.Колонки.Добавить("Позиция");
	
	Для Каждого СтрокаОбл Из ТабДок.Области Цикл	
		Если Найти(СтрокаОбл.Имя, "ДобавлениеСтроки") > 0 ИЛИ Найти(СтрокаОбл.Имя, "ШапкаТалицы") > 0 Тогда //ИЛИ Найти(СтрокаОбл.Имя, "ПодвалТаблицы") > 0 Тогда
			Если СтрокаОбл.Верх = НомерРедактируемойСтроки Тогда
				Возврат;	
			КонецЕсли;
		
			НоваяСтрока = ТЗОбластей.Добавить();
			НоваяСтрока.Имя = СтрокаОбл.Имя;
			НоваяСтрока.Позиция = СтрокаОбл.Верх;			
		КонецЕсли;
	КонецЦикла;
	
	ТЗОбластей.Сортировать("Позиция");
	
	Для Каждого СтрокаОбл Из ТЗОбластей Цикл
		Если Найти(СтрокаОбл.Имя, "ДобавлениеСтроки") > 0 Тогда			
			Если СтрокаОбл.Позиция > НомерРедактируемойСтроки Тогда
				Область = ТабДок.Области.Найти(СтрокаОбл.Имя);
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;

	Если Область = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТЗОбластей.Сортировать("Позиция Убыв");
	НачСтрока = 5; 
	Для Каждого СтрокаОбл Из ТЗОбластей Цикл
		Если Найти(СтрокаОбл.Имя, "ШапкаТалицы") > 0 Тогда
			Если СтрокаОбл.Позиция < НомерРедактируемойСтроки Тогда
				ОбластьШапки = ТабДок.Области.Найти(СтрокаОбл.Имя);
				НачСтрока = ОбластьШапки.Верх + 1;	
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	
	ОбщаяСумма = 0;
	Пока НачСтрока < Область.Верх Цикл
		ЯчейкаСуммы = ТабДок.Область(НачСтрока, 3, НачСтрока, 3);
		Если ЯчейкаСуммы.Текст <> "" Тогда
			Попытка
				ОбщаяСумма = ОбщаяСумма + Число(ЯчейкаСуммы.Текст);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		НачСтрока = НачСтрока + 1;
		
	КонецЦикла;
	
	ТабДок.Область(Область.Верх + 1, 3, Область.Верх + 1, 3).Текст = ОбщаяСумма;
	
	ОбластьПодвал = ТабДок.Области.Найти("ПодвалТаблицы");
	
	Если ОбластьПодвал = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Областьподвал.Верх < Область.Верх Тогда //это не главная табл. возможно сокр.
		Возврат;	
	КонецЕсли;
	
	Если ОбщаяСумма = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТабДок.Область(Область.Верх + 1, 4, Область.Верх + 1, 4).Текст = "100%"; 	
	НачСтрока = 5; 
	
	Пока НачСтрока <= Область.Верх Цикл
		
		ЯчейкаСуммы = ТабДок.Область(НачСтрока, 3, НачСтрока, 3);
		
		Попытка
			СуммаЯчейки = Число(ЯчейкаСуммы.Текст);
			ПроцентЯчейки = Формат(СуммаЯчейки / ОбщаяСумма * 100,"ЧДЦ=2") + "%";
			ТабДок.Область(НачСтрока, 4, НачСтрока, 4).Текст = ПроцентЯчейки; 
		Исключение
		КонецПопытки;
		
		НачСтрока = НачСтрока + 1;
		
	КонецЦикла

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.КаталогВыгрузки = Параметры.КаталогВыгрузки;
	Объект.ПутьКурл = Параметры.ПутьКурл;
	Объект.ПоддерживаетсяTLS12 = Параметры.ПоддерживаетсяTLS12;
	Объект.АдресДокументооборота = Параметры.АдресДокументооборота;
	Объект.КодПоЕДРПОУ = Параметры.КодПоЕДРПОУ;

	Объект.ИспользоватьТокены = Параметры.ИспользоватьТокены;
	Объект.ТокеныКомпаний.Загрузить(Параметры.ТокеныКомпаний.Выгрузить());

	Объект.Организация = Параметры.Организация;
	Объект.РежимОтладки = Параметры.РежимОтладки;
	Объект.ФлажокПоказыватьПароль = Параметры.ФлажокПоказыватьПароль;

	Попытка
		Объект.ОтборПериод.ДатаНачала = Параметры.ОтборПериодДатаНачала;
		Объект.ОтборПериод.ДатаОкончания = Параметры.ОтборПериодДатаОкончания
	Исключение КонецПопытки;
	Попытка
		Объект.UnitТест = Параметры.UnitТест
	Исключение КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиОтчета(ВидОтчета)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбьект.ТаблицаПоказателей.Очистить();
	
	Если ВидОтчета = "Розшифровка звіту про фін.результати" Тогда
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інші операційні доходи, рядок 2120";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інші доходи, рядок 2240";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інші фінансові доходи, рядок 2220";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Собівартість реалізованої продукцiї (товарiв, робiт, послуг), рядок 2050";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Адміністративні витрати, рядок 2130";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Витрати на збут, рядок 2150";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інші операційні витрати, рядок 2180";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інші витрати, рядок 2270";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Фінансові витрати, рядок 2250";
		
	ИначеЕсли ВидОтчета = "Розшифровка рядків балансу" Тогда
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Основні засоби, рядок 1010";
        СтрокаПоказателя.ИмяМакета = "ОС";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Довгострокові фінансові інвестиції, рядок 1030";
		СтрокаПоказателя.ИмяМакета = "Фин";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Запаси, рядок 1100";
		СтрокаПоказателя.ИмяМакета = "Запаси";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Дебіторська заборгованість за продукцію, товари, роботи, послуги, рядок 1125";
		СтрокаПоказателя.ИмяМакета = "Заборгованість";

		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інша дебіторська заборгованість, рядок 1155";
		СтрокаПоказателя.ИмяМакета = "Заборгованість";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Короткострокові кредити банків, рядок 1600";
		СтрокаПоказателя.ИмяМакета = "Фин";

		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Кредиторська заборгованість за продукцію, товари, роботи, послуги, рядок 1615";
		СтрокаПоказателя.ИмяМакета = "Заборгованість";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Інша поточна заборгованість, рядок 1690";
		СтрокаПоказателя.ИмяМакета = "Заборгованість";
		
	Иначе
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Основні постачальники";
		СтрокаПоказателя.ИмяМакета = "ОсновныеПоставщикиПокупатели";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Основні покупці";
		СтрокаПоказателя.ИмяМакета = "ОсновныеПоставщикиПокупатели";
		
		СтрокаПоказателя = ОбработкаОбьект.ТаблицаПоказателей.Добавить();
		СтрокаПоказателя.ВыводитьВОтчет = Истина;
		СтрокаПоказателя.СтрокаБаланса = "Орендовані основні засоби";
		СтрокаПоказателя.ИмяМакета = "ОС";
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

// Процедура - обработчик команды Месяц.
//
&НаКлиенте
Процедура ПериодМесяц(Команда)
	
	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Истина;
	Элементы.ПериодКвартал.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодМесяц()

// Процедура - обработчик команды Квартал.
//
&НаКлиенте
Процедура ПериодКвартал(Команда)
	
	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Истина;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодМесяц()

// Процедура - обработчик команды ПериодВесь.
//
&НаКлиенте
Процедура ПериодВесь(Команда)
	
	Элементы.ПериодВесь.Пометка = Истина;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодВесь()

// Процедура формирует период расписания работ.
//
&НаКлиенте
Процедура СформироватьПредставлениеПериода()
	
	Элементы.ГруппаПроизвПериод.Видимость = Ложь;
	Элементы.ГруппаПериод.Видимость = Истина;
	
	Для Каждого Элемент Из Элементы.ГруппаКнопокПериода.ПодчиненныеЭлементы Цикл
		Если Элемент.Пометка Тогда
			Элементы.ГруппаКнопокПериода.Заголовок = Лев(Элементы.ГруппаКнопокПериода.Заголовок, Найти(Элементы.ГруппаКнопокПериода.Заголовок, ":")) + " " + Элемент.Заголовок;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьПериоды();
	
	Если Элементы.ПериодМесяц.Пометка Тогда
		
		ОтборПериод.ДатаНачала = НачалоМесяца(ДатаОтбора);
		ОтборПериод.ДатаОкончания = Мин(КонецМесяца(ДатаОтбора), ТекущаяДата());
		
		МесяцОтбора = Формат(ОтборПериод.ДатаНачала, "ДФ=МММ");
		ГодОтбора = Формат(Год(ОтборПериод.ДатаНачала), "ЧГ=0");
		ПредставлениеПериода = МесяцОтбора + " " + ГодОтбора + " р.";
		
	ИначеЕсли Элементы.ПериодКвартал.Пометка Тогда
		
		ОтборПериод.ДатаНачала = НачалоКвартала(ДатаОтбора);
		ОтборПериод.ДатаОкончания = Мин(КонецКвартала(ДатаОтбора), ТекущаяДата());
		
		ПредставлениеПериода = ПредставлениеПериода( НачалоДня(ОтборПериод.ДатаНачала), КонецКвартала(ОтборПериод.ДатаОкончания), "ФП = Истина");
				
	Иначе
		
		ПредставлениеПериода = Формат(ОтборПериод.ДатаНачала, "ДФ=dd.MM.yyyy") + "-" + Формат(ОтборПериод.ДатаОкончания, "ДФ=dd.MM.yyyy") + " р."; 
		Элементы.ГруппаПроизвПериод.Видимость = Истина;
		Элементы.ГруппаПериод.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьПредставлениеПериода()

// Процедура - обработчик команды УменьшитьПериод.
//
&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	Если Элементы.ПериодМесяц.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоМесяца(НачалоМесяца(ДатаОтбора) - 60 * 60 * 24));
		
	ИначеЕсли Элементы.ПериодМесяц.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоМесяца(НачалоМесяца(ДатаОтбора) - 60 * 60 * 24));
		
	ИначеЕсли Элементы.ПериодКвартал.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоКвартала(НачалоКвартала(ДатаОтбора) - 1));
		
	Иначе
		
		ДатаОтбора = КонецДня(ДатаОтбора - 60 * 60 * 24);
		
	КонецЕсли;
	
	СформироватьПредставлениеПериода();
	
	
КонецПроцедуры // УменьшитьПериод()

// Процедура - обработчик команды УвеличитьПериод.
//
&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	Если Элементы.ПериодМесяц.Пометка Тогда
		
		ДатаОтбора = КонецДня(КонецМесяца(ДатаОтбора) + 60 * 60 * 24);
		
	ИначеЕсли Элементы.ПериодКвартал.Пометка Тогда
	
		ДатаОтбора = КонецКвартала(КонецКвартала(ДатаОтбора) + 1);
	
	Иначе
		
		ДатаОтбора = КонецДня(ДатаОтбора + 60 * 60 * 24);
		
	КонецЕсли;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // УвеличитьПериод()

// Процедура - обработчик команды Календарь.
//
&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Попытка
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметров = Новый Структура("ДатаКалендаря", ДатаОтбора);
		
		//Если Объект.ОбработкаВнешняя Тогда
		Попытка
			ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаКалендаря", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ПредставлениеПериодаНачалоВыбораЗавершение", ЭтаФорма));
		//Иначе	
		Исключение
			ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ФормаКалендаря", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ПредставлениеПериодаНачалоВыбораЗавершение", ЭтаФорма));
		//КонецЕсли;
		КонецПопытки
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура - процедура обработчик оповещения выбора периода из календаря
//
// Параметры:
//  Результат				 - Дата - выбранный период 
//  ДополнительныеПараметры	 - Произвольный	- Дополнительные параметры оповещения
//
&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОтборПериод.ДатаНачала = Результат;
		ДатаОтбора = КонецДня(ОтборПериод.ДатаНачала);
		
		СформироватьПредставлениеПериода();
		
	КонецЕсли;
	
КонецПроцедуры // ПредставлениеПериодаНачалоВыбора()

&НаКлиенте
Процедура ПроверитьПериоды()
	
	Если ОтборПериод.ДатаНачала > КонецДня(ТекущаяДата()) ИЛИ ОтборПериод.ДатаОкончания > КонецДня(ТекущаяДата()) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Нельзя указывать дату больше текущей';uk='Не можна вказувати дату більше поточної'");;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	ОтборПериод.ДатаНачала = Мин(ОтборПериод.ДатаНачала, ТекущаяДата());
	ОтборПериод.ДатаОкончания = Мин(ОтборПериод.ДатаОкончания, ТекущаяДата());
	
	ДатаОтбора = Мин(ДатаОтбора, ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаОтбора = ТекущаяДата(); //считаем что всегда начинаем работу с текущей даты
	ОтборПериод.ДатаНачала = ДатаОтбора;
	ОтборПериод.ДатаОкончания = КонецДня(ДатаОтбора);
	
	Элементы.ПериодВесь.Пометка = Истина;
	СформироватьПредставлениеПериода();
	
	ВидОтчета = "Розшифровка звіту про фін.результати";
	ВидОтчетаПриИзменении(Неопределено);

	ВидимостьКнопокРасшКредИсходящие()
	
КонецПроцедуры

&НаСервере
Процедура ВидОтчетаПриИзмененииНаСервере(ВидОтчета)

	ЗаполнитьСтрокиОтчета(ВидОтчета)

КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)

	ВидОтчетаПриИзмененииНаСервере(ВидОтчета);
	ЗаполнитьСсылкуНаПример(ВидОтчета);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСсылкуНаПример(ВидОтчета)
	
	Если ВидОтчета = "Розшифровка звіту про фін.результати" Тогда
		ПримерОтчета = "https://docs.google.com/spreadsheets/d/1aoe-wfbfhY8rXnW_9qdCyF4cfDH6OkvXp9UezRzETno/edit#gid=668950472";
	ИначеЕсли ВидОтчета = "Розшифровка рядків балансу" Тогда
		ПримерОтчета = "https://docs.google.com/spreadsheets/d/131xfZNoQbiALGImLCpJxjxgpJEwj2jK4iGatw5UzgYE/edit#gid=963579626";
	Иначе
		ПримерОтчета = "https://docs.google.com/spreadsheets/d/122lBkrMvmEKK7Mhw6Np7G1rseFlQi7nFTXokbB7Na9A/edit#gid=2076980761";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОтчетНаСервере()
	
	Каталог = КаталогВременныхФайлов();
	
	ТабДок = ЭтаФорма.ТабличныйДокумент;
	
	ТЗОбластей = Новый ТаблицаЗначений;
	ТЗОбластей.Колонки.Добавить("Имя");
	
	Для Каждого Область Из ТабДок.Области Цикл
		Если Найти(Область.Имя, "ДобавлениеСтроки") > 0 Тогда			
			НоваяСтрока = ТЗОбластей.Добавить();
			НоваяСтрока.Имя = Область.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаОбласть Из ТЗОбластей Цикл
		Область = ТабДок.Область(СтрокаОбласть.Имя);
		ТабДок.УдалитьОбласть(ТабДок.Область("R" + Область.Верх + ":R" + Область.Верх), ТипСмещенияТабличногоДокумента.ПоВертикали); 
	КонецЦикла;	
	
	ТЗОбластей.Очистить();
	Для Каждого Область Из ТабДок.Области Цикл
		Если Найти(Область.Имя, "УдалитьСтроку") > 0 Тогда			
			НоваяСтрока = ТЗОбластей.Добавить();
			НоваяСтрока.Имя = Область.Имя;
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого СтрокаОбласть Из ТЗОбластей Цикл
		Область = ТабДок.Область(СтрокаОбласть.Имя);
		ТабДок.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.БезСмещения); 
	КонецЦикла;
	
	ТабДок.Автомасштаб = Истина; 
	ТабДок.Записать(Каталог + ЭтаФорма.ВидОтчета + ".pdf", ТипФайлаТабличногоДокумента.PDF);
	
	Адрес = УникальныйИдентификатор;
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Каталог + ЭтаФорма.ВидОтчета + ".pdf"), Адрес);
	
	НоваяСтрока = Объект.СписокФайлов.Добавить();
	НоваяСтрока.АдресФайла = АдресФайла;
	НоваяСтрока.ИмяФайла = ЭтаФорма.ВидОтчета + ".pdf";

	Если ЭтаФорма.ИдетОтправкаНаСайт Тогда
		ИмяФайлаОтчета = ЭтаФорма.ВидОтчета + ".pdf";
		ТекстОтчета = Новый ДвоичныеДанные(КаталогВременныхФайлов() + ИмяФайлаОтчета);;
		ОтправитьОтчетНаСервере(ИмяФайлаОтчета, ТекстОтчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчет(Команда) Экспорт

	Объект.ДействиеАналитики = "РасшифровкаСохранениеОтчета";

	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузки);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеКаталогаИВыгрузить(Знач ИмяКаталога) Экспорт
	
	// ищем нужный нам каталог, если его нет - то пытаемся создать
	Если ПустаяСтрока(ИмяКаталога) Тогда 
		ТекстСообщения = НСтр("ru='Не задан каталог для выгрузки';uk='Не заданий каталог для вивантаження'");
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВыбФайл = Новый Файл();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКаталога", ИмяКаталога);
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПроверкаРасширенияРаботыСфайламиПродолжение", ЭтаФорма, СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаРасширенияРаботыСфайламиПродолжение(Подключено,СтруктураПараметров) Экспорт 

	Если Не Подключено Тогда//Если Объект.ЭтоВебКлиент Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами. Операция займет несколько секунд...';uk='Для цієї операції необхідно встановити розширення роботи з файлами. Операція займе кілька секунд...'"));
		НачатьУстановкуРасширенияРаботыСФайлами();

		Ответ = Истина;
		ПроверкаСуществованияФайлаЗавершениеРК(Ответ, СтруктураПараметров);

		Возврат;
	КонецЕсли;

	ВыбФайл = Новый Файл(СтруктураПараметров.ИмяКаталога);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаСуществованияФайлаЗавершениеРК", ЭтаФорма, СтруктураПараметров);
	ВыбФайл.НачатьПроверкуСуществования(ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытию, ДействАналитики)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОбновитьСтатистикуРаботы(КатегорияПоСобытию, ДействАналитики)

КонецПроцедуры

&НаСервере
Функция КатегорияПоСобытиюНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Категория = ОбработкаОбьект.КатегорияПоСобытию();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат Категория

КонецФункции

&НаКлиенте
Процедура ПроверкаСуществованияФайлаЗавершениеРК(Ответ, Параметры) Экспорт

 	Если НЕ Ответ Тогда
		ТекстСообщения = НСтр("ru='Не найден каталог для выгрузки: ';uk='Не знайдений каталог для вивантаження: '") + Параметры.ИмяКаталога;
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СохранитьОтчетНаСервере();
	Если Не Объект.UnitТест И Не ИдетОтправкаНаСайт Тогда
		СохранитьФайлВыгрузкиНаКлиенте();
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлВыгрузкиНаКлиенте()

	РасширениеРаботыСФайламиУстановлено = ПодключитьРасширениеРаботыСФайлами();

	Попытка
		ПолучаемыеФайлы = Новый Массив;
		
		Если Объект.СписокФайлов.Количество() = 0 Тогда
			Возврат;	
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Объект.СписокФайлов Цикл
			ПолноеИмяPDFФайлаДокумента = ДобавитьКонечныйРазделительПути(Объект.КаталогВыгрузки) + СтрокаТЧ.ИмяФайла;
			Если Не РасширениеРаботыСФайламиУстановлено Тогда
				ПолучитьФайл(СтрокаТЧ.АдресФайла, ПолноеИмяPDFФайлаДокумента, Истина);
			Иначе
				ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ПолноеИмяPDFФайлаДокумента, СтрокаТЧ.АдресФайла);
				ПолучаемыеФайлы.Добавить(ОписаниеФайла);
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ИмяОтчета", СтрокаТЧ.ИмяФайла);
			КонецЕсли;
			Если Не Объект.UnitТест Тогда
				ТекстСообщения = НСтр("ru = 'Начато сохранение документа в PDF-файл ';uk='Розпочато збереження документа в PDF-файл '")
					+ ПолноеИмяPDFФайлаДокумента + НСтр("ru = ' из строки ';uk=' з рядку '") + СтрокаТЧ.НомерСтроки + ".";
				Сообщить(ТекстСообщения)
			КонецЕсли
		КонецЦикла;

		Объект.СписокФайлов.Очистить();

		Если Не Объект.UnitТест И РасширениеРаботыСФайламиУстановлено Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыССервера", ЭтаФорма, СтруктураПараметров);
			НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДобавитьКонечныйРазделительПути(Объект.КаталогВыгрузки), Ложь)
		КонецЕсли
		
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось записать файлы! Возможно, недостаточно места на диске или диск защищен от записи.';
		|;uk='Не вдалося записати файли! Можливо, недостатньо місця на диску або диск захищений від запису'");
		ТекстСообщения = ТекстСообщения + НСтр("ru=' Также, возможно, не подключено расширение для работы с файлами.';uk='Також, можливо, не підключено розширення для роботи з файлами.'");
		Сообщить(ТекстСообщения);
		Сообщить(ОписаниеОшибки());

		Сообщить(НСтр("ru='Не удалось выполнить сохранение документов!';uk='Не вдалося виконати збереження документів!'"));	
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыССервера(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Не удалось записать файлы! Возможно, недостаточно места на диске или диск защищен от записи.';
		|;uk='Не вдалося записати файли! Можливо, недостатньо місця на диску або диск захищений від запису'");
		ТекстСообщения = ТекстСообщения + НСтр("ru=' Также, возможно, не подключено расширение для работы с файлами.';uk='Також, можливо, не підключено розширення для роботи з файлами.'");
		Сообщить(ТекстСообщения);
		Сообщить(НСтр("ru='Не удалось выполнить сохранение отчета!';uk='Не вдалося виконати збереження звіту!'"));		
	Иначе
		Если Не Объект.UnitТест И НЕ ИдетОтправкаНаСайт Тогда
			Сообщить(НСтр("ru='Сохранение отчета завершено.';uk='Збереження звіту завершено.'"));  
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

// Добавляет к переданному пути каталога конечный символ-разделитель, если он отсутствует.
// Параметры:
//  ПутьКаталога - Строка - путь к каталогу.
// Возвращаемое значение:
//  Строка - путь к каталогу с конечным символом-разделителем.
// Примеры использования:
//  Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог"); // возвращает "C:\Мой каталог\"
//  Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог\"); // возвращает "C:\Мой каталог\"
//  Результат = ДобавитьКонечныйРазделительПути("%APPDATA%"); // возвращает "%APPDATA%\"
//
&НаКлиенте
Функция ДобавитьКонечныйРазделительПути(Знач ПутьКаталога, Знач Удалить_Платформа = Неопределено)
	
	Если ПустаяСтрока(ПутьКаталога) Тогда
		Возврат ПутьКаталога;
	КонецЕсли;
	
	ДобавляемыйСимвол = ПолучитьРазделительПути();
	
	Если Прав(ПутьКаталога, 1) = ДобавляемыйСимвол Тогда
		Возврат ПутьКаталога;
	Иначе 
		Возврат ПутьКаталога + ДобавляемыйСимвол;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПримерОтчетаНажатие(Элемент)

	ЗапуститьПриложение(ПримерОтчета);

КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетНаСервере(ИмяФайлаОтчета, ТекстОтчета)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");	
	ОбработкаОбьект.ОтправитьPDFОтчет(ИмяФайлаОтчета, ТекстОтчета);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ИдетОтправкаНаСайт = Ложь
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчет(Команда) Экспорт

	ИдетОтправкаНаСайт = Истина;
	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузки);

КонецПроцедуры
