
&НаСервере
Процедура ЗагрузитьНаСервере(АдресВременногоХранилища)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	// получаем имя временного файла в локальной ФС на сервере
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	// получаем файл правил для зачитки
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ДвоичныеДанные = Неопределено;
	
	УникальныйИдентификатор_        = Новый УникальныйИдентификатор();
	ИмяВременногоФайлаПротоколаОбмена = КаталогВременныхФайлов() + УникальныйИдентификатор_ + ".txt";
	
	УОД = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УОД.ИмяФайлаОбмена                        = ИмяВременногоФайла;
	УОД.РежимОбмена                           = "Загрузка";
	УОД.ЗапоминатьЗагруженныеОбъекты          = Ложь;
	УОД.ВыводВПротоколСообщенийОбОшибках      = Истина;
	УОД.ВыводВПротоколИнформационныхСообщений = Ложь;
	УОД.ИмяФайлаПротоколаОбмена               = ИмяВременногоФайлаПротоколаОбмена;
	
	УОД.ЗагружатьДанныеВРежимеОбмена               = Истина;
	УОД.ОбъектыПоСсылкеЗагружатьБезПометкиУдаления = Истина;
	УОД.ОптимизированнаяЗаписьОбъектов             = Истина;
	УОД.ЗапоминатьЗагруженныеОбъекты               = Истина;
	УОД.ЭтоИнтерактивныйРежим                      = Истина;
	
	УОД.ФлагРежимОтладкиОбработчиков = Истина;
	УОД.ИмяФайлаВнешнейОбработкиОбработчиковСобытий = "ОбработчикиЗагрузкиИзТорговляДляЧастныхПредпринимателей";
	
	УстановитьПривилегированныйРежим(Истина);
	УОД.ВыполнитьЗагрузку();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПротоколОбмена = Новый ТекстовыйДокумент;
	ПротоколОбмена.Прочитать(ИмяВременногоФайлаПротоколаОбмена);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайлаПротоколаОбмена);  // Удаляем временный файл правил
	Исключение
	КонецПопытки;
	
	Элементы.ПротоколОбмена.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Попытка
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект);
		
		Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
			НачатьПомещениеФайла(ОписаниеОповещения, АдресВременногоХранилища, "*.xml",, УникальныйИдентификатор); 
		Иначе
			НачатьПомещениеФайла(ОписаниеОповещения, АдресВременногоХранилища, ИмяФайлаОбмена, Ложь, УникальныйИдентификатор) 
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Ошибка при загрузке данных.';uk='Помилка при завантаженні даних.'");
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		
		АдресВременногоХранилища = Адрес;
		
		ОчиститьСообщения();
		ПротоколОбмена.Очистить();
		
		Состояние(НСтр("ru='Загрузка данных...';uk='Завантаження даних...'"),, НСтр("ru='Выполняется загрузка данных из ""Торговля для частных предпринимателей""';uk='Виконується завантаження даних з ""Торгівля для приватних підприємців""'"));
		ЗагрузитьНаСервере(АдресВременногоХранилища);
		
		ОбновитьИнтерфейс();
		СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();
		
		ПоказатьОповещениеПользователя(НСтр("ru='Загрузка завершена';uk='Завантаження завершене'"),,, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяФайлаОбмена = Элемент.ТекстРедактирования;
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Фильтр             = "Файл выгрузки (*.xml)|*.xml";
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите путь к файлу выгрузки данных из УТ 10.3';uk='Виберіть шлях до файлу вивантаження даних з УТ 10.3'");
		ДиалогОткрытияФайла.Каталог = ПолучитьПутьККаталогу();
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ИмяФайлаОбмена = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(Неопределено,НСтр("ru='Для выбора каталога необходимо установить расширение для работы с файлами в Веб-клиенте.';uk='Для вибору каталогу необхідно встановити розширення для роботи з файлами у Веб-клієнтові.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		Элементы.ИмяФайлаОбмена.Видимость = Ложь;
		Элементы.ПредупреждениеЗагрузка.Видимость = Истина;
	Иначе
		Элементы.ИмяФайлаОбмена.Видимость = Истина;
		Элементы.ПредупреждениеЗагрузка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПутьККаталогу()

	ПутьККаталогу = "";
	Если ЗначениеЗаполнено(ИмяФайлаОбмена) Тогда
		
		Файл = Новый Файл(ИмяФайлаОбмена);
		Если Файл.Существует() Тогда
			ПутьККаталогу = Файл.Путь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПутьККаталогу;

КонецФункции
