
#Область ПрограммныйИнтерфейс

Функция ОпределитьПараметрыСообщения(ТекстСообщения) Экспорт
	
	ПараметрыСообщения = Новый Соответствие;
	
	Текст = ТекстСообщения;
	Позиция = СтрНайти(Текст, "[");
	Пока Позиция > 0 Цикл
		Текст = Сред(Текст, Позиция + 1);
		Позиция = СтрНайти(Текст, "]");
		Если Позиция > 0 Тогда
			НайденныйПараметр = Лев(Текст, Позиция-1);
			ПараметрыСообщения.Вставить(НайденныйПараметр);
			Текст = Сред(Текст, Позиция + 1);
		КонецЕсли;
		Позиция = СтрНайти(Текст, "[");
	КонецЦикла;
	
	Возврат ПараметрыСообщения;
	
КонецФункции

#КонецОбласти
