
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РазблокироватьРаботуСВнешнимиРесурсамиСервер();
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Разблокировка';uk='Разблокировка'"),
		,
		НСтр("ru='Работа с внешними ресурсами разблокирована';uk='Работа с внешними ресурсами разблокирована'"),
		БиблиотекаКартинок.Информация32
	);
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьРаботуСВнешнимиРесурсамиСервер()
	
	РегламентныеЗаданияСлужебный.РазрешитьРаботуСВнешнимиРесурсами();
	
КонецПроцедуры
