////////////////////////////////////////////////////////////////////////////////
// ОбменСКонтрагентами: механизм обмена электронными документами.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Включает/выключает функционал ЭДО с контрагентами.
//
// Параметры:
// Включить - Булево - выключить или выключить функционал ЭДО.
//
Процедура УстановитьЗначенияКонстантЭДО(Включить = Истина) Экспорт
	
	ИспользуютсяОбменЭД = ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЗначениеФункциональнойОпции(
		"ИспользоватьОбменЭД");
	Если Не ИспользуютсяОбменЭД Тогда
		Константы.ИспользоватьОбменЭД.Установить(Включить);
	КонецЕсли;
	
	ИспользуютсяЭП = ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЗначениеФункциональнойОпции(
		"ИспользоватьЭлектронныеПодписиЭД");
	Если Не ИспользуютсяЭП Тогда
		Константы.ИспользоватьЭлектронныеПодписи.Установить(Включить);
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСВерсиямиЭлектронныхДокументов

// Получает представление (текст либо структура) состояний электронных документов по владельцам.
//
// Параметры:
//  МассивСсылокНаВладельцев - Массив - Массив ссылок на владельцев электронных документов, данные которых необходимо получить.
//  ПомещатьВСтруктуру - Булево - если истина, то представления состояний электронных документов
//                      (СостояниеВерсииЭД, ДействияСНашейСтороны, ДействияСоСтороныДругогоУчастника),
//                      будут помещены в структуру, для возможности последующего разбора на клиенте.
//
// Возвращаемое значение:
//  Соответствие - соответствие ссылок на документы ИБ состояниям ЭД. Ключ - ссылка на документ ИБ,
//                Значение - текст (состояние ЭД), либо структура - в зависимости от параметра ПомещатьВСтруктуру.
//
Функция ПолучитьТекстСостоянияЭДПоВладельцам(МассивСсылокНаВладельцев, ПомещатьВСтруктуру = Ложь) Экспорт
		
	ТаблицаДанных = ОбменСКонтрагентамиСлужебныйВызовСервера.ПолучитьДанныеЭДПоВладельцам(МассивСсылокНаВладельцев);
	Соответствие = Новый Соответствие;
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		
		Если ПомещатьВСтруктуру Тогда
			СостояниеВерсииЭД = Новый Структура("СостояниеВерсииЭД, ДействияСНашейСтороны, ДействияСоСтороныДругогоУчастника");
			ЗаполнитьЗначенияСвойств(СостояниеВерсииЭД, ТекСтрока);
		Иначе
			СостояниеВерсииЭД = Строка(ТекСтрока.СостояниеВерсииЭД);
		КонецЕсли;
		Соответствие.Вставить(ТекСтрока.ВладелецЭД, СостояниеВерсииЭД);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область ОбработкаЭлектронныхДокументов

// Возвращает текст запроса для электронных документов на подписи.
// Варианты - для рабочего места документов на подпись, или для показателя на рабочем столе (УТ 11).
//
// Параметры:
//  ДляРабочегоСтола - Булево - признак того, что текст запроса формируется для показателя на рабочем столе (УТ 11).
//  СтруктураДопОтборов - Структура - дополнительные отборы. 
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаЭлектронныхДокументовНаПодписи(ДляРабочегоСтола = Истина, СтруктураДопОтборов = Неопределено) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭлектронныйДокументВходящий.ВидЭД КАК ВидЭД,
	|	ЭлектронныйДокументВходящий.СуммаДокумента КАК СуммаДокумента,
	|	ЭлектронныйДокументВходящий.ДатаДокументаОтправителя КАК ДатаДокументаОтправителя,
	|	ЭлектронныйДокументВходящий.Организация КАК Организация,
	|	ЭлектронныйДокументВходящий.Контрагент КАК Контрагент,
	|	ЭлектронныйДокументВходящий.НастройкаЭДО КАК НастройкаЭДО,
	|	ЭлектронныйДокументВходящий.ПрофильНастроекЭДО КАК ПрофильНастроекЭДО,
	|	ЭлектронныйДокументВходящий.Ссылка КАК Ссылка,
	|	ЭлектронныйДокументВходящий.НомерВерсииЭД КАК НомерВерсииЭД
	|ПОМЕСТИТЬ втДокументыНаПодписи
	|ИЗ
	|	Документ.ЭлектронныйДокументВходящий КАК ЭлектронныйДокументВходящий
	|ГДЕ
	|	ЭлектронныйДокументВходящий.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.НаПодписи)
	|	И НЕ ЭлектронныйДокументВходящий.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭлектронныйДокументИсходящий.ВидЭД,
	|	ЭлектронныйДокументИсходящий.СуммаДокумента,
	|	ЭлектронныйДокументИсходящий.ДатаДокументаОтправителя,
	|	ЭлектронныйДокументИсходящий.Организация,
	|	ЭлектронныйДокументИсходящий.Контрагент,
	|	ЭлектронныйДокументИсходящий.НастройкаЭДО,
	|	ЭлектронныйДокументИсходящий.ПрофильНастроекЭДО,
	|	ЭлектронныйДокументИсходящий.Ссылка,
	|	ЭлектронныйДокументИсходящий.НомерВерсииЭД
	|ИЗ
	|	Документ.ЭлектронныйДокументИсходящий КАК ЭлектронныйДокументИсходящий
	|ГДЕ
	|	ЭлектронныйДокументИсходящий.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.НаПодписи)
	|	И НЕ ЭлектронныйДокументИсходящий.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументыНаПодписи.ВидЭД КАК ВидЭД,
	|	втДокументыНаПодписи.СуммаДокумента КАК СуммаДокумента,
	|	втДокументыНаПодписи.ДатаДокументаОтправителя КАК ДатаДокументаОтправителя,
	|	втДокументыНаПодписи.Организация КАК Организация,
	|	втДокументыНаПодписи.Контрагент КАК Контрагент,
	|	втДокументыНаПодписи.НастройкаЭДО КАК СоглашениеЭД,
	|	втДокументыНаПодписи.ПрофильНастроекЭДО КАК ПрофильНастроекЭДО,
	|	ЭДПрисоединенныеФайлы.Ссылка КАК ЭД,
	|	ЭДПрисоединенныеФайлы.НаправлениеЭД КАК НаправлениеЭД,
	|	втДокументыНаПодписи.НомерВерсииЭД КАК Версия,
	|	ЭДПрисоединенныеФайлы.СтатусЭД КАК СтатусЭД,
	|	ЭДПрисоединенныеФайлы.Изменил КАК Изменил
	|ПОМЕСТИТЬ ЭДНаПодпись
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДокументыНаПодписи КАК втДокументыНаПодписи
	|		ПО (ЭДПрисоединенныеФайлы.ВладелецФайла = втДокументыНаПодписи.Ссылка)
	|			И (ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД)))
	|ИНДЕКСИРОВАТЬ ПО
	|	втДокументыНаПодписи.НастройкаЭДО,
	|	втДокументыНаПодписи.Организация,
	|	втДокументыНаПодписи.ВидЭД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Сертификат,
	|	ВложенныйЗапрос.ЭД
	|ПОМЕСТИТЬ ВТ_СертификатыИзНастроекИПрофилей
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрофилиЭДОСертификаты.Сертификат КАК Сертификат,
	|		ЭДНаПодпись.ЭД КАК ЭД,
	|		ЭДНаПодпись.ВидЭД КАК ВидЭД
	|	ИЗ
	|		ЭДНаПодпись КАК ЭДНаПодпись
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиНастроекЭДО.СертификатыПодписейОрганизации КАК ПрофилиЭДОСертификаты
	|			ПО ЭДНаПодпись.ПрофильНастроекЭДО = ПрофилиЭДОСертификаты.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СоглашенияЭДСертификаты.Сертификат,
	|		ЭДНаПодпись.ЭД,
	|		ЭДНаПодпись.ВидЭД
	|	ИЗ
	|		ЭДНаПодпись КАК ЭДНаПодпись
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияОбИспользованииЭД.СертификатыПодписейОрганизации КАК СоглашенияЭДСертификаты
	|			ПО ЭДНаПодпись.СоглашениеЭД = СоглашенияЭДСертификаты.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыЭП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписываемыеВидыЭД КАК ПодписываемыеВидыЭД
	|			ПО СертификатыЭП.Ссылка = ПодписываемыеВидыЭД.СертификатЭП
	|		ПО ВложенныйЗапрос.Сертификат = СертификатыЭП.Ссылка
	|ГДЕ
	|	СертификатыЭП.Пользователь В (&ТекущийПользователь, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка), СертификатыЭП.Пользователь = &ПользовательНеУказан)
	|	И НЕ СертификатыЭП.Отозван
	|	И НЕ СертификатыЭП.ПометкаУдаления
	|	И ПодписываемыеВидыЭД.Использовать
	|	И ПодписываемыеВидыЭД.ВидЭД = ВложенныйЗапрос.ВидЭД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ПоляВыбора
	|ИЗ
	|	ЭДНаПодпись КАК ЭДНаПодпись
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияЭД
	|		ПО ЭДНаПодпись.СоглашениеЭД = СоглашенияЭД.Ссылка
	|			И (СоглашенияЭД.СтатусПодключения = ЗНАЧЕНИЕ(Перечисление.СтатусыУчастниковОбменаЭД.Присоединен))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СертификатыИзНастроекИПрофилей КАК СертификатыЭП
	|		ПО ЭДНаПодпись.ЭД = СертификатыЭП.ЭД
	|ГДЕ
	|	НЕ СоглашенияЭД.ПометкаУдаления
	|	И НЕ СертификатыЭП.Сертификат.Отпечаток В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ЭД_ЭП.Отпечаток
	|				ИЗ
	|					Справочник.ЭДПрисоединенныеФайлы.ЭлектронныеПодписи КАК ЭД_ЭП
	|				ГДЕ
	|					ЭД_ЭП.Ссылка = ЭДНаПодпись.ЭД)";
		
	Если ДляРабочегоСтола Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбора", "
			|	СертификатыЭП.Сертификат.Отпечаток КАК Отпечаток,
			|	СертификатыЭП.Сертификат.Представление КАК Сертификат,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СертификатыЭП.Сертификат) КАК ЗначениеПоказателя
			|");
		
		Если СтруктураДопОтборов <> Неопределено И ТипЗнч(СтруктураДопОтборов) = Тип("Структура")
			И СтруктураДопОтборов.Количество() > 0 И СтруктураДопОтборов.Свойство("ОтборПоИсполнителям") Тогда
			ТекстЗапроса = ТекстЗапроса + " И ЭДНаПодпись.Изменил В (&СоставИсполнителей)";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
			|СГРУППИРОВАТЬ ПО
			|	СертификатыЭП.Сертификат.Отпечаток,
			|	СертификатыЭП.Сертификат.Представление";
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбора", "
			|	ЭДНаПодпись.ЭД КАК ЭлектронныйДокумент,
			|	ЭДНаПодпись.СуммаДокумента,
			|	ЭДНаПодпись.Версия,
			|	ЭДНаПодпись.ДатаДокументаОтправителя КАК ДатаДокумента,
			|	ЭДНаПодпись.ВидЭД КАК ВидЭД,
			|	СертификатыЭП.Сертификат КАК Сертификат
			|");
		
		Если СтруктураДопОтборов <> Неопределено И ТипЗнч(СтруктураДопОтборов) = Тип("Структура")
			И СтруктураДопОтборов.Количество() > 0 Тогда
			
			Если СтруктураДопОтборов.Свойство("ОтборПоИсполнителям") Тогда
				ТекстЗапроса = ТекстЗапроса + " И ЭДНаПодпись.Изменил В (&СоставИсполнителей)";
			КонецЕсли;
			Если СтруктураДопОтборов.Свойство("Контрагент") Тогда
				ТекстЗапроса = ТекстЗапроса + " И ЭДНаПодпись.Контрагент = &Контрагент";
			КонецЕсли;
			Если СтруктураДопОтборов.Свойство("ВидЭД") Тогда
				ТекстЗапроса = ТекстЗапроса + " И ЭДНаПодпись.ВидЭД = &ВидЭД";
			КонецЕсли;
			Если СтруктураДопОтборов.Свойство("НаправлениеЭД") Тогда
				ТекстЗапроса = ТекстЗапроса + " И ЭДНаПодпись.НаправлениеЭД = &НаправлениеЭД";
			КонецЕсли;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО ДатаДокумента";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеОбъектов

// В процедуре происходит добавление данных из СтруктурыДанных в Таблицу значений "ТаблицаДопДанных".
//
// Параметры:
//  СтруктураПараметров - Структура - параметры добавления дополнительных данных.
//  СтруктураДанных - Структура - параметры добавляемых данных.
//  ИмяЭлементаВладельца - Строка - название реквизита.
//  ЮридическиЗначимый - Булево - если Истина - то текущие данные необходимо по возможности поместить в основной ЭД.
//  НомерСтроки - Строка/Неопределено - если заполнен, то указывает на принадлежность текущих данных табличной части.
//    Значение параметра указывает к какой строке табличной части относятся данные. Может иметь вид "1" или "1.1".
//    Если значение вида "1.1", то это значит, что текущие данные относятся к первой строке табличной части, 
//    расположенной в первой строке таблицы-владельца. (подробнее см. схему ХДТО "АктТитулИсполнителя",
//    список "ОписьРабот", вложенный список "Работа").
//
Процедура ДобавитьДанныеВДеревоДопДанных(СтруктураПараметров, СтруктураДанных, ИмяЭлементаВладельца, ЮридическиЗначимый = Ложь, НомерСтроки = Неопределено) Экспорт
	
	ДеревоДопДанных = СтруктураПараметров.ДеревоДопДанных;
	Если ТипЗнч(ДеревоДопДанных) = Тип("ДеревоЗначений") Тогда
		ЭлементТЧ = (НомерСтроки <> Неопределено);
		СтОтбора = Новый Структура("ЗначениеРеквизита, ТЧ", ИмяЭлементаВладельца, ЭлементТЧ);
		СтрокиДерева = ДеревоДопДанных.Строки.НайтиСтроки(СтОтбора, Истина);
		
		Если СтрокиДерева.Количество() = 0 Тогда
			СтрокаДерева = ДеревоДопДанных.Строки.Добавить();
			СтрокаДерева.ИмяРеквизита = ?(ЭлементТЧ, "Список", "Набор");
			СтрокаДерева.ЗначениеРеквизита = ИмяЭлементаВладельца;
			СтрокаДерева.ТЧ = ЭлементТЧ;
		Иначе
			СтрокаДерева = СтрокиДерева[0];
		КонецЕсли;
		
		Если ЭлементТЧ Тогда
			СтОтбора = Новый Структура("ИмяРеквизита, ЗначениеРеквизита", "Нпп", Строка(НомерСтроки));
			СтрокиСписка = СтрокаДерева.Строки.НайтиСтроки(СтОтбора);
			Если СтрокиСписка.Количество() = 0 Тогда
				СтрокаДерева = СтрокаДерева.Строки.Добавить();
				СтрокаДерева.ИмяРеквизита = "Нпп";
				СтрокаДерева.ТЧ = ЭлементТЧ;
				СтрокаДерева.ЗначениеРеквизита = Строка(НомерСтроки);
			Иначе
				СтрокаДерева = СтрокиСписка[0];
			КонецЕсли;
		КонецЕсли;
		
		ДоступноСимволов = 0;
		Если ЮридическиЗначимый Тогда
			Если НомерСтроки = Неопределено Тогда
				ДоступноСимволов = СтруктураПараметров.ДопустимаяДлинаДопДанныхШапки;
			Иначе
				ДоступноСимволов = СтруктураПараметров.ДопустимаяДлинаДопДанныхСтроки;
			КонецЕсли;
		КонецЕсли;
		
		ДобавитьДанныеРекурсивно(СтрокаДерева,
								 СтруктураДанных,
								 ДоступноСимволов,
								 ЮридическиЗначимый,
								 ЭлементТЧ,
								 НомерСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФорм

// Функция - Параметры "ПриСозданииНаСервере" формы документа.
// 
// Возвращаемое значение:
//  Структура - параметры, которые нужно передавать в метод "ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента".
//    * Форма - УправляемаяФорма - форма документа.
//    * ДокументСсылка - ДокументСсылка - Ссылка на документ.
//    * ДекорацияСостояниеЭДО - ЭлементФормы - элемент формы "декорация", в заголовке которого будет отображаться состояние ЭДО.
//    * ГруппаСостояниеЭДО - ЭлементФормы - элемент формы "группа", которому может принадлежать ДекорацияСостояниеЭДО, необязательный параметр.
//    * МестоРазмещенияКоманд - ЭлементФормы - элемент формы "группа", в котором должны отображаться команды ЭДО, необязательный параметр.
//    * Направление - ПеречислениеСсылка.НаправленияЭД - указывает направление электронного документа для документа ИБ.
//
Функция ПараметрыПриСозданииНаСервере_ФормаДокумента() Экспорт
	
	ПараметрыПриСоздании = Новый Структура("Форма, ДокументСсылка, ДекорацияСостояниеЭДО, ГруппаСостояниеЭДО, МестоРазмещенияКоманд, Направление");
	
	Возврат ПараметрыПриСоздании;
	
КонецФункции

// Обработчик события "ПриСозданииНаСервере" формы документа.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события.
//  ПараметрыПриСозданииНаСервере - Структура - см."ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента".
//   
Процедура ПриСозданииНаСервере_ФормаДокумента(Отказ, СтандартнаяОбработка, ПараметрыПриСозданииНаСервере) Экспорт
	
	ЗаполнитьСостояниеЭДО(ПараметрыПриСозданииНаСервере);
	
	РазместитьНаФормеКомандыЭДО(ПараметрыПриСозданииНаСервере);
	
КонецПроцедуры

// Функция - Параметры "ПриСозданииНаСервере" форма списка документов.
// 
// Возвращаемое значение:
//  Структура - параметры, которые необходимо передать в метод "ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка".
//    * Форма - УправляемаяФорма - форма списка документа.
//    * МестоРазмещенияКоманд - ЭлементФормы - элемент формы "группа", в котором должны отображаться команды ЭДО, необязательный параметр.
//    * Направление - ПеречислениеСсылка.НаправленияЭД - указывает направление электронного документа для документа ИБ.
//
Функция ПараметрыПриСозданииНаСервере_ФормаСписка() Экспорт
	
	ПараметрыПриСоздании = Новый Структура("Форма, МестоРазмещенияКоманд, Направление");
	
	Возврат ПараметрыПриСоздании;
	
КонецФункции

// Обработчик события "ПриСозданииНаСервере" формы списка документов
//
// Параметры:
//  Отказ - булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - булево - Признак выполнения стандартной (системной) обработки события.
//  ПараметрыПриСозданииНаСервере - структура - см."ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка".
//
Процедура ПриСозданииНаСервере_ФормаСписка(Отказ, СтандартнаяОбработка, ПараметрыПриСозданииНаСервере) Экспорт
	
	РазместитьНаФормеКомандыЭДО(ПараметрыПриСозданииНаСервере);
	
КонецПроцедуры

// Функция - Параметры "ПослеЗаписиНаСервере" формы документа.
// 
// Возвращаемое значение:
//  Структура - Параметры, которые нужно передавать в метод "ОбменСКонтрагентами.ПослеЗаписиНаСервере".
//    * Форма - УправляемаяФорма - форма документа.
//    * ДокументСсылка - ДокументСсылка - ссылка на документ.
//    * ДекорацияСостояниеЭДО - ЭлементФормы - элемент формы "декорация", в заголовке которого будет отображаться состояние ЭДО, необязательный параметр.
//    * ГруппаСостояниеЭДО - ЭлементФормы - элемент формы "группа", которому может принадлежать ДекорацияСостояниеЭДО, необязательный параметр.
//
Функция ПараметрыПослеЗаписиНаСервере() Экспорт
	
	ПараметрыПослеЗаписи = Новый Структура("Форма, ДокументСсылка, ДекорацияСостояниеЭДО, ГруппаСостояниеЭДО");
	Возврат ПараметрыПослеЗаписи;
	
КонецФункции

// Обработчик события "ПослеЗаписиНаСервере" формы документа
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Записываемый объект.
//  СтандартнаяОбработка - Структура - Структура, содержащая параметры записи.
//  ПараметрыПослеЗаписи - Структура - см."ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ДокументОбъект, СтандартнаяОбработка, ПараметрыПослеЗаписи) Экспорт
	
	ЗаполнитьСостояниеЭДО(ПараметрыПослеЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ПодменюКомандЭДО

// Формирование команд ЭДО.
//
// Параметры:
//  ПолноеИмя - Строка - имя объекта, например "Документ.РеализацияТоваровУслуг".
//  КомандыЭДО - ТаблицаЗначений - подготавливаемый список команд ЭДО.
//  НаправлениеЭД - Перечисление.НаправлениеЭД - параметр отбора входящих или исходящих документов.
//  ТолькоВМенюЕще - Булево - признак размещения команд в меню "Еще".
//
Процедура СформироватьКомандыЭДО(ПолноеИмя, КомандыЭДО, НаправлениеЭД = Неопределено, ТолькоВМенюЕще = Ложь) Экспорт
	
	СоставКоманд = КомандыЭДО();
	
	ОбменСКонтрагентамиПереопределяемый.ПодготовитьСтруктуруОбъектовКомандЭДО(СоставКоманд);
	
	ЗначениеФОИспользоватьОбменЭД = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭД");
	ЗначениеФОИспользоватьИнтеркампани = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭДМеждуОрганизациями");
	ЗначениеФОИспользоватьОбменБизнесСеть = ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть");
	
	ЕстьПравоПросмотраЭД = Пользователи.ЭтоПолноправныйПользователь()
		ИЛИ Пользователи.РолиДоступны("ЧтениеЭД");
		
	ЕстьПравоОбменаЭД = Пользователи.ЭтоПолноправныйПользователь()
		ИЛИ Пользователи.РолиДоступны("ВыполнениеОбменаЭД");
		
	ЕстьПравоОбменаБизнесСеть = Пользователи.ЭтоПолноправныйПользователь()
		ИЛИ Пользователи.РолиДоступны("ВыполнениеОбменаБизнесСеть");
			
	Если СоставКоманд.Исходящие.Найти(ПолноеИмя) <> Неопределено 
			И НаправлениеЭД <> Перечисления.НаправленияЭД.Входящий Тогда
		
		Если ЗначениеФОИспользоватьОбменЭД Тогда
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ОткрытьАктуальныйЭД";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ОткрытьАктуальныйЭД";
			КомандаЭДО.Представление = НСтр("ru='Просмотреть электронный документ';uk='Просмотреть электронный документ'");
			КомандаЭДО.Порядок       = 10;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.ОткрытьВыбранныйФайл;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.СформироватьЭД";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "СформироватьЭД";
			КомандаЭДО.Представление = НСтр("ru='Создать электронный документ';uk='Создать электронный документ'");
			КомандаЭДО.Порядок       = 15;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.СоздатьЭлементСписка;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.СформироватьПодписатьОтправитьЭД";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "СформироватьПодписатьОтправитьЭД";
			КомандаЭДО.Представление = НСтр("ru='Отправить электронный документ';uk='Отправить электронный документ'");
			КомандаЭДО.Порядок       = 20;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.ЭлектронныйДокументИсходящий;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;
				
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ДеревоЭД";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ДеревоЭД";
			КомандаЭДО.Представление = НСтр("ru='Открыть электронные документы';uk='Открыть электронные документы'");
			КомандаЭДО.Порядок       = 25;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.Подсистема;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ОткрытьТекущиеДелаЭДО";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ОткрытьТекущиеДелаЭДО";
			КомандаЭДО.Представление = НСтр("ru='Текущие дела ЭДО';uk='Текущие дела ЭДО'");
			КомандаЭДО.Порядок       = 30;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;

			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.СоздатьПроизвольныйЭДНаОсновании";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "СоздатьПроизвольныйДокумент";
			КомандаЭДО.Представление = НСтр("ru='Создать произвольный документ';uk='Создать произвольный документ'");
			КомандаЭДО.Порядок       = 50;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.Скрепка;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОДополнительное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;
			
		КонецЕсли;
		
		// Команды из механизма однократных сделок не завязаны на ФО и роли БЭД.
		КомандаЭДО = КомандыЭДО.Добавить();
		КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ВыгрузитьДанныеВФайл";
		КомандаЭДО.СписокФорм = "";
		КомандаЭДО.Идентификатор = "ВыгрузитьДанныеВФайл";
		КомандаЭДО.Представление = НСтр("ru='Выгрузить документ в файл';uk='Вивантажити документ в файл'");
		КомандаЭДО.Порядок       = 50;
		КомандаЭДО.Картинка      = БиблиотекаКартинок.ВыгрузитьДанныеИзИнформационнойБазыВXMLФайл;
		КомандаЭДО.МестоРазмещения = "КомандыЭДОДополнительное";
		КомандаЭДО.ТолькоВоВсехДействиях = Истина;
		КомандаЭДО.Недоступна    = Ложь;
		
		Если СоставКоманд.БезПодписи.Найти(ПолноеИмя) <> Неопределено Тогда
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "БизнесСетьКлиент.ОтправитьЧерезБизнесСеть";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ОтправитьЧерезБизнесСеть";
			КомандаЭДО.Представление = НСтр("ru='Отправить документ без электронной подписи';uk='Отправить документ без электронной подписи'");
			КомандаЭДО.Порядок       = 61;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.БизнесСетьОтправка;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОСервис";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаБизнесСеть;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СоставКоманд.Входящие.Найти(ПолноеИмя) <> Неопределено 
		И НаправлениеЭД <> Перечисления.НаправленияЭД.Исходящий Тогда
		
		Если ЗначениеФОИспользоватьОбменЭД Тогда
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ОткрытьАктуальныйЭД";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ОткрытьАктуальныйЭД";
			КомандаЭДО.Представление = НСтр("ru='Просмотреть электронный документ';uk='Просмотреть электронный документ'");
			КомандаЭДО.Порядок       = 10;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.ОткрытьВыбранныйФайл;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ДеревоЭД";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ДеревоЭД";
			КомандаЭДО.Представление = НСтр("ru='Открыть электронные документы';uk='Открыть электронные документы'");
			КомандаЭДО.Порядок       = 20;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.Подсистема;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;

			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ОткрытьТекущиеДелаЭДО";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ОткрытьТекущиеДелаЭДО";
			КомандаЭДО.Представление = НСтр("ru='Текущие дела ЭДО';uk='Текущие дела ЭДО'");
			КомандаЭДО.Порядок       = 25;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;

			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ПерезаполнитьДокумент";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ПерезаполнитьДокумент";
			КомандаЭДО.Представление = НСтр("ru='Перезаполнить по электронному документу';uk='Перезаполнить по электронному документу'");
			КомандаЭДО.Порядок       = 30;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.ДобавитьДопСвойствоВНабор;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОДополнительное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.СоздатьПроизвольныйЭДНаОсновании";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "СоздатьПроизвольныйДокумент";
			КомандаЭДО.Представление = НСтр("ru='Создать произвольный документ';uk='Создать произвольный документ'");
			КомандаЭДО.Порядок       = 50;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.Скрепка;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОДополнительное";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;
			
		КонецЕсли;
		
		// Команды из механизма однократных сделок не завязаны на ФО и роли БЭД.
		КомандаЭДО = КомандыЭДО.Добавить();
		КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ЗагрузитьДанныеИзФайла";
		КомандаЭДО.СписокФорм = "";
		КомандаЭДО.Идентификатор = "ЗагрузитьДанныеИзФайла";
		КомандаЭДО.Представление = НСтр("ru='Загрузить документ из файла';uk='Завантажити документ з файлу'");
		КомандаЭДО.Порядок       = 50;
		КомандаЭДО.Картинка      = БиблиотекаКартинок.ЗагрузитьXMLФайлВИнформационнуюБазу;
		КомандаЭДО.МестоРазмещения = "КомандыЭДОДополнительное";
		КомандаЭДО.ТолькоВоВсехДействиях = Истина;
		КомандаЭДО.Недоступна    = Ложь;
		
		Если ЗначениеФОИспользоватьОбменБизнесСеть И СоставКоманд.БезПодписи.Найти(ПолноеИмя) <> Неопределено Тогда
			
			КомандаЭДО = КомандыЭДО.Добавить();
			КомандаЭДО.Обработчик = "БизнесСетьКлиент.ЗагрузитьЧерезБизнесСеть";
			КомандаЭДО.СписокФорм = "";
			КомандаЭДО.Идентификатор = "ЗагрузитьЧерезБизнесСеть";
			КомандаЭДО.Представление = НСтр("ru='Загрузить документ без электронной подписи';uk='Загрузить документ без электронной подписи'");
			КомандаЭДО.Порядок       = 62;
			КомандаЭДО.Картинка      = БиблиотекаКартинок.БизнесСетьЗагрузка;
			КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
			КомандаЭДО.МестоРазмещения = "КомандыЭДОСервис";
			КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаБизнесСеть;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФОИспользоватьИнтеркампани И СоставКоманд.Интеркампани.Найти(ПолноеИмя) <> Неопределено Тогда
		
		КомандаЭДО = КомандыЭДО.Добавить();
		КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.ОткрытьАктуальныйЭД";
		КомандаЭДО.СписокФорм = "";
		КомандаЭДО.Идентификатор = "ОткрытьАктуальныйЭД";
		КомандаЭДО.Представление = НСтр("ru='Просмотреть электронный документ';uk='Просмотреть электронный документ'");
		КомандаЭДО.Порядок       = 10;
		КомандаЭДО.Картинка      = БиблиотекаКартинок.ОткрытьВыбранныйФайл;
		КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
		КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
		КомандаЭДО.Недоступна    = Не ЕстьПравоПросмотраЭД;
		
		КомандаЭДО = КомандыЭДО.Добавить();
		КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.СформироватьЭД";
		КомандаЭДО.СписокФорм = "";
		КомандаЭДО.Идентификатор = "СформироватьЭД";
		КомандаЭДО.Представление = НСтр("ru='Создать электронный документ';uk='Создать электронный документ'");
		КомандаЭДО.Порядок       = 11;
		КомандаЭДО.Картинка      = БиблиотекаКартинок.СоздатьЭлементСписка;
		КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
		КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
		КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;
		
		КомандаЭДО = КомандыЭДО.Добавить();
		КомандаЭДО.Обработчик = "ОбменСКонтрагентамиСлужебныйКлиент.СформироватьПодписатьОтправитьЭД";
		КомандаЭДО.СписокФорм = "";
		КомандаЭДО.Идентификатор = "СформироватьПодписатьОтправитьЭД";
		КомандаЭДО.Представление = НСтр("ru='Подписать электронный документ';uk='Подписать электронный документ'");
		КомандаЭДО.Порядок       = 12;
		КомандаЭДО.Картинка      = БиблиотекаКартинок.ЭлектронныйДокументИсходящий;
		КомандаЭДО.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
		КомандаЭДО.МестоРазмещения = "КомандыЭДОВажное";
		КомандаЭДО.Недоступна    = Не ЕстьПравоОбменаЭД;	
			
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру, используемых в БЭД команд.
//
// Возвращаемое значение:
//  Структура - пустая структура массивов.
//
Функция КомандыЭДО() Экспорт
	
	Команды = Новый Структура;
	Команды.Вставить("Исходящие", Новый Массив);
	Команды.Вставить("Входящие", Новый Массив);
	Команды.Вставить("БезПодписи", Новый Массив);
	Команды.Вставить("Интеркампани", Новый Массив);
	
	Возврат Команды;
	
КонецФункции

#КонецОбласти

#Область Интеграция1СЭДОИ1СОтчетности

// В процедуре заполняются данные по организации для мастера 1С-Отчетности.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация, по которой необходимо заполнить данные.
//  ДополнительныеПараметры - Структура - может иметь следующий набор свойств:
//    ЕстьПодключениеЭДО - Булево - признак подключения переданной организации к сервису 1С-ЭДО;
//    МассивОператоровЭДО - Массив - перечень актуальных операторов ЭДО в сервисе 1С-ЭДО;
//    СсылкаОписаниеСервиса - Строка - ссылка на актуальную информацию о сервисе 1С-ЭДО.
//
Процедура ЗаполнитьДанныеПо1СЭДОДляМастера1СОтчетности(Организация, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрофилиНастроекЭДО.Ссылка
	|ИЗ
	|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
	|ГДЕ
	|	ПрофилиНастроекЭДО.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО)
	|	И ПрофилиНастроекЭДО.Организация = &Организация
	|	И НЕ ПрофилиНастроекЭДО.ПометкаУдаления";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если Запрос.Выполнить().Пустой() Тогда
		ДополнительныеПараметры.Вставить("ЕстьПодключениеЭДО", Ложь);
		
		ИмяФайлаОтвета = ОбменСКонтрагентамиСлужебный.ПолучитьФайлОтветаОтСервераЭДО("GetOperators");
		Если ИмяФайлаОтвета <> Неопределено Тогда
			ДанныеФайла = ОбменСКонтрагентамиСлужебный.ПрочитатьТекстИзФайла(ИмяФайлаОтвета, , Истина);
			
			// ОператорыЭДОПодключенныеК1СЭДО
			МассивОператоровЭДО = Новый Массив;
			Если НЕ ПустаяСтрока(ДанныеФайла) Тогда
				
				ДеревоXML = ОбменСКонтрагентамиСлужебный.ЗагрузитьСтрокуXMLВДеревоЗначений(ДанныеФайла);
				Если ДеревоXML <> Неопределено Тогда
					
					УзелОператорыЭДО = ДеревоXML.Строки.Найти("Operators", "Имя");
					Если УзелОператорыЭДО <> Неопределено Тогда
						Для Каждого УзелОператорЭДО Из УзелОператорыЭДО.Строки Цикл
							
							УзелОператорЭДОНаимОрг = УзелОператорЭДО.Строки.Найти("НаимОрг", "Имя");
							Если СтрНайти(УзелОператорЭДОНаимОрг.Значение, "тест") = 0 Тогда
								МассивОператоровЭДО.Добавить(УзелОператорЭДОНаимОрг.Значение);
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивОператоровЭДО) Тогда
				ДополнительныеПараметры.Вставить("МассивОператоровЭДО", МассивОператоровЭДО);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("СсылкаОписаниеСервиса", "https://portal.1c.ru/applications/30/#conditions");
	
КонецПроцедуры

// Статус подключения организации.
//
// Параметры:
//  Организация - Справочник.Организации - ссылка на справочник Организация.
//
// Возвращаемое значение:
//   Булево - признак подключения организации.
//
Функция ОрганизацияПодключена(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрофилиНастроекЭДО.Ссылка
	|ИЗ
	|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
	|ГДЕ
	|	ПрофилиНастроекЭДО.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО)
	|	И ПрофилиНастроекЭДО.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ПроверкаСостоянияКонтрагентовВ1СЭДО

// Метод запускает проверку состояния контрагента в сервисе 1С-ЭДО.
//
// Параметры:
//  СсылкаНаКонтрагента - СправочникСсылка - ссылка на справочник контрагента,
//   которого необходимо проверить по подключению к 1С-ЭДО.
//
Процедура ПроверитьКонтрагентаВ1СЭДОПриСозданииНаСервере(СсылкаНаКонтрагента) Экспорт
	
	// Проверим необходимость запуска фонового задания
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияКонтрагентовБЭД.Состояние
	|ИЗ
	|	РегистрСведений.СостоянияКонтрагентовБЭД КАК СостоянияКонтрагентовБЭД
	|ГДЕ
	|	СостоянияКонтрагентовБЭД.Контрагент = &Контрагент
	|	И СостоянияКонтрагентовБЭД.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияКонтрагентаБЭД.НеПодключен)";
	
	Запрос.УстановитьПараметр("Контрагент", СсылкаНаКонтрагента);
	
	УстановитьПривилегированныйРежим(Истина);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	// Запуск фонового задания для проверки контрагента
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Контрагент",     СсылкаНаКонтрагента);
	ПараметрыЗапуска.Вставить("СохранятьРезультатСразуПослеПроверки", Истина);
	ПараметрыЗапуска.Вставить("АдресХранилища", Неопределено);
	
	ИмяРеквизитаИННКонтрагента = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	ИмяРеквизитаКППКонтрагента = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППКонтрагента");
	
	ПараметрыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаКонтрагента,
		ИмяРеквизитаИННКонтрагента + ", " + ИмяРеквизитаКППКонтрагента);
		
	ПараметрыЗапуска.Вставить("ИНН", ПараметрыКонтрагента[ИмяРеквизитаИННКонтрагента]);
	ПараметрыЗапуска.Вставить("КПП", ПараметрыКонтрагента[ИмяРеквизитаКППКонтрагента]);
	
	Попытка
	
		Параметры = Новый Массив;
		Параметры.Добавить(ПараметрыЗапуска);
		
		ФоновыеЗадания.Выполнить("ОбменСКонтрагентамиСлужебный.ПроверитьКонтрагентаФоновоеЗадание", 
			Параметры, ПараметрыЗапуска.ИНН + " " + ПараметрыЗапуска.КПП, НСтр("ru='Проверка подключения';uk='Перевірка підключення'"));
	
	Исключение
		
		// Исключение возникнет в случае запуска фонового задания с таким же ключем
		// Специальной обработки не требуется.
			
		Операция = НСтр("ru='Проверка подключения контрагента к 1С-ЭДО в фоновом задании.';uk='Проверка подключения контрагента к 1С-ЭДО в фоновом задании.'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаЭДВФНС

// Получает соответствие документам информационной базы и актуальных электронных документов.
// Функция предназначена для использования совместно с библиотекой "Регламентированная отчетность".
//
// Параметры:
//  ДокументыИБ - Массив - массив ссылок на документы информационной базы.
//  УникальныйИдентификатор - УникальныйИдентификатор - признак уникальности для формы выбора документов.
//
// Возвращаемое значение:
//  Соответствие - соответствие документов ИБ:
//    * Ключ     - ДокументСсылка - ссылка на документ-Владелец ЭД.
//    * Значение - Массив         - массив структур параметров ЭД, с ключами:
//                 ТипФайла - Строка - возможные значения: ФайлВыгрузки, ЭЦП, ФайлПодтверждения, ЭЦППодтверждения.
//                 КНД      - Строка - КНД выгружаемого ЭД, заполняется только для файла выгрузки и файла подтверждения.
//                 ИмяФайла - Строка - Имя выгружаемого файла.
//                 АдресВременногоХранилища - Строка.
//
Функция ПолучитьСоответствиеДокументамИБКомплектыЭлектронныхДокументов(ДокументыИБ, УникальныйИдентификатор) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭДПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл,
	|	СостоянияЭД.СсылкаНаОбъект КАК ДокументИБ,
	|	СостоянияЭД.ЭлектронныйДокумент.ВидЭД КАК ВидЭД,
	|	ЭДПрисоединенныеФайлы.УникальныйИД,
	|	ПодтвержденияЭД.Ссылка КАК ПодтверждениеСсылка,
	|	ПодтвержденияЭД.ТипЭлементаВерсииЭД КАК ВидЭДПодтверждения,
	|	ПодтвержденияЭД.УникальныйИД КАК УникальныйИДПодтверждения
	|ИЗ
	|	РегистрСведений.СостоянияЭД КАК СостоянияЭД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ПодтвержденияЭД
	|			ПО ЭДПрисоединенныеФайлы.Ссылка = ПодтвержденияЭД.ЭлектронныйДокументВладелец
	|				И (ПодтвержденияЭД.ТипЭлементаВерсииЭД В (&ТипыОтветныхТитулов))
	|		ПО СостоянияЭД.ЭлектронныйДокумент = ЭДПрисоединенныеФайлы.ВладелецФайла
	|			И (СостоянияЭД.ЭлектронныйДокумент.ВидЭД В (&ВидыПервичныхТитулов))
	|ГДЕ
	|	СостоянияЭД.СсылкаНаОбъект В (&ВладелецФайла)
	|	И СостоянияЭД.СостояниеВерсииЭД В(&ОбменЗавершен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументИБ,
	|	ПрисоединенныйФайл";
	Запрос.УстановитьПараметр("ВладелецФайла", ДокументыИБ);
	ОбменЗавершен = Новый Массив;
	ОбменЗавершен.Добавить(Перечисления.СостоянияВерсийЭД.ОбменЗавершен);
	ОбменЗавершен.Добавить(Перечисления.СостоянияВерсийЭД.ОбменЗавершенСИсправлением);
	Запрос.УстановитьПараметр("ОбменЗавершен", ОбменЗавершен);
	ВидыПервичныхТитулов = Новый Массив;
	ВидыПервичныхТитулов.Добавить(Перечисления.ВидыЭД.ТОРГ12Продавец);
	ВидыПервичныхТитулов.Добавить(Перечисления.ВидыЭД.АктИсполнитель);
	Запрос.УстановитьПараметр("ВидыПервичныхТитулов", ВидыПервичныхТитулов);
	ТипыОтветныхТитулов = Новый Массив;
	ТипыОтветныхТитулов.Добавить(Перечисления.ТипыЭлементовВерсииЭД.ТОРГ12Покупатель);
	ТипыОтветныхТитулов.Добавить(Перечисления.ТипыЭлементовВерсииЭД.АктЗаказчик);
	Запрос.УстановитьПараметр("ВидыОтветныхТитулов", ТипыОтветныхТитулов);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.СледующийПоЗначениюПоля("ДокументИБ") Цикл
		МассивФайловЭД = Новый Массив;
		Пока Результат.СледующийПоЗначениюПоля("ПрисоединенныйФайл") Цикл
			ЗаполнитьДанныеЭД(МассивФайловЭД, Результат.ПрисоединенныйФайл,
				Результат.ВидЭД, Результат.УникальныйИД, "ФайлВыгрузки", УникальныйИдентификатор);
			Если ЗначениеЗаполнено(Результат.ПодтверждениеСсылка) Тогда
				ЗаполнитьДанныеЭД(МассивФайловЭД, Результат.ПодтверждениеСсылка,
					Результат.ВидЭДПодтверждения, Результат.УникальныйИДПодтверждения, "ФайлПодтверждения", УникальныйИдентификатор);
			КонецЕсли;
		КонецЦикла;
		Соответствие.Вставить(Результат.ДокументИБ, МассивФайловЭД);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Формирует сведения об ЭД, которые будут отражаться в едином списке документов,
// представляемых по требованию ФНС. Электронные документы должны быть по завершенным обменам,
// не помечены на удаление и принадлежать следующим видам ЭД: ТОРГ12Продавец, АктИсполнитель.
//
// Параметры:
//  СвойстваЭД - Соответствие - содержит следующие поля:
//     * Ключ     - СправочникСсылка.ЭДПрисоединенныеФайлы.
//     * Значение - Структура - Поля структуры:
//        ** ЭД              - СправочникСсылка.ЭДПрисоединенныеФайлы
//        ** ВладелецЭД      - ДокументСсылка - ссылка на объект метаданных - владельца файла.
//        ** ВидДокументаФНС - Строка, вид электронного документа следует преобразовать
//                             к строковому представлению определенного формата. 
//                             Возможные значения: АктПриемкиСдачиРабот, ТоварнаяНакладнаяТОРГ12.
//  МассивЭД - Массив - массив ссылок на электронные документы.
//             Если массив заполнен, требуется заполнить свойства ЭД из массива.
//             Если массив пустой, тогда требуется заполнить свойства для всех ЭД,
//             удовлетворяющих свойствам, указанным выше.
//
Процедура ОпределитьСвойстваЭДДляЖурналаДокументовПредставляемыхПоТребованиюФНС(СвойстваЭД, МассивЭД) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СостоянияЭД.СсылкаНаОбъект КАК ВладелецЭД,
	|	ВЫБОР
	|		КОГДА СостоянияЭД.ЭлектронныйДокумент.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.АктИсполнитель)
	|			ТОГДА ""АктПриемкиСдачиРабот""
	|		КОГДА СостоянияЭД.ЭлектронныйДокумент.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ТОРГ12Продавец)
	|			ТОГДА ""ТоварнаяНакладнаяТОРГ12""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидДокументаФНС,
	|	ЭДПрисоединенныеФайлы.Ссылка КАК ЭД
	|ИЗ
	|	РегистрСведений.СостоянияЭД КАК СостоянияЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|		ПО СостоянияЭД.ЭлектронныйДокумент = ЭДПрисоединенныеФайлы.ВладелецФайла
	|			И (СостоянияЭД.ЭлектронныйДокумент В (&ТипыЭД))
	|ГДЕ
	|	СостоянияЭД.СостояниеВерсииЭД = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОбменЗавершен)
	|	И СостоянияЭД.ЭлектронныйДокумент.ВидЭД В(&ВидыЭД)
	|	И НЕ СостоянияЭД.ЭлектронныйДокумент.ПометкаУдаления
	|	И ЭДПрисоединенныеФайлы.ПодписанЭП";
	
	Если ЗначениеЗаполнено(МассивЭД) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СостоянияЭД.СсылкаНаОбъект В(&МассивЭД) ";
		Запрос.УстановитьПараметр("МассивЭД", МассивЭД);
	КонецЕсли;
	
	МассивВидовЭД = Новый Массив;
	МассивВидовЭД.Добавить(Перечисления.ВидыЭД.АктИсполнитель);
	МассивВидовЭД.Добавить(Перечисления.ВидыЭД.ТОРГ12Продавец);
	Запрос.УстановитьПараметр("ВидыЭД", МассивВидовЭД);
	
	МассивТиповЭД = Новый Массив;
	МассивТиповЭД.Добавить(Перечисления.ТипыЭлементовВерсииЭД.ПервичныйЭД);
	Запрос.УстановитьПараметр("ТипыЭД", МассивТиповЭД);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСвойств = Новый Структура;
		СтруктураСвойств.Вставить("ВидДокументаФНС", Выборка.ВидДокументаФНС);
		СтруктураСвойств.Вставить("ВладелецЭД", Выборка.ВладелецЭД);
		СтруктураСвойств.Вставить("ЭД", Выборка.ЭД);
		
		СвойстваЭД.Вставить(Выборка.ЭД, СтруктураСвойств);
	КонецЦикла;
	
КонецПроцедуры

// Определяет владельца электронного документа.
//
// Параметры:
//   ЭлектронныйДокумент - СправочникСсылка - ссылка на  электронный документ.
//   ВладелецЭД - ДокументСсылка - ссылка на владельца электронного документа.
//
Процедура ОпределитьВладельцаЭлектронногоДокумента(ЭлектронныйДокумент, ВладелецЭД) Экспорт
	
	ВладелецЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент, "ВладелецФайла");
	
КонецПроцедуры

// Заполнение вида документа ФНС для владельцев электронных документов,
// которые будут отражаться в едином списке документов, представляемых по требованию ФНС.
// Для владельца ЭД должны существовать электронные документы по завершенным обменам,
// не помеченные на удаление и принадлежащие следующим видам ЭД: ТОРГ12Продавец, ТОРГ12Покупатель, АктИсполнитель, АктЗаказчик.
//
// Параметры:
//  СвойстваВладельцевЭД - Соответствие - Соответствие документов владельцев ЭД и видов ЭД:
//    * Ключ     - ДокументСсылка - ссылка на владельца электронного документа.
//    * Значение - Строка - вид электронного документа, который следует преобразовать
//                 к строковому представлению определенного формата.
//                 Возможные значения: АктПриемкиСдачиРабот, ТоварнаяНакладнаяТОРГ12.
//  МассивВладельцевЭД - Массив - (необязательный) массив ссылок на владельцев электронные документы.
//                       Если параметр указан, требуется заполнить свойства владельцев ЭД из массива.
//                       Если параметр не указан или массив пустой, тогда требуется заполнить свойства
//                       для всех владельцев ЭД, по которым ЭДО завершен.
//
Процедура ОпределитьСвойстваВладельцевЭлектронныхДокументов(СвойстваВладельцевЭД, МассивВладельцевЭД = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СостоянияЭД.СсылкаНаОбъект КАК ВладелецЭД,
	|	ВЫБОР
	|		КОГДА СостоянияЭД.ЭлектронныйДокумент.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.АктИсполнитель)
	|			ТОГДА ""АктПриемкиСдачиРабот""
	|		КОГДА СостоянияЭД.ЭлектронныйДокумент.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ТОРГ12Продавец)
	|			ТОГДА ""ТоварнаяНакладнаяТОРГ12""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеЭД
	|ИЗ
	|	РегистрСведений.СостоянияЭД КАК СостоянияЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|		ПО СостоянияЭД.ЭлектронныйДокумент = ЭДПрисоединенныеФайлы.ВладелецФайла
	|			И (СостоянияЭД.ЭлектронныйДокумент В (&ТипыЭД))
	|ГДЕ
	|	СостоянияЭД.СостояниеВерсииЭД = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОбменЗавершен)
	|	И СостоянияЭД.ЭлектронныйДокумент.ВидЭД В(&ВидыЭД)
	|	И НЕ СостоянияЭД.ЭлектронныйДокумент.ПометкаУдаления
	|	И ЭДПрисоединенныеФайлы.ПодписанЭП";
		
	Если ЗначениеЗаполнено(МассивВладельцевЭД) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СостоянияЭД.СсылкаНаОбъект В(&МассивВладельцевЭД) ";
		Запрос.УстановитьПараметр("МассивВладельцевЭД", МассивВладельцевЭД);
	КонецЕсли;
	
	МассивВидовЭД = Новый Массив;
	МассивВидовЭД.Добавить(Перечисления.ВидыЭД.АктИсполнитель);
	МассивВидовЭД.Добавить(Перечисления.ВидыЭД.ТОРГ12Продавец);
	Запрос.УстановитьПараметр("ВидыЭД", МассивВидовЭД);
	
	МассивТиповЭД = Новый Массив;
	МассивТиповЭД.Добавить(Перечисления.ТипыЭлементовВерсииЭД.ПервичныйЭД);
	Запрос.УстановитьПараметр("ТипыЭД", МассивТиповЭД);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СвойстваВладельцевЭД.Вставить(Выборка.ВладелецЭД, Выборка.ПредставлениеЭД);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаИспользованияУниверсальныхДокументов

// Получает признак использования универсального передаточного документа между участниками ЭДО.
//
// Параметры:
//   Организация - Ссылка - элемент справочника Организации.
//   Контрагент - Ссылка - элемент справочника Контрагенты;
//   ДоговорКонтрагента - Ссылка - элемент справочника ДоговораКонтрагентов.
//
// Возвращаемое значение:
//   Результат - Булево - признак использования универсального передаточного документа.
//
Функция ИспользованиеУниверсальногоПередаточногоДокумента(Организация, Контрагент, ДоговорКонтрагента = Неопределено) Экспорт
	
	Результат = Ложь;
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкаЭДО.ИспользоватьУПД КАК ИспользоватьУПД,
		|	ВЫБОР
		|		КОГДА НастройкаЭДО.ДоговорКонтрагента = &ДоговорКонтрагента
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК НастройкаЭДО
		|ГДЕ
		|	НастройкаЭДО.Контрагент = &Контрагент
		|	И НастройкаЭДО.Организация = &Организация
		|	И НЕ НастройкаЭДО.ПометкаУдаления
		|	И НастройкаЭДО.СтатусПодключения = ЗНАЧЕНИЕ(Перечисление.СтатусыУчастниковОбменаЭД.Присоединен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
		Запрос.УстановитьПараметр("Контрагент",         Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Организация",        Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Результат = Выборка.ИспользоватьУПД;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает признак использования универсального корректировочного документа между участниками ЭДО.
//
// Параметры:
//   Организация - Ссылка - элемент справочника Организации.
//   Контрагент - Ссылка - элемент справочника Контрагенты;
//   ДоговорКонтрагента - Ссылка - элемент справочника ДоговораКонтрагентов.
//
// Возвращаемое значение:
//   Результат - Булево - признак использования универсального корректировочного документа.
//
Функция ИспользованиеУниверсальногоКорректировочногоДокумента(Организация, Контрагент, ДоговорКонтрагента = Неопределено) Экспорт
	
	Результат = Ложь;
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкаЭДО.ИспользоватьУКД КАК ИспользоватьУКД,
		|	ВЫБОР
		|		КОГДА НастройкаЭДО.ДоговорКонтрагента = &ДоговорКонтрагента
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК НастройкаЭДО
		|ГДЕ
		|	НастройкаЭДО.Контрагент = &Контрагент
		|	И НастройкаЭДО.Организация = &Организация
		|	И НЕ НастройкаЭДО.ПометкаУдаления
		|	И НастройкаЭДО.СтатусПодключения = ЗНАЧЕНИЕ(Перечисление.СтатусыУчастниковОбменаЭД.Присоединен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
		Запрос.УстановитьПараметр("Контрагент",         Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Организация",        Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Результат = Выборка.ИспользоватьУКД;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РазместитьНаФормеКомандыЭДО(ПараметрыПриСозданииНаСервере)
	
	Форма = ПараметрыПриСозданииНаСервере.Форма;
	МестоРазмещенияКомандПоУмолчанию = ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд;
	НаправлениеЭД = ПараметрыПриСозданииНаСервере.Направление;
	
	ЭлектронноеВзаимодействиеСлужебный.РазместитьНаФормеКомандыЭДО(Форма, МестоРазмещенияКомандПоУмолчанию, "ОбменСКонтрагентами", НаправлениеЭД);
	
КонецПроцедуры

Процедура ЗаполнитьСостояниеЭДО(ПараметрыПриСозданииНаСервере)
	
	Форма = ПараметрыПриСозданииНаСервере.Форма;
	ДокументСсылка = ПараметрыПриСозданииНаСервере.ДокументСсылка;
	ДекорацияСостояниеЭДО = ПараметрыПриСозданииНаСервере.ДекорацияСостояниеЭДО;
	ГруппаСостояниеЭДО = ПараметрыПриСозданииНаСервере.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиентСервер.ЗаполнитьСостояниеЭДО(Форма, ДокументСсылка, ДекорацияСостояниеЭДО, ГруппаСостояниеЭДО);
	
КонецПроцедуры


// Процедура используется для формирования дерева доп.данных.
// Данные из полученной структуры, рекурсивно добавляет в дерево доп.данных.
//
// Параметры:
//  СтрокаДереваДопДанных - Строка дерева значений - строка дерева, в которую добавляются данные.
//  СтруктураДанных - Структура - структура с добавляемыми в дерево данными. Элементами структуры могут быть: данные с
//    простым типом, массивы значений, вложенные структуры данных.
//  ДоступноСимволов - Число - количество символов, доступных для размещения данных внутри основного файла ЭД.
//  ЮридическиЗначимый - Булево - Истина - пометка данных, которые в последствии из дерева доп.данных надо будет
//    разместить в основном файле ЭД. Ложь - данные будут помещены в файл доп.данных.
//  ЭлементТЧ - Булево - данные принадлежат строке табличной части документа ИБ.
//  НомерСтроки - Строка - номер строки табличной части документа ИБ.
//
Процедура ДобавитьДанныеРекурсивно(СтрокаДереваДопДанных,
								   СтруктураДанных,
								   ДоступноСимволов,
								   ЮридическиЗначимый,
								   ЭлементТЧ,
								   НомерСтроки)
	
	Для Каждого Элемент Из СтруктураДанных Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
				СтОтбора = Новый Структура("ЗначениеРеквизита, ТЧ", Элемент.Ключ, ЭлементТЧ);
				СтрокиДерева = СтрокаДереваДопДанных.Строки.НайтиСтроки(СтОтбора, Истина);
				Если СтрокиДерева.Количество() = 0 Тогда
					СтрокаДерева = СтрокаДереваДопДанных.Строки.Добавить();
					СтрокаДерева.ИмяРеквизита = "Набор";
					
					СтрокаДерева.ЗначениеРеквизита = Элемент.Ключ;
					СтрокаДерева.ТЧ = ЭлементТЧ;
					
					
					
				Иначе
					СтрокаДерева = СтрокиДерева[0];
				КонецЕсли;
				ДобавитьДанныеРекурсивно(СтрокаДерева, Элемент.Значение, ДоступноСимволов, ЮридическиЗначимый, ЭлементТЧ,
					НомерСтроки);
			ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") И Элемент.Значение.Количество() > 0 Тогда
				СтОтбора = Новый Структура("ЗначениеРеквизита, ТЧ", Элемент.Ключ, Истина);
				СтрокиДерева = СтрокаДереваДопДанных.Строки.НайтиСтроки(СтОтбора, Истина);
				Если СтрокиДерева.Количество() = 0 Тогда
					СтрокаДерева = СтрокаДереваДопДанных.Строки.Добавить();
					СтрокаДерева.ИмяРеквизита = "Список";
					СтрокаДерева.ЗначениеРеквизита = Элемент.Ключ;
					СтрокаДерева.ТЧ = Истина;
					
					ВозможноРазмещение = ВозможноРазмещениеВОсновномФайле("Список", Элемент.Ключ, ДоступноСимволов);
					Если ЮридическиЗначимый И Не ВозможноРазмещение Тогда
						ЮридическиЗначимый = Ложь;
					КонецЕсли;
					СтрокаДерева.ЮридическиЗначимый = ЮридическиЗначимый;

					ВозможноРазмещение = ВозможноРазмещениеВОсновномФайле(Элемент.Ключ, "", ДоступноСимволов);
					Если ЮридическиЗначимый И Не ВозможноРазмещение Тогда
						ЮридическиЗначимый = Ложь;
					КонецЕсли;
					СтрокаДерева.ЮридическиЗначимый = ЮридическиЗначимый ;
					
				Иначе
					СтрокаДерева = СтрокиДерева[0];
				КонецЕсли;
				ТЗ = Элемент.Значение;
				ПоляСтруктурыТЗ = "";
				Для Каждого КолонкаТЗ Из ТЗ.Колонки Цикл
					ПоляСтруктурыТЗ = ПоляСтруктурыТЗ + ?(ЗначениеЗаполнено(ПоляСтруктурыТЗ), ", ", "") + КолонкаТЗ.Имя;
				КонецЦикла;
				ЮридическийДо = ЮридическиЗначимый;
				Для Каждого СтрокаТЗ Из ТЗ Цикл
					СтрокаДереваНпп = СтрокаДерева.Строки.Добавить();
					
					СтрокаДереваНпп.ИмяРеквизита = "Нпп";
					СтрокаДереваНпп.ТЧ = Истина;
					СтрокаДереваНпп.ЗначениеРеквизита = Строка(ТЗ.Индекс(СтрокаТЗ));
					
					ВозможноРазмещение = ВозможноРазмещениеВОсновномФайле("Нпп", "", ДоступноСимволов);
					Если ЮридическиЗначимый И Не ВозможноРазмещение Тогда
						ЮридическиЗначимый = Ложь;
					КонецЕсли;
					СтрокаДереваНпп.ЮридическиЗначимый = ЮридическиЗначимый;
					
					СтруктураДанныхТЗ = Новый Структура(ПоляСтруктурыТЗ);
					ЗаполнитьЗначенияСвойств(СтруктураДанныхТЗ, СтрокаТЗ);
					ДобавитьДанныеРекурсивно(СтрокаДереваНпп, СтруктураДанныхТЗ, ДоступноСимволов, ЮридическиЗначимый,
						ЭлементТЧ, ТЗ.Индекс(СтрокаТЗ));
					
				КонецЦикла;
				Если Не ЮридическийДо = ЮридическиЗначимый Тогда
					СтрокаДерева.ЮридическиЗначимый = ЮридическиЗначимый;
					ОбновитьСтрокиДерева(СтрокаДерева,ЮридическиЗначимый);
				КонецЕсли;
				
			Иначе
				НоваяСтрока = СтрокаДереваДопДанных.Строки.Добавить();
				ВозможноРазмещениеВОсновномФайле = ВозможноРазмещениеВОсновномФайле(Элемент.Ключ,
																					Элемент.Значение,
																					ДоступноСимволов);
				Если ЮридическиЗначимый И НЕ ВозможноРазмещениеВОсновномФайле Тогда
					ЮридическиЗначимый = Ложь;
				КонецЕсли;
				НоваяСтрока.ЮридическиЗначимый = ЮридическиЗначимый;
				Если ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
					НоваяСтрока.ИмяРеквизита = "Массив";
					НоваяСтрока.ЗначениеРеквизита = Элемент.Ключ;
					НоваяСтрока.ТЧ = ЭлементТЧ;
					Для Каждого Значение Из Элемент.Значение Цикл
						СтрокаЗн = НоваяСтрока.Строки.Добавить();
						СтрокаЗн.ИмяРеквизита = "Эл" + Элемент.Значение.Найти(Значение);
						СтрокаЗн.ТЧ = ЭлементТЧ;
						СтрокаЗн.ЮридическиЗначимый = НоваяСтрока.ЮридическиЗначимый;
						Если ТипЗнч(Значение) = Тип("Структура") Тогда
							СтрокаЗн.ЗначениеРеквизита = "Структура";
							ДобавитьДанныеРекурсивно(СтрокаЗн, Значение, ДоступноСимволов, ЮридическиЗначимый, ЭлементТЧ, НомерСтроки);
						Иначе
							
							СтрокаЗн.ЗначениеРеквизита = Значение;
						КонецЕсли
					КонецЦикла;
				Иначе
					НоваяСтрока.ИмяРеквизита = Элемент.Ключ;
					НоваяСтрока.ЗначениеРеквизита = Элемент.Значение;
					НоваяСтрока.ТЧ = ЭлементТЧ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// В функции выполняется проверка: длина строки, полученной после преобразования данных из структуры (с учетом служебных
// символов), не должна превышать количества доступных символов.
//
// Параметры:
//  СтруктураДанных - Структура - заполняемая структура.
//  Ключ - Строка - ключ добавляемого элемента.
//  Значение - Структура, примитивный тип или массив (элементы массива имеют примитивный тип) - значение добавляемого элемента.
//  ДоступноСимволов - Число - количество доступных символов результирующей строки.
//
// Возвращаемое значение:
//  Булево - Истина - элемент добавлен в структуру, Ложь - элемент не добавлен.
//
Функция ВозможноРазмещениеВОсновномФайле(Ключ, Значение, ДоступноСимволов)
	
	РазмещениеВозможно = Ложь;
	
	СлужебныеСимволы = 0;
	ДлинаСтрЗначения = 0;
	
	// Числа 41 и 31 обозначают количество служебных символов и рассчитываются следующим образом:
	// 1) если в ДеревоЗначений добавляется строка, которая будет иметь подчиненные строки, то данная строка в xml будет
	// выглядеть как элемент, имеющий вложенные (подчиненные) элементы, поэтому количество служебных символов = 41
	// (без учета длинны имени и значения самого реквизита), расчет по формуле:
	// СтрДлина("<Реквизит Имя="""" Значение=""""></Реквизит>") + 1;
	// 2) если в ДеревоЗначений добавляется строка без подчиненных строк, то количество служебных символов = 31
	// (без учета длинны имени и значения самого реквизита), расчет по формуле:
	// СтрДлина("<Реквизит Имя="""" Значение=""""/>") + 1;
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Для Каждого Элемент Из Значение Цикл
			СлужебныеСимволы = СлужебныеСимволы + СтрДлина("Эл" + Значение.Найти(Элемент)) + СтрДлина(Элемент) + 31;
		КонецЦикла;
		
		СлужебныеСимволы = СлужебныеСимволы + СтрДлина("Массив") + СтрДлина(Ключ) + 41;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		Для Каждого Элемент Из Значение Цикл
			РазмещениеВозможно = ВозможноРазмещениеВОсновномФайле(Элемент.Ключ, Элемент.Значение, ДоступноСимволов);
			Если НЕ РазмещениеВозможно Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		СлужебныеСимволы = СтрДлина("Набор") + СтрДлина(Ключ) + 41;
	Иначе // простой тип.
		СлужебныеСимволы = СтрДлина(Ключ) + СтрДлина(Значение) + 31;
	КонецЕсли;
	
	Если ДоступноСимволов >= СлужебныеСимволы Тогда
		ДоступноСимволов = ДоступноСимволов - СлужебныеСимволы;
		РазмещениеВозможно = Истина;
	КонецЕсли;
	
	Возврат РазмещениеВозможно;
	
КонецФункции

Процедура ЗаполнитьДанныеЭД(МассивФайловЭД, ЭД, ВидЭД, СтрокаУИД, ТипФайла, УникальныйИдентификатор)
	
	ДанныеФайла = ОбменСКонтрагентамиСлужебный.ПолучитьДанныеФайла(ЭД, УникальныйИдентификатор);
		
	СтруктураПараметровЭД = Новый Структура;
	СтруктураПараметровЭД.Вставить("ТипФайла", ТипФайла);
	СтруктураПараметровЭД.Вставить("ИмяФайла", ДанныеФайла.ИмяФайла);
	СтруктураПараметровЭД.Вставить("КНД", ОбменСКонтрагентамиПовтИсп.КНДПоВидуЭД(ВидЭД));
	СтруктураПараметровЭД.Вставить("АдресВременногоХранилища", ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	
	МассивФайловЭД.Добавить(СтруктураПараметровЭД);
	
	МассивСтруктурПодписей = ОбменСКонтрагентамиСлужебный.ПолучитьВсеПодписи(ЭД, УникальныйИдентификатор);
	
	Если ТипЗнч(МассивСтруктурПодписей) = Тип("Массив") И МассивСтруктурПодписей.Количество() > 0 Тогда
		Для Каждого СтруктураПодписи Из МассивСтруктурПодписей Цикл
			ИмяФайлаПодписи = СтруктураПодписи.ИмяФайлаПодписи;
			Если НЕ ЗначениеЗаполнено(ИмяФайлаПодписи) Тогда
				ИмяФайлаПодписи = ДанныеФайла.Наименование + ".p7s";
			КонецЕсли;
			
			СтруктураПараметровЭД = Новый Структура;
			СтруктураПараметровЭД.Вставить("ТипФайла", ?(ТипФайла = "ФайлВыгрузки", "ЭЦП", "ЭЦППодтверждения"));
			СтруктураПараметровЭД.Вставить("ИмяФайла", ИмяФайлаПодписи);
			СтруктураПараметровЭД.Вставить("КНД", "");
			СтруктураПараметровЭД.Вставить("АдресВременногоХранилища", СтруктураПодписи.АдресПодписи);
			
			МассивФайловЭД.Добавить(СтруктураПараметровЭД);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтрокиДерева(СтрокаДерева, ЮридическиЗначимый)
	
	Для Каждого ТекСтрока Из СтрокаДерева.Строки Цикл
		
		ТекСтрока.ЮридическиЗначимый = ЮридическиЗначимый;
		Если ТекСтрока.Строки.Количество()> 0 Тогда
			ОбновитьСтрокиДерева(ТекСтрока, ЮридическиЗначимый);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти