&НаКлиенте
Перем ВыполняетсяЗакрытие, QRКодВыведен, ФормаПодпись, ДатаПоОткрытияМодуля, ОбновлениеЗапущено;//, ПервыйЗапускФункцииАвтоОбновленияВФорме;

&НаКлиенте
Перем ИмяОбластиВозврата, ИмяЗаголовкаВозврата, вТекущийЭлемент, showOnlyUnread, ИмяФайлаНастроек, ФормаОбновления;

&НаКлиенте
Перем СпособПроводитьДокументыПроводитьВсе, СпособПроводитьДокументыПроводитьТолькоИзАвтоЗаполнения;

&НаКлиенте
Перем КолКартВПачке, corporation, branch, corpType, PanNumber;

&НаКлиенте
Перем UnitТестПодписиSmartIDОК, ЕстьFalse, ПереченьFalse, ВремяНачалаТеста, ВидимостьUnitТест;

&НаКлиенте
Процедура ТекстИнструкцияНажатие(Элемент)
	
	//НачатьЗапускПриложения(Новый ОписаниеОповещения("ВложениеВыборЗавершение", ЭтаФорма), "https://docs.google.com/document/d/19n3GIp8RuoNimgmHwoSE-u0paCR-nI89iU4p33WWIBc/edit");
	ПерейтиПоНавигационнойСсылке("https://docs.google.com/document/d/19n3GIp8RuoNimgmHwoSE-u0paCR-nI89iU4p33WWIBc/edit");
	
КонецПроцедуры

//не используется
&НаКлиенте
Процедура ВложениеВыборЗавершение(Параметр, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Процедура - обработчик команды День.
//
&НаКлиенте
Процедура ПериодДень(Команда)
	
	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодДень.Пометка = Истина;
	Элементы.ПериодНеделя.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Ложь;
	Элементы.ПериодГод.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодДень()

// Процедура - обработчик команды Неделя.
//
&НаКлиенте
Процедура ПериодНеделя(Команда)
	
	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодДень.Пометка = Ложь;
	Элементы.ПериодНеделя.Пометка = Истина;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Ложь;
	Элементы.ПериодГод.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодНеделя()

// Процедура - обработчик команды Месяц.
//
&НаКлиенте
Процедура ПериодМесяц(Команда)
	
	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодДень.Пометка = Ложь;
	Элементы.ПериодНеделя.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Истина;
	Элементы.ПериодКвартал.Пометка = Ложь;
	Элементы.ПериодГод.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодМесяц()

// Процедура - обработчик команды Квартал.
//
&НаКлиенте
Процедура ПериодКвартал(Команда)
	
	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодДень.Пометка = Ложь;
	Элементы.ПериодНеделя.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Истина;
	Элементы.ПериодГод.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодМесяц()

&НаКлиенте
Процедура ПериодГод(Команда)

	Элементы.ПериодВесь.Пометка = Ложь;
	Элементы.ПериодДень.Пометка = Ложь;
	Элементы.ПериодНеделя.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Ложь;
	Элементы.ПериодГод.Пометка = Истина;
	
	СформироватьПредставлениеПериода();

КонецПроцедуры

// Процедура - обработчик команды ПериодВесь.
//
&НаКлиенте
Процедура ПериодВесь(Команда)
	
	Элементы.ПериодВесь.Пометка = Истина;
	Элементы.ПериодДень.Пометка = Ложь;
	Элементы.ПериодНеделя.Пометка = Ложь;
	Элементы.ПериодМесяц.Пометка = Ложь;
	Элементы.ПериодКвартал.Пометка = Ложь;
	Элементы.ПериодГод.Пометка = Ложь;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // ПериодВесь()

// Процедура формирует период расписания работ.
//
&НаКлиенте
Процедура СформироватьПредставлениеПериода()
	
	Элементы.ГруппаПроизвПериод.Видимость = Ложь;
	Элементы.ГруппаПериод.Видимость = Истина;
	
	Для Каждого Элемент Из Элементы.ГруппаКнопокПериода.ПодчиненныеЭлементы Цикл
		Если Элемент.Пометка Тогда
			Элементы.ГруппаКнопокПериода.Заголовок = Лев(Элементы.ГруппаКнопокПериода.Заголовок, Найти(Элементы.ГруппаКнопокПериода.Заголовок, ":")) + " " + Элемент.Заголовок;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьПериоды();
	
	Если Элементы.ПериодНеделя.Пометка Тогда
		
		ОтборПериод.ДатаНачала = НачалоНедели(ДатаОтбора);
		ОтборПериод.ДатаОкончания = Мин(КонецНедели(ДатаОтбора), ТекущаяДата());
		
		Если Месяц(ОтборПериод.ДатаНачала) = Месяц(ОтборПериод.ДатаОкончания) Тогда
			
			ДеньОтбораНачало = Формат(ОтборПериод.ДатаНачала, "ДФ=дд");
			ДеньОтбораОкончание = Формат(ОтборПериод.ДатаОкончания, "ДФ=дд");
			МесяцОтбораОкончание = Формат(ОтборПериод.ДатаОкончания, "ДФ=МММ");
			ГодОтбора = Формат(Год(ОтборПериод.ДатаНачала), "ЧГ=0");
			ПредставлениеПериода = ДеньОтбораНачало + " - " + ДеньОтбораОкончание + " " + МесяцОтбораОкончание + ", " + ГодОтбора;
			
		Иначе
			
			ДеньОтбораНачало = Формат(ОтборПериод.ДатаНачала, "ДФ=дд");
			МесяцОтбораНачало = Формат(ОтборПериод.ДатаНачала, "ДФ=МММ");
			ДеньОтбораОкончание = Формат(ОтборПериод.ДатаОкончания, "ДФ=дд");
			МесяцОтбораОкончание = Формат(ОтборПериод.ДатаОкончания, "ДФ=МММ");
			
			Если Год(ОтборПериод.ДатаНачала) = Год(ОтборПериод.ДатаОкончания) Тогда
				ГодОтбора = Формат(Год(ОтборПериод.ДатаНачала), "ЧГ=0");
				ПредставлениеПериода = ДеньОтбораНачало + " " + МесяцОтбораНачало + " - " + ДеньОтбораОкончание + " " + МесяцОтбораОкончание + ", " + ГодОтбора;
			Иначе
				ГодОтбораНачало = Формат(Год(ОтборПериод.ДатаНачала), "ЧГ=0");
				ГодОтбораОкончание = Формат(Год(ОтборПериод.ДатаОкончания), "ЧГ=0");
				ПредставлениеПериода = ДеньОтбораНачало + " " + МесяцОтбораНачало + " " + ГодОтбораНачало + " - " + ДеньОтбораОкончание + " " + МесяцОтбораОкончание + " " + ГодОтбораОкончание;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Элементы.ПериодМесяц.Пометка Тогда
		
		ОтборПериод.ДатаНачала = НачалоМесяца(ДатаОтбора);
		ОтборПериод.ДатаОкончания = Мин(КонецМесяца(ДатаОтбора), ТекущаяДата());
		
		МесяцОтбора = Формат(ОтборПериод.ДатаНачала, "ДФ=МММ");
		ГодОтбора = Формат(Год(ОтборПериод.ДатаНачала), "ЧГ=0");
		ПредставлениеПериода = МесяцОтбора + " " + ГодОтбора;
		
	ИначеЕсли Элементы.ПериодКвартал.Пометка Тогда
		
		ОтборПериод.ДатаНачала = НачалоКвартала(ДатаОтбора);
		ОтборПериод.ДатаОкончания = Мин(КонецКвартала(ДатаОтбора), ТекущаяДата());
		
		ПредставлениеПериода = ПредставлениеПериода(НачалоДня(ОтборПериод.ДатаНачала), КонецКвартала(ОтборПериод.ДатаОкончания), "ФП = Истина");
		
	ИначеЕсли Элементы.ПериодДень.Пометка Тогда // ПериодДень
		
		ОтборПериод.ДатаНачала = НачалоДня(ДатаОтбора);
		ОтборПериод.ДатаОкончания = КонецДня(ДатаОтбора);
		
		ДеньОтбора = Формат(ОтборПериод.ДатаНачала, "ДФ=дд");
		МесяцОтбора = Формат(ОтборПериод.ДатаНачала, "ДФ=МММ");
		ГодОтбора = Формат(Год(ОтборПериод.ДатаНачала), "ЧГ=0");
		ДеньНеделиОтбора = ПолучитьПредставлениеДняНедели(ОтборПериод.ДатаНачала);
		
		ПредставлениеПериода = ДеньНеделиОтбора + " " + ДеньОтбора + " " + МесяцОтбора + " " + ГодОтбора;

	ИначеЕсли Элементы.ПериодГод.Пометка Тогда // ПериодГод

		ОтборПериод.ДатаНачала = НачалоГода(ДатаОтбора);
		ОтборПериод.ДатаОкончания = Мин(КонецГода(ДатаОтбора), ТекущаяДата());

		ПредставлениеПериода = ПредставлениеПериода(НачалоДня(ОтборПериод.ДатаНачала), КонецГода(ОтборПериод.ДатаОкончания), "ФП = Истина");

	Иначе
		
		Элементы.ГруппаПроизвПериод.Видимость = Истина;
		Элементы.ГруппаПериод.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьПредставлениеПериода()

// Процедура - обработчик команды УменьшитьПериод.
//
&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	Если Элементы.ПериодНеделя.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоНедели(НачалоНедели(ДатаОтбора) - 60 * 60 * 24));
		
	ИначеЕсли Элементы.ПериодМесяц.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоМесяца(НачалоМесяца(ДатаОтбора) - 60 * 60 * 24));
		
	ИначеЕсли Элементы.ПериодГод.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоГода(НачалоГода(ДатаОтбора) - 1));

	ИначеЕсли Элементы.ПериодКвартал.Пометка Тогда
		
		ДатаОтбора = КонецДня(НачалоКвартала(НачалоКвартала(ДатаОтбора) - 1));
		
	Иначе//день
		
		ДатаОтбора = КонецДня(ДатаОтбора - 60 * 60 * 24);

	//за весь период нет кнопок уменьшения/увеличения
	КонецЕсли;
	
	СформироватьПредставлениеПериода();
	
	
КонецПроцедуры // УменьшитьПериод()

// Процедура - обработчик команды УвеличитьПериод.
//
&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	Если Элементы.ПериодНеделя.Пометка Тогда
		
		ДатаОтбора = КонецДня(КонецНедели(ДатаОтбора) + 60 * 60 * 24);
		
	ИначеЕсли Элементы.ПериодМесяц.Пометка Тогда
		
		ДатаОтбора = КонецДня(КонецМесяца(ДатаОтбора) + 60 * 60 * 24);

	ИначеЕсли Элементы.ПериодГод.Пометка Тогда
		
		ДатаОтбора = КонецГода(КонецГода(ДатаОтбора) + 1);

	ИначеЕсли Элементы.ПериодКвартал.Пометка Тогда
	
		ДатаОтбора = КонецКвартала(КонецКвартала(ДатаОтбора) + 1);
	
	Иначе//день
		
		ДатаОтбора = КонецДня(ДатаОтбора + 60 * 60 * 24);

	//за весь период нет кнопок уменьшения/увеличения
	КонецЕсли;
	
	СформироватьПредставлениеПериода();
	
КонецПроцедуры // УвеличитьПериод()

// Функция возвращает представление дня недели.
//
&НаСервереБезКонтекста
Функция ПолучитьПредставлениеДняНедели(ДеньНеделиКалендаря) Экспорт
	
	НомерДняНедели = ДеньНедели(ДеньНеделиКалендаря);
	Если НомерДняНедели = 1 Тогда
		
		Возврат НСтр("ru = 'Пн';uk='Пн'");
		
	ИначеЕсли НомерДняНедели = 2 Тогда
		
		Возврат НСтр("ru = 'Вт';uk='Вт'");
		
	ИначеЕсли НомерДняНедели = 3 Тогда
		
		Возврат НСтр("ru = 'Ср';uk='Ср'");
		
	ИначеЕсли НомерДняНедели = 4 Тогда
		
		Возврат НСтр("ru = 'Чт';uk='Чт'");
		
	ИначеЕсли НомерДняНедели = 5 Тогда
		
		Возврат НСтр("ru = 'Пт';uk='Пт'");
		
	ИначеЕсли НомерДняНедели = 6 Тогда
		
		Возврат НСтр("ru = 'Сб';uk='Сб'");
		
	Иначе
		
		Возврат НСтр("ru = 'Вс';uk='Нд'");
		
	КонецЕсли;
	
КонецФункции // ПолучитьПредставлениеДняНедели()

// Процедура - обработчик команды Календарь.
//
&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Попытка
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметров = Новый Структура("ДатаКалендаря", ДатаОтбора);
		
		//Если Объект.ОбработкаВнешняя Тогда
		Попытка
			ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаКалендаря", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ПредставлениеПериодаНачалоВыбораЗавершение", ЭтаФорма));
		//Иначе
		Исключение
			ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ФормаКалендаря", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ПредставлениеПериодаНачалоВыбораЗавершение", ЭтаФорма));
		//КонецЕсли;
		КонецПопытки
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура - процедура обработчик оповещения выбора периода из календаря
//
// Параметры:
//  Результат				 - Дата - выбранный период 
//  ДополнительныеПараметры	 - Произвольный	- Дополнительные параметры оповещения
//
&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОтборПериод.ДатаНачала = Результат;
		ДатаОтбора = КонецДня(ОтборПериод.ДатаНачала);
		
		СформироватьПредставлениеПериода();
		
	КонецЕсли;
	
КонецПроцедуры // ПредставлениеПериодаНачалоВыбора()

// Процедура - изменяет видимость закладок на форме, группа "Раздел"
//
// Параметры:
//  Группа			 - ЭлементыФормы - ссылка на закладку формы видиомостью которой необходимо управлять	
//  ВидимостьШапки	 - Булево - признак видимости раздела с "Шапка" (раздел с датами)
//  ЗаголовокОбласти - Строка - текст для рамки группы		
//
&НаКлиенте
Процедура ПереключитьРаздел(Группа, ВидимостьШапки = Истина, ЗаголовокОбласти = "") Экспорт
	
	СнятьВыделениеРазделов(); //снимаем выделение текущего	
	Группа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение; //выделяем выбранный раздел
	Группа.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Группа.ПодчиненныеЭлементы[1].Шрифт,,,Истина);
	Элементы.ПанельДействий.ТекущаяСтраница = Элементы.ПанельДействий.ПодчиненныеЭлементы[СтрЗаменить(Группа.Имя,"Гр","Действ")]; //имена элементов отличаются префиксами

	// восстановление номера элемента меню
	стРезультатВозврата = ВосстановитьНомерЭлементаМеню(Группа.Имя);//ИндексРаздела = стРезультатВозврата.ИндексРаздела;
	ТекущийНомерМеню = стРезультатВозврата.ТекущийНомерМеню;

	Если Найти("BASR,AAA", Объект.ИдКонф) > 0 И Элементы.ПанельДействий.ТекущаяСтраница.Имя = "ДействОбменПлатежами"
			И Найти("0,1", ТекущийНомерМеню) > 0 Тогда
		ТекущийНомерМеню = 4
	КонецЕсли;

	//Если Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[0].Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
	Если Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[ТекущийНомерМеню].Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
		//ТекущийЭлемент = Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[0].ПодчиненныеЭлементы[0]; //Отмечаем первый элемент в группе действий	
		ТекущийЭлемент = Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[ТекущийНомерМеню].ПодчиненныеЭлементы[0]
	Иначе
		//ТекущийЭлемент = Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[0]; //Отмечаем первый элемент в группе действий
		ТекущийЭлемент = Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[ТекущийНомерМеню]
	КонецЕсли;

	ПереключитьРабочуюОбласть(ТекущийЭлемент, ВидимостьШапки, ЗаголовокОбласти); //переключаем закладку

	Если Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[0].Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
		ТекущийЭлемент = Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[0].ПодчиненныеЭлементы[0]; //Отмечаем первый элемент в группе действий	
	Иначе
		// восстановление номера элемента меню
		ТекущийЭлемент = Элементы.ПанельДействий.ТекущаяСтраница.ПодчиненныеЭлементы[ТекущийНомерМеню]
	КонецЕсли;

	Если Группа = Элементы.ГрДокументыОтчеты И ТекущийНомерМеню = 0 Тогда
		Если Найти("BASR,AAA", Объект.ИдКонф) > 0 Тогда
			УстановитьТекВидОперации("Заказы");
			НомерПунктаМеню = 1
		Иначе
			УстановитьТекВидОперации("НН")
		КонецЕсли
	КонецЕсли;

	ОбновитьОтображениеСтатуса(ОпределитьСостояниеАвторизовано()); //проверяем статус авторизации, обновляем картинку
	
	Элементы.ПоискПоДатеДокумента.Видимость = Ложь;

	ВидимостьФлагСчетИзЗаказа()

КонецПроцедуры

&НаКлиенте
Функция ОпределитьСостояниеАвторизовано()

	Если Не (Элементы.ПанельОбластей.ТекущаяСтраница.Имя = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблВыгрузкаPDF.Имя И
			СтрЗаменить(Элементы.ПанельРазделов.ПодчиненныеЭлементы.ГрДокументыОтчеты.Имя, "Гр", "Действ") = Элементы.ПанельДействий.ТекущаяСтраница.Имя)
			Тогда
		//все кроме паперлесс
		Попытка
			БулевоАвторизовано = ПроверитьНаличиеТокенаОрганизацииНаСервере()//ЗначениеЗаполнено(Элементы.ТокеныКомпаний.ТекущиеДанные.ТокенАвтоклиента)
		Исключение
			БулевоАвторизовано = Истина
		КонецПопытки
	Иначе
		//паперлесс
		БулевоАвторизовано = Объект.Авторизовано
	КонецЕсли;

	Возврат БулевоАвторизовано

КонецФункции

&НаСервере
Функция ВосстановитьНомерЭлементаМеню(ГруппаИмя)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	стРезультатВозврата = ОбработкаОбъект.ВосстановитьНомерЭлементаМеню(ГруппаИмя);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

	Возврат стРезультатВозврата

КонецФункции

&НаСервере
Процедура СохранитьНомерЭлементаМеню(ГруппаИмя, НомерПунктаМеню)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СохранитьНомерЭлементаМеню(ГруппаИмя, НомерПунктаМеню);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект")

КонецПроцедуры

// Процедура - изменяет видимость закладок на форме, группа "Область"
//
// Параметры:
//  Область			 - ЭлементыФормы - ссылка на закладку формы видиомостью которой необходимо управлять
//  ВидимостьШапки	 - Булево - признак видимости раздела с "Шапка" (раздел с датами)
//  ЗаголовокОбласти - Строка - текст для рамки группы
//
&НаКлиенте
Процедура ПереключитьРабочуюОбласть(Область, ВидимостьШапки = Истина, ЗаголовокОбласти = "", ФлагВозврат = Ложь)
	
	Если Область.Имя = "ТекстНастройкиЗП" Тогда//подготовка установки рабочей страницы
		ОбластьИмя = "ТекстПараметрыЗП"
	ИначеЕсли Найти("BASR,AAA", Объект.ИдКонф) > 0 И Область.Имя = "ТекстСписокНалоговыхДокументов" Тогда
		ОбластьИмя = "ОблФинДок";
		ЗаголовокОбласти = НСтр("ru='Заказы';uk='Замовлення'");
		ТекущийЭлемент = Элементы["ТекстЗаказы"];
		ВидимостьФлагСчетИзЗаказа()
	ИначеЕсли Область.Имя = "СписокЭкспортаPDF" Тогда
		ОбластьИмя = "ОблВыгрузкаPDF"
	Иначе
		ОбластьИмя = Область.Имя
	КонецЕсли;

	Если Найти("ТекстСписокНалоговыхДокументов,ОблФинДок,ТекстPDFДокументы", Область.Имя) > 0 Тогда
		ЗаполнитьСписокСтатусДокумента();
		ВидимостьСтатусДокумента = Истина
	Иначе
		ВидимостьСтатусДокумента = Ложь
	КонецЕсли;
	Элементы.СтатусДокумента.Видимость = ВидимостьСтатусДокумента;

	Если ФлагВозврат Тогда
		Если Область.Имя = "ОблОтправкаВедомости" Тогда
			ТекущийЭлемент = Элементы["ТекстОтправкаВедомости"]
		ИначеЕсли Область.Имя = "ОблРасчетныеЛистки" Тогда
			ТекущийЭлемент = Элементы["ТекстРасчетныеЛистки"]
		Иначе//Если вТекущийЭлемент = Элементы.ОблИмпорт Тогда
			ТекущийЭлемент = вТекущийЭлемент
		КонецЕсли
	КонецЕсли;

	Если ФлагВозврат Тогда//устанавливаем соотвествующую рабочую страницу
		Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы[ОбластьИмя]
	ИначеЕсли Область.Имя = "ТекстВернутьсяИзПодписи" Тогда
		Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблВыгрузкаPDF
	Иначе
		Попытка
			Если Найти("ТекстЗаказы,ТекстСчетаНаОплату,ТекстАкты,ТекстРасходные,ТекстПриказНаОтпуск", ОбластьИмя) > 0 Тогда
				ОбластьИмя = "ОблФинДок"
			КонецЕсли;
			Если ОбластьИмя = "ТекстПараметрыОбменаФинДок" Тогда
				Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы["ОблПараметрыОбмена"]
			Иначе
				Если ОбластьИмя = "ТекстПараметрыОбменаНастройки" Тогда
					ОбластьИмя = "ТекстПараметрыОбмена"
				КонецЕсли;
				Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы[СтрЗаменить(ОбластьИмя,"Текст","Обл")]
			КонецЕсли
		Исключение
			Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы["ОблОтправкаВедомости"]
		КонецПопытки
	КонецЕсли;
	Элементы.РабочаяОбласть.Заголовок = ?(ЗначениеЗаполнено(ЗаголовокОбласти), ЗаголовокОбласти, Область.Заголовок);
	Попытка
		мТекЭлФормы = Элементы[мИмяТекЭлемента]; //получаем тек. элемент формы
		мТекЭлФормы.Шрифт = Новый Шрифт(мТекЭлФормы.Шрифт,,,Ложь);//Делаем не жирным
		мИмяТекЭлемента = ТекущийЭлемент.Имя; //сохраняем тек. элемент в переменной
	Исключение КонецПопытки;
	ТекущийЭлемент.Шрифт = Новый Шрифт(ТекущийЭлемент.Шрифт,,,Истина);//Делаем жирным
	
	Элементы.ОбщаяГруппа.ПодчиненныеЭлементы.РабочаяОбласть.ПодчиненныеЭлементы.Шапка.Видимость = ВидимостьШапки; //видимость раздела с датами

	СписокОбластей = "ОблИмпорт,ОблЭкспорт,ОблВыпискаПоСчетам,ОблСписокНалоговыхДокументов,ОблФинДок,ОблPDFДокументы,ОблОтчеты,ОблПараметрыОбмена,ОблВыгрузкаPDF";
	Попытка
		ИмяОбластиВозвратаИмя = ИмяОбластиВозврата.Имя
	Исключение
		ИмяОбластиВозвратаИмя = Неопределено
	КонецПопытки;
	Элементы.ТекстВернутьсяИзПараметровОбмена.Видимость = ИмяОбластиВозврата <> "" И Найти(СписокОбластей, ИмяОбластиВозвратаИмя) > 0;
	Элементы.ТекстВернутьсяВЗП.Видимость = ИмяОбластиВозврата <> ""
		И (Найти(ИмяОбластиВозвратаИмя, "Ведомост") > 0 Или Найти(ИмяОбластиВозвратаИмя, "Лист") > 0);

	УстановитьВидимостьДоступность();
	УстановитьВидимостьСтатусаАвторизацииМодуля(ПроверитьНаличиеТокенаОрганизацииНаСервере());

	// сохранение номера элемента меню
	стРезультатВозврата = ВосстановитьНомерЭлементаМеню(Область.Имя);
	ИндексРаздела = стРезультатВозврата.ИндексРаздела;//ТекущийНомерМеню
	СохранитьНомерЭлементаМеню(Элементы.ПанельДействий.ТекущаяСтраница.Имя, ИндексРаздела)

КонецПроцедуры	

&НаКлиенте
Процедура ВидимостьФлагСчетИзЗаказа()

	Если Элементы.РабочаяОбласть.Заголовок = НСтр("ru='Счета на оплату';uk='Рахунки на оплату'")
			И Элементы.ГруппаСписокФинДок.ТекущаяСтраница.Имя = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокИсходящие.Имя
			И ЗначениеЗаполнено(ИмяФТипаФинДокаПоРазделуНаСервере("Заказы", Ложь)) Тогда
		ВидимостьСчетИзЗаказа = Истина
	Иначе
		ВидимостьСчетИзЗаказа = Ложь
	КонецЕсли;
	Элементы.ФлагСчетИзЗаказа.Видимость = ВидимостьСчетИзЗаказа;

КонецПроцедуры

&НаКлиенте
Процедура ТекстВернутьсяИзПараметровОбменаНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элементы[ИмяОбластиВозврата.Имя],, ИмяЗаголовкаВозврата, Истина);
	ИмяОбластиВозврата = "";
	ИмяЗаголовкаВозврата = "";
	ВидимостьКолонкаНазначениеПлатежа()

КонецПроцедуры

// Процедура - скрывает рамку выделения групп
//
&НаКлиенте
Процедура СнятьВыделениеРазделов()
	
	Элементы.ГрОбменПлатежами.Отображение = ОтображениеОбычнойГруппы.Нет;
	Элементы.ГрЗарплатныйПроект.Отображение = ОтображениеОбычнойГруппы.Нет;
	Элементы.ГрДокументыОтчеты.Отображение = ОтображениеОбычнойГруппы.Нет;
	Элементы.ГрКурсыВалют.Отображение = ОтображениеОбычнойГруппы.Нет;
	Элементы.ГрНастройки.Отображение = ОтображениеОбычнойГруппы.Нет;
	Элементы.ГрДопВозможности.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Элементы.ГрОбменПлатежами.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Элементы.ГрОбменПлатежами.ПодчиненныеЭлементы[1].Шрифт,,,Ложь);
	Элементы.ГрЗарплатныйПроект.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Элементы.ГрЗарплатныйПроект.ПодчиненныеЭлементы[1].Шрифт,,,Ложь);
	Элементы.ГрДокументыОтчеты.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Элементы.ГрДокументыОтчеты.ПодчиненныеЭлементы[1].Шрифт,,,Ложь);
	Элементы.ГрКурсыВалют.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Элементы.ГрКурсыВалют.ПодчиненныеЭлементы[1].Шрифт,,,Ложь);
	Элементы.ГрНастройки.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Элементы.ГрНастройки.ПодчиненныеЭлементы[1].Шрифт,,,Ложь);
	Элементы.ГрДопВозможности.ПодчиненныеЭлементы[1].Шрифт = Новый Шрифт(Элементы.ГрДопВозможности.ПодчиненныеЭлементы[1].Шрифт,,,Ложь);

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура КартинкаОбменПлатежамиНажатие(Элемент)
	
	ПереключитьРаздел(Элементы.ГрОбменПлатежами);
	
	ПроверкаЗаполненияБанка();
	
	Если Объект.АвтоИмпортЗаДень И ОтборПериод.ДатаНачала = НачалоДня(ОтборПериод.ДатаОкончания) И Объект.ИмпортПлатежныеДокументы.Количество() = 0 Тогда
		ИмпортПлатежейНаСервере();
	КонецЕсли;	

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстОбменПлатежамиНажатие(Элемент)
	
	ПереключитьРаздел(Элементы.ГрОбменПлатежами);
	
	ПроверкаЗаполненияБанка();

	Если Объект.АвтоИмпортЗаДень И ОтборПериод.ДатаНачала = НачалоДня(ОтборПериод.ДатаОкончания) И Объект.ИмпортПлатежныеДокументы.Количество() = 0 Тогда
		ИмпортПлатежейНаСервере();
	КонецЕсли;

КонецПроцедуры

// Процедура - выполняет проверку заполнения карточки банка
//
&НаКлиенте
Процедура ПроверкаЗаполненияБанка()

	Возврат;
	Если НЕ ЗначениеЗаполнено(Объект.Банк) Тогда
		ТекущийЭлемент = Элементы.ТекстПараметрыОбмена;
		ПереключитьРабочуюОбласть(Элементы.ТекстПараметрыОбмена);
		СообщениеПользователю(НСтр("ru = 'Для работы с данным разделом требуется заполнение банка ""ПриватБанк"", в котором у Вас открыты счета.';uk='Для роботи з даним розділом потрібно заповнення банку ""ПриватБанк"", в якому у Вас відкрито рахунки.'"), Ложь)
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура КартинкаЗарплатныйПроектНажатие(Элемент)
	
	ПереключитьРаздел(Элементы.ГрЗарплатныйПроект);
	
	Если НЕ ЗначениеЗаполнено(Объект.ТекущийЗП) Тогда
		ПолучениеЗарплатногоПроекта(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстЗарплатныйПроектНажатие(Элемент)
	
	ПереключитьРаздел(Элементы.ГрЗарплатныйПроект);
	
	Если НЕ ЗначениеЗаполнено(Объект.ТекущийЗП) Тогда
		ПолучениеЗарплатногоПроекта(Неопределено);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура КартинкаДокументыНажатие(Элемент)

	ПереключитьРаздел(Элементы.ГрДокументыОтчеты);
	УстановитьТекВидОперации("НН");

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстДокументыНажатие(Элемент)

	//Делаем обычным ссылку на случай предыдущего прямого перехода с платежей на счета
	Элементы.ТекстСчетаНаОплату.Шрифт = Новый Шрифт(Элементы.ТекстСчетаНаОплату.Шрифт,,, Ложь);

	ПереключитьРаздел(Элементы.ГрДокументыОтчеты);

	ВидимостьТЧФинДокИсходящиеИмяДокумента()

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура КартинкаНастройкиНажатие(Элемент)

	ПереключитьРаздел(Элементы.ГрНастройки, Ложь);

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстНастройкиНажатие(Элемент)

	ПереключитьРаздел(Элементы.ГрНастройки, Ложь);

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура КартинкаКурсыВалютНажатие(Элемент)

	ПереключитьРаздел(Элементы.ГрКурсыВалют, Истина);

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстКурсыВалютНажатие(Элемент)

	Если Объект.ИдКонф = "BASR" Тогда
		СообщениеПользователю(НСтр("ru = 'Ваша конфигурация не поддерживает валютный учет.';uk='Ваша конфігурація не підтримує валютний облік.'"), Ложь);
		Возврат
	КонецЕсли;

	ПереключитьРаздел(Элементы.ГрКурсыВалют, Истина);

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстИмпортНажатие(Элемент)

	Если Найти("BASR,AAA", Объект.ИдКонф) > 0 Тогда
		СообщениеПользователю(НСтр("ru = 'Ваша конфигурация не поддерживает импорт платежей.';uk='Ваша конфігурація не підтримує імпорт платежів.'"), Ложь);
		Возврат
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);

КонецПроцедуры

// Процедура - обработчик клика пользоватея
//
// Параметры:
//  Элемент - ЭлементыФормы - элемент формы на который нажал пользователь
//
&НаКлиенте
Процедура ТекстЭкспортНажатие(Элемент)

	Если Объект.ИдКонф = "BASR" Тогда
		СообщениеПользователю(НСтр("ru = 'Ваша конфигурация не поддерживает экспорт платежей.';uk='Ваша конфігурація не підтримує експорт платежів.'"), Ложь);
		Возврат
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент)

КонецПроцедуры

// Процедура - устанавливает отметки для всех строк табличной части
//
// Параметры:
//  Команда - КомандаФормы - имя команды
//
&НаКлиенте
Процедура ОтметитьВсеПлатежки(Команда)
	
	Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблЭкспорт" Тогда
		мТЧ = Объект.ЭкспортПлатежныеДокументы;	
	Иначе
		мТЧ = Объект.ИмпортПлатежныеДокументы;	
	КонецЕсли;	
		
	Для Каждого СтрокаТЧ Из мТЧ Цикл
		СтрокаТЧ.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - снимает отметки для всех строк табличной части
//
// Параметры:
//  Команда - КомандаФормы - имя команды
//
&НаКлиенте
Процедура СнятьОтметкиПлатежек(Команда)
	
	Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблЭкспорт" Тогда
		мТЧ = Объект.ЭкспортПлатежныеДокументы;	
	Иначе
		мТЧ = Объект.ИмпортПлатежныеДокументы;	
	КонецЕсли;	
		
	Для Каждого СтрокаТЧ Из мТЧ Цикл
		СтрокаТЧ.Флажок = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияБлокаСохраненияВосстановленияПоложенийМеню2Уровня()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИнициализацияБлокаСохраненияВосстановленияПоложенийМеню2Уровня();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект")

КонецПроцедуры

&НаСервере
Процедура ПрочитатьГорячиеСообщенияНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПрочитатьГорячиеСообщения();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект")

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Объект.AppData = "";
	Объект.ЕстьОшибки = Ложь;

	ИмяФайлаНастроек = "MOP24bconfigManaged.cfg";

	КолКартВПачке = 100;//это максимум(по умолчанию)

	Объект.ЭтоLinuxКлиент = ЭтоLinuxКлиент();
	Объект.ЭтоВебКлиент = ЭтоВебКлиент();
	Объект.ЭтоWindows = ЗапущеноПодWindows();
	ПолучитьЭто1cnik();
	
	//Юра 25 11 2025
	Объект.АвтоматическийОбмен 	= Истина;
	Объект.АвтоИмпортЗаДень 	= Истина;
	Объект.ПериодОбмена 		= 5;
	Объект.АвтоИмпорт           = Истина;
	Объект.ФлажокМультиАккаунтныйИмпорт = Истина;
	//Юра 25 11 2025
	
	// ЭДО	сзНазначенияПлатежейСчетов
	Если Объект.сзНазначенияПлатежейСчетов.Количество() = 0 Тогда
		ЭлементСЗТекст = НСтр("ru = 'Не заполнять назначения';uk = 'Не заповнювати призначення'");
		Объект.сзНазначенияПлатежейСчетов.Добавить(ЭлементСЗТекст, ЭлементСЗТекст);
		ЭлементСЗТекст = НСтр("ru = 'Заполнять из комментария';uk = 'Заповнювати з коментару'");
		Объект.сзНазначенияПлатежейСчетов.Добавить(ЭлементСЗТекст, ЭлементСЗТекст);
		ЭлементСЗТекст = НСтр("ru = 'Заполнять из шаблона';uk = 'Заповнювати з шаблону'");
		Объект.сзНазначенияПлатежейСчетов.Добавить(ЭлементСЗТекст, ЭлементСЗТекст)
	КонецЕсли;
	Если Элементы.ПолеВыбораНазначениеПлатежаСчетов.СписокВыбора.Количество() = 0 Тогда
		Для каждого ЭлементСЗ Из Объект.сзНазначенияПлатежейСчетов Цикл
			Элементы.ПолеВыбораНазначениеПлатежаСчетов.СписокВыбора.Добавить(ЭлементСЗ.Значение, ЭлементСЗ.Представление)
		КонецЦикла
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.НазначениеПлатежаСчетов) Тогда
		Объект.НазначениеПлатежаСчетов = Элементы.ПолеВыбораНазначениеПлатежаСчетов.СписокВыбора[0].Значение
	КонецЕсли;

	// ИмпортПлатежей СпособПроводитьДокументы
	Если Элементы.СпособПроводитьДокументы.СписокВыбора.Количество() = 0 Тогда
		СпособПроводитьДокументыНеПроводить = НСтр("ru='Не проводить';uk='Не проводити'");
		Элементы.СпособПроводитьДокументы.СписокВыбора.Добавить(СпособПроводитьДокументыНеПроводить, СпособПроводитьДокументыНеПроводить);
		СпособПроводитьДокументыПроводитьВсе = НСтр("ru='Проводить все';uk='Проводити всі'");
		Элементы.СпособПроводитьДокументы.СписокВыбора.Добавить(СпособПроводитьДокументыПроводитьВсе, СпособПроводитьДокументыПроводитьВсе);
		СпособПроводитьДокументыПроводитьТолькоИзАвтоЗаполнения = НСтр("ru='Проводить только виды документов, указанные в автозаполнении';uk='Проводити тільки види документів, вказані в автозаповненні'");
		Элементы.СпособПроводитьДокументы.СписокВыбора.Добавить(СпособПроводитьДокументыПроводитьТолькоИзАвтоЗаполнения, СпособПроводитьДокументыПроводитьТолькоИзАвтоЗаполнения);
		Объект.СпособПроводитьДокументы = СпособПроводитьДокументыНеПроводить
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СпособПроводитьДокументы) Тогда
		Объект.СпособПроводитьДокументы = Элементы.СпособПроводитьДокументы.СписокВыбора[0].Значение;
		Объект.ПроводитьПлатежи = 1
	КонецЕсли;

	// КорпКарты ПолеВыбораТипКарты
	Если Элементы.ПолеВыбораТипКарты.СписокВыбора.Количество() = 0 Тогда
		ПолеВыбораТипКартыВсеКарты = "Все карты";
		Элементы.ПолеВыбораТипКарты.СписокВыбора.Добавить(ПолеВыбораТипКартыВсеКарты, ПолеВыбораТипКартыВсеКарты);
		ПолеВыбораТипКартыКорпоративные = "Корпоративные";
		Элементы.ПолеВыбораТипКарты.СписокВыбора.Добавить(ПолеВыбораТипКартыКорпоративные, ПолеВыбораТипКартыКорпоративные);
		ПолеВыбораТипКартыКлючКСчету = "Ключ к счету";
		Элементы.ПолеВыбораТипКарты.СписокВыбора.Добавить(ПолеВыбораТипКартыКлючКСчету, ПолеВыбораТипКартыКлючКСчету);
		ПолеВыбораТипКартыТопливные = "Топливные";
		Элементы.ПолеВыбораТипКарты.СписокВыбора.Добавить(ПолеВыбораТипКартыТопливные, ПолеВыбораТипКартыТопливные);
		ПолеВыбораТипКарты = ПолеВыбораТипКартыВсеКарты
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПолеВыбораТипКарты) Тогда
		ПолеВыбораТипКарты = Элементы.ПолеВыбораТипКарты.СписокВыбора[0].Значение
	КонецЕсли;

	// ИмпортПлатежей ТипПлатежаИмпорт
	Если Элементы.ТипПлатежаИмпорт.СписокВыбора.Количество() = 0 Тогда
		ТипПлатежаВсе = НСтр("ru='Все платежи';uk='Всі платежі'");
		Элементы.ТипПлатежаИмпорт.СписокВыбора.Добавить(ТипПлатежаВсе, ТипПлатежаВсе);
		ТипПлатежаТолькоВходящие = НСтр("ru='Только входящие платежи';uk='Тільки вхідні платежі'");
		Элементы.ТипПлатежаИмпорт.СписокВыбора.Добавить(ТипПлатежаТолькоВходящие, ТипПлатежаТолькоВходящие);
		ТипПлатежаТолькоИсходящие = НСтр("ru='Только исходящие платежи';uk='Тільки вихідні платежі'");
		Элементы.ТипПлатежаИмпорт.СписокВыбора.Добавить(ТипПлатежаТолькоИсходящие, ТипПлатежаТолькоИсходящие);
		ТипПлатежаТолькоЭквайринговые = НСтр("ru='Только эквайринговые платежи';uk='Тільки еквайрінгові платежі'");
		Элементы.ТипПлатежаИмпорт.СписокВыбора.Добавить(ТипПлатежаТолькоЭквайринговые, ТипПлатежаТолькоЭквайринговые)
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ТипПлатежаИмпорт) Тогда
		Объект.ТипПлатежаИмпорт = Элементы.ТипПлатежаИмпорт.СписокВыбора[0].Значение
	КонецЕсли;

	Попытка
		Если Не ЗначениеЗаполнено(Объект.AppData) Тогда
			Объект.AppData = ПеременнаяОкруженияСервер("%APPDATA%");
		КонецЕсли;
		Объект.Путьmop24versions = Объект.appdata + "\mop24\versions\";
		Если Не ЗначениеЗаполнено(Объект.ПутьКурл) Тогда
			РесурсПутиcurl = "\BAF_curl";
			Объект.ПутьКурл = Объект.AppData + РесурсПутиcurl//"\1c_curl"
		КонецЕсли;

		Элементы.ТокеныКомпаний.ПодчиненныеЭлементы.ТокеныКомпанийПолеОрганизация.Видимость = Не Объект.ЭтоВебКлиент;//до исправления бага BAF в веб
		Элементы.ТокеныКомпаний.ПодчиненныеЭлементы.ТокеныКомпанийПолеНаименование.Видимость = Объект.ЭтоВебКлиент;//до исправления бага BAF в веб
		Элементы.ТокеныКомпанийОбновить.Видимость = Не Объект.ЭтоВебКлиент;
		ПроверкаТабличноеПолеБыстраяАвторизация(Истина);

		// инициализация блока для сохранения и восстановления положений меню 2-го уровня
		ИнициализацияБлокаСохраненияВосстановленияПоложенийМеню2Уровня();

		Если Найти("BP,BASC,UABY,", Объект.ИдКонф) > 0 Тогда
			Элементы.ТекстЗаказы.ЦветТекста = WebЦвета.Серебряный;	
		КонецЕсли;	

		Если Объект.ИдКонф = "BASR" Тогда
			Элементы.ТекстИмпорт.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстЭкспорт.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстСписокНалоговыхДокументов.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстАкты.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстСчетаНаОплату.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстОтчеты.ЦветТекста = WebЦвета.Серебряный
		КонецЕсли;

		Если Объект.ИдКонф = "AAA" Тогда
			Элементы.ТекстСписокНалоговыхДокументов.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстАкты.ЦветТекста = WebЦвета.Серебряный;
			Элементы.ТекстОтчеты.ЦветТекста = WebЦвета.Серебряный
		КонецЕсли;

		// Видимость реквизита СуммаЕдиногоНалогаРавнаСуммеПлатежа
		Если Найти("ERP,UT_3", Объект.ИдКонф) > 0 Тогда
			// BASERP, ERPforUkraine, BASКомплексноеУправлениеПредприятием, BASIEM, BASIEM_ЗаполнитьДанныеРЛ, УправлениеТорговлейДляУкраины 3
			ВидимостьСуммаЕдиногоНалогаРавнаСуммеПлатежа = Истина
		Иначе
			ВидимостьСуммаЕдиногоНалогаРавнаСуммеПлатежа = Ложь
		КонецЕсли;
		Элементы.СуммаЕдиногоНалогаРавнаСуммеПлатежа.Видимость = ВидимостьСуммаЕдиногоНалогаРавнаСуммеПлатежа;

		УстановкаПараметровПроксиНаСервере();

		ТекстСообщения = НСтр("ru='Получение горячего сообщения';uk='Отримання гарячого повідомлення'");
		Состояние(ТекстСообщения);

		Объект.ВыводилосьГС = Ложь;
		ПрочитатьГорячиеСообщенияНаСервере();

		Элементы.КнопкаВосстановитьЗначенияИзФайла.Видимость = Не Объект.ЭтоВебКлиент;
		Элементы.КнопкаСохранитьЗначенияВФайл.Видимость = Не Объект.ЭтоВебКлиент;

		Если Объект.ГруппаКартинокРазделовСвернута Тогда
			СвернутьРазвернутьГруппы(Истина);		
		КонецЕсли;
		
		ЗаполнитьСпискиВыбора();
		
		ДатаОтбора = ТекущаяДата(); //считаем что всегда начинаем работу с текущей даты
		ОтборПериод.ДатаНачала = ДатаОтбора;
		ОтборПериод.ДатаОкончания = КонецДня(ДатаОтбора);
		СформироватьПредставлениеПериода();

		Объект.typeЧП = "";

		мИмяТекЭлемента = Элементы.ТекстИмпорт.Имя;//для работы механихзма выделения жирным выбранного раздела
		
		Если Объект.ИдКонф = "BASR" Тогда
			ПереключитьРаздел(Элементы.ГрДокументыОтчеты, Истина)
		Иначе
			ПереключитьРаздел(Элементы.ГрОбменПлатежами, Истина)
		КонецЕсли;
		
		УстановитьВидимостьДоступность();
		УстановитьВидимостьФлажокИспользоватьКурлВсегда();//Ложь);
		
		//Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		//	Элементы.ГруппаКнопокПериода.Вид = ВидГруппыФормы.Подменю;	
		//	Элементы.ДекорацияПоказатьЗа.Видимость = Ложь;
		//	Элементы.Шапка.ШиринаПодчиненныхЭлементов = ШиринаПодчиненныхЭлементовФормы.ЛевыйУзкий;
		//КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ТипКурса) Тогда
			Объект.ТипКурса = "BS"
		КонецЕсли;
		Если Кратность < 1 Или Кратность > 4 Тогда
			Кратность = 1
		КонецЕсли;

		ОбновитьСписокВидовДокументов_PDF(Неопределено);
		
		Если Не РаботаСКонфигурациейПоддерживается() Тогда
			ТекстОшибки = НСтр("ru='Работа с конфигурацией не поддерживается текущей версией обработки ';uk='Робота з конфігурацією не підтримується поточною версією обробки '") + Объект.ИдКонф; 
			СообщениеПользователю(ТекстОшибки, Ложь);
			ВызватьИсключение Объект.ИдКонф;	
		КонецЕсли;
		
		ВидимостьКнопокПодписиФинДок();
		
		ПодключитьОбработчикОжидания("ОтправитьСтатистикуОткрытия", 1 , Истина);
		
		ПодключитьОбработчикОжидания("ОтправитьСтатистикуРаботы", 120);
		
	Исключение
		ТекстОписаниеОшибки = "Ошибка открытия, этап 1: " + ОписаниеОшибки();
		ОтправитьСтатистку("Открытие", "ОткрытиеОшибка", ТекстОписаниеОшибки, Истина);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Ошибка при открытии: ';uk='Помилка при відкритті: '") + ТекстОписаниеОшибки;
		СообщениеПользователю(Сообщение.Текст);
	КонецПопытки;
	
	//Если НЕ Объект.РаботаВМоделиСервисаПБ Тогда
	//	ПрочитатьНовостиBO();
	//	//СисИнфо = Новый СистемнаяИнформация;
	//	//ВерсияОС = СисИнфо.ВерсияОС;
	//	//Если Найти(ВерсияОС, "Microsoft Windows XP") = 0 Тогда
	//	////	Виджет = "https://bo.pb.ua/newslist/news/?lang=UK&v=" + Объект.ТекВерсия;
	//	//Виджет = "https://privatbank.ua/business/vse-servisy-ucheta-i-otchetnosti";
	//	//Иначе	
	//		////ЗапуститьПриложение("https://bo.pb.ua/newslist/news/?lang=UK&v=" + Объект.ТекВерсия);
	//		////ЗапуститьПриложение("https://privatbank.ua/business/vse-servisy-ucheta-i-otchetnosti");
	//	//КонецЕсли;
	//	//Элементы.Виджет.Видимость = Истина;
	//КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.КаталогВыгрузки) Тогда
		Если Не ЗначениеЗаполнено(Объект.temp) Тогда
			Объект.temp = ПеременнаяОкруженияСервер("%TEMP%")
		КонецЕсли;
		Объект.КаталогВыгрузки = Объект.temp
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КаталогВыгрузкиЗП) Тогда
		Объект.КаталогВыгрузкиЗП = Объект.КаталогВыгрузки
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КаталогВыгрузкиPaperLess) Тогда
		Объект.КаталогВыгрузкиPaperLess = Объект.КаталогВыгрузки
	КонецЕсли;

	Попытка

		ОбновитьНадписьФормыНастройкиАвтозаполнения();
		
		Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
			ПереключитьРаздел(Элементы.ГрДокументыОтчеты);
			
			Если Объект.ТекВидОперации = "Расходные" Тогда
				ТекущийЭлемент = Элементы.ТекстРасходные;
				ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Расходные накладные';uk='Видаткові накладні'"));
			КонецЕсли;
			Если Объект.ТекВидОперации = "Акты" Тогда
				ТекущийЭлемент = Элементы.ТекстАкты;
				ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Акты выполненных работ';uk='Акти виконаних робіт'"));
			КонецЕсли;
			Если Объект.ТекВидОперации = "Счета" Тогда
				ТекущийЭлемент = Элементы.ТекстСчетаНаОплату;
				ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Счета на оплату';uk='Рахунки на оплату'"));
			КонецЕсли;
			Если Объект.ТекВидОперации = "Заказы" Тогда
				ТекущийЭлемент = Элементы.ТекстЗаказы;
				ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Заказы';uk='Замовлення'"));
			КонецЕсли;
			
			УстановитьТекВидОперации(Объект.ТекВидОперации);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ПериодОбмена) Тогда
			Объект.ПериодОбмена = 5
		КонецЕсли;
		Если Объект.АвтоматическийОбмен Тогда//И Объект.ПериодОбмена <> 0 Тогда 		
			ПодключитьОбработчикОжидания("АвтоОбмен", Объект.ПериодОбмена * 60);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ПериодАвтоОбменаДокументы) Тогда
			Объект.ПериодАвтоОбменаДокументы = 5
		КонецЕсли;
		Если Объект.ФлажокАвтоОбменДокументы Тогда//И Объект.ПериодОбмена <> 0 Тогда 		
			ПодключитьОбработчикОжидания("АвтоОбменДокументы", Объект.ПериодОбмена * 60);
		КонецЕсли;

		Попытка
			Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора.ЗагрузитьЗначения(Объект.СписокЗПРЛ.ВыгрузитьЗначения());
			Объект.ТекущийЗПРЛ = Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора[0].Значение
		Исключение
		КонецПопытки;

		ФлажокВыводитьОстаткиПлатежиПриИзменении(Неопределено);

		ПрочитатьЗаполнитьПредприятияАКСервер();

		Элементы.ТекстВернутьсяИзПараметровОбмена.Видимость = Ложь;
		Элементы.ТекстВернутьсяВЗП.Видимость = Ложь;

		ИмяОбластиВозврата = "";
		ИмяЗаголовкаВозврата = "";
		Объект.ФлажокЗаменитьОтветСервера = Ложь;
		Объект.ПолеВводаТест1 = "";
		Объект.ПолеВводаТест2 = "";

		ВидПакетаЗачислений = "";

		ВидимостьТЧФинДокВходящиеДобавитьНаОсновании();

		УстановитьВидимостьЗаменитьОтветСервера();

		ДобавитьАдресаСерверов();//Объект.РежимОтладки);//на случай динамической зависимости от РежимОтладки
		РежимОтладки = Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Количество() > 1;
		Объект.РежимОтладки = РежимОтладки;
		ГруппаДопПараметыАвторизацииИнтернетАдресДляСоединенияУСтановкаВидимости();
		ОбновитьЗаголовокФормы();

		ВидимостьФлагСчетИзЗаказа();
		Элементы.ТЧФинДокИсходящие.ПодчиненныеЭлементы.ТЧФинДокИсходящиеИмяДокумента.Видимость = Ложь;

		УстановитьДоступностьСписокЭкспортаPDFНастройкаПодписи();

		ПереключитьПоказатьСообщениеНеАвторизовано();

		UnitТест();

		ОбновитьОтображениеСтатуса(ОпределитьСостояниеАвторизовано());

		// авто импорт платежей за день
		Если Объект.АвтоИмпортЗаДень Тогда
			ТекДата = ТекущаяДата();
			ОтборПериод.ДатаНачала = НачалоДня(ТекДата);;
			ОтборПериод.ДатаОкончания = КонецДня(ТекДата);
			ПериодДень("");
			ИмпортПлатежейНаСервере()
		КонецЕсли;

		УстановитьВидимостьКолонокСтруктНП(Ложь);
	
		// проверка исходящих счетов
		Если Не Объект.ФлагНеПроверятьИсходящиеСчетаПриСтарте Тогда
			ВыбратьИсходящиеСозданныеНеоплаченныеСчета()
		КонецЕсли;

		// проверка входящих счетов
		Если Не Объект.ФлагНеПроверятьСчетаПриСтарте И (Объект.ФлагНеПроверятьИсходящиеСчетаПриСтарте Или Объект.ФинансовыеДокументы.Количество() = 0) Тогда
			ЗаполнитьСписокСтатусДокумента();
			ПолучитьВходящиеСчета();
			Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
				ТекстВопроса = НСтр("ru='У вас есть входящие счета на оплату.';uk='У вас є вхідні рахунки на оплату.'");
				сзКнопки = Новый СписокЗначений;
				сзКнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Перейти к счетам';uk='Перейти до рахунків'"));
				сзКнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Закрыть';uk='Закрити'"));
				ЗаголовокВопроса = НСтр("ru='Выставление и оплата счетов-фактур';uk='Виставлення та сплата рахунків-фактур'");
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросИмпортВходящихСчетов", ЭтаФорма);
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, сзКнопки,, КодВозвратаДиалога.Да, ЗаголовокВопроса)
			КонецЕсли
		ИначеЕсли Не Объект.ФлагНеПроверятьСчетаПриСтарте Тогда
			ТекстСообщения = НСтр("ru='Найдены не отправленные исходящие счета. Проверка входящих не просмотренных счетов отменена.';uk='Знайдені не відправлені вихідні рахунки. Перевірка вхідних не переглянутих рахунків відмінена.'");
			СообщениеПользователю(ТекстСообщения, Ложь)
		КонецЕсли

	Исключение
		ТекстОписаниеОшибки = "Ошибка открытия, этап 2: " + ОписаниеОшибки();
		ОтправитьСтатистку("Открытие", "ОткрытиеОшибка", ТекстОписаниеОшибки, Истина);
		СообщениеПользователю(НСтр("ru = 'Ошибка при открытии: ';uk='Помилка при відкритті: '") + ТекстОписаниеОшибки)
	КонецПопытки;

	РежимОтладкиПриИзменении("");

	ЗаголовокВыбраннаяКорпКарта = НСтр("ru='Выбрана группа/карта';uk='Обрана група/картка'");
	Элементы.НадписьВыбраннаяКарта.Заголовок = ЗаголовокВыбраннаяКорпКарта;
	Элементы.НадписьВыбраннаяКарта1.Заголовок = ЗаголовокВыбраннаяКорпКарта;

	ВидимостьКнопокНалоговыеВходящие();
	ВидимостьКнопокНалоговыеИсходящие();
	ВидимостьКнопокФинДокВходящие();
	ВидимостьКнопокФинДокИсходящие();
	ВидимостьКнопокPDFДокИсходящие();
	ВидимостьКнопокОтчетыИсходящие();

	Элементы.КнопкаПоказатьВсеКарты.Видимость = Ложь;
	Элементы.КнопкаСкрытьЗакрытыеИПросроченныеКарты.Видимость = Ложь;

	Объект.ЕстьОшибки = Ложь;

	// сдвиг ДатаПо при смене дня
	ДатаПоОткрытияМодуля = ТекущаяДата();
	ПодключитьОбработчикОжидания("ПроверкаИнтервалаДат", 21600);// 6 часов

	Если Не Объект.РаботаВМоделиСервисаПБ = Истина Или Объект.Это1cnik Тогда
		//запуск проверки обновления каждые 4 часа // первый запуск из ПриСоздании() на мин.версию отключен
		ПервыйЗапускФункцииАвтоОбновленияВФорме = Истина;
		УправлениеОбработчикомОжидания(ПервыйЗапускФункцииАвтоОбновленияВФорме)
	КонецЕсли

КонецПроцедуры // ПриОткрытии

&НаСервере
Процедура ВыбратьИсходящиеСозданныеНеоплаченныеСчетаНаСервере(ДатаНачалаВыборки, ДатаКонцаВыборки)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыбратьИсходящиеСозданныеНеоплаченныеСчета(ДатаНачалаВыборки, ДатаКонцаВыборки);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект")

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИсходящиеСозданныеНеоплаченныеСчета();

	ТекДата = ТекущаяДата();
	Если Объект.ДатаПоследнейВыборкиИсхСчетов = Дата(1, 1, 1) Тогда
		ДатаНачалаВыборки = НачалоДня(ТекДата - 3600 * 24 * 2)//3 календарных дня
	ИначеЕсли Объект.ДатаПоследнейВыборкиИсхСчетов < ТекДата - 3600 * 24 * 6 Тогда//7 календарных дней
		ДатаНачалаВыборки = НачалоДня(3600 * 24 * 7)
	Иначе
		ДатаНачалаВыборки = Объект.ДатаПоследнейВыборкиИсхСчетов
	КонецЕсли;
	ДатаКонцаВыборки = ТекДата;
	вТекВидОперации = Объект.ТекВидОперации;
	Объект.ТекВидОперации = "Счета";

	ВыбратьИсходящиеСозданныеНеоплаченныеСчетаНаСервере(НачалоДня(ДатаНачалаВыборки), КонецДня(ДатаКонцаВыборки));

	Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='У вас есть не оплаченные счета, можете выставить их через Приват24 для бизнеса, контрагенты получат уведомление и смогут в пару кликов создать предзаполненный платеж.';uk='Ви маєте не оплачені рахунки, можете виставити їх через Приват24 для бізнесу, контрагенти отримають повідомлення і зможуть в пару кликів створити передзаповнений платіж.'");
		сзКнопки = Новый СписокЗначений;
		сзКнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Перейти к счетам';uk='Перейти до рахунків'"));
		сзКнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Закрыть';uk='Закрити'"));
		ЗаголовокВопроса = НСтр("ru='У вас есть исходящие счета на оплату.';uk='У вас є вихідні рахунки на оплату.'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЭкспортИсходящихНеоплаченныхСчетов", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, сзКнопки,, КодВозвратаДиалога.Да, ЗаголовокВопроса)
	КонецЕсли;

	Объект.ТекВидОперации = вТекВидОперации;
	ДатаНачалаВыборки = ТекДата

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьИнтерфейсНаИсходящиеСчета()

	ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Счета на оплату';uk='Рахунки на оплату'"));
	Элементы.ГруппаСписокФинДок.ТекущаяСтраница = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокИсходящие;//перекл.вх.финдок
	Элементы.ПанельДействий.ТекущаяСтраница = Элементы.ПанельДействий.ПодчиненныеЭлементы.ДействДокументыОтчеты;//перекл.левого меню
	Элементы.ТекстОбменПлатежами.Шрифт = Новый Шрифт(Элементы.ТекстОбменПлатежами.Шрифт,,, Ложь);//Делаем обычным ссылку
	Элементы.ТекстДокументыОтчеты.Шрифт = Новый Шрифт(Элементы.ТекстДокументыОтчеты.Шрифт,,, Истина);//Делаем жирным ссылку
	Элементы.ТекстСчетаНаОплату.Шрифт = Новый Шрифт(Элементы.ТекстСчетаНаОплату.Шрифт,,, Истина);//Делаем жирным ссылку
	УстановитьТекВидОперации("Счета");
	ВидимостьКнопокНалоговыеИсходящие()

КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеДокументыЭДОНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтметитьВсеДокументыЭДО();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект")

КонецПроцедуры

&НаКлиенте
Процедура ВопросЭкспортИсходящихНеоплаченныхСчетов(Ответ, Параметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОтправитьСтатистку("ДокументыОтчеты", "ПереходКИсхНеоплачСчетам",);
		ПереключитьИнтерфейсНаИсходящиеСчета();
		ОтметитьВсеДокументыЭДОНаСервере()
	Иначе
		ОтправитьСтатистку("ДокументыОтчеты", "ОтказОтПереходаКИсхНеоплачСчетам",)
	КонецЕсли

КонецПроцедуры	

&НаКлиенте
Процедура ПереключитьИнтерфейсНаВходящиеСчетаЭДО()

	ПереключитьРабочуюОбласть(Элементы.ТекстСчетаНаОплату, , НСтр("ru='Счета на оплату';uk='Рахунки на оплату'"));
	Элементы.ГруппаСписокФинДок.ТекущаяСтраница = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокВходящие;//перекл.вх.финдок
	Элементы.ПанельДействий.ТекущаяСтраница = Элементы.ПанельДействий.ПодчиненныеЭлементы.ДействДокументыОтчеты;//перекл.левого меню
	Элементы.ТекстОбменПлатежами.Шрифт = Новый Шрифт(Элементы.ТекстОбменПлатежами.Шрифт,,, Ложь);//Делаем обычным ссылку
	Элементы.ТекстДокументыОтчеты.Шрифт = Новый Шрифт(Элементы.ТекстДокументыОтчеты.Шрифт,,, Истина);//Делаем жирным ссылку
	Элементы.ТекстСчетаНаОплату.Шрифт = Новый Шрифт(Элементы.ТекстСчетаНаОплату.Шрифт,,, Истина);//Делаем жирным ссылку
	УстановитьТекВидОперации("Счета");
	ВидимостьКнопокНалоговыеВходящие()

КонецПроцедуры

&НаКлиенте
Процедура ВопросИмпортВходящихСчетов(Ответ, Параметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОтправитьСтатистку("ДокументыОтчеты", "ПереходКВхНепросмСчетам",);
		ПереключитьИнтерфейсНаВходящиеСчетаЭДО()
	Иначе
		ОтправитьСтатистку("ДокументыОтчеты", "ОтказОтПереходаКВхНепросмСчетам",)
	КонецЕсли

КонецПроцедуры	

&НаКлиенте
Функция ПолучитьИнтервалДат(НачДатаВыборки, Интервал)

	Если Интервал = 1 Тогда
		Возврат НачалоДня(НачДатаВыборки)
	ИначеЕсли Интервал = 2 Тогда
		Возврат НачалоНедели(НачДатаВыборки)
	ИначеЕсли Интервал = 3 Тогда
		Возврат НачалоМесяца(НачДатаВыборки)
	ИначеЕсли Интервал = 4 Тогда
		Возврат НачалоКвартала(НачДатаВыборки)
	ИначеЕсли Интервал = 5 Тогда
		Возврат НачалоГода(НачДатаВыборки)
	КонецЕсли

КонецФункции

&НаСервере
Функция ВыбратьПервуюОрганизацию()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыборкаСпрОрг = Справочники.Организации.Выбрать();
	Пока ВыборкаСпрОрг.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаСпрОрг.Ссылка) Тогда
			Объект.Организация = ВыборкаСпрОрг.Ссылка;
			НайденнаяСтрокаОрганизации = ОбработкаОбьект.ТокеныКомпаний.Найти(ВыборкаСпрОрг.КодПоЕДРПОУ, "КодКомпании");
			Если ЗначениеЗаполнено(НайденнаяСтрокаОрганизации) Тогда
				Прервать
			КонецЕсли
		КонецЕсли
	КонецЦикла

КонецФункции

&НаКлиенте
Процедура UnitТест()

	UnitТестПодписиSmartIDОК = Ложь;
	ЕстьFalse = Ложь;
	ПереченьFalse = "";
	ВидимостьUnitТест = Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Количество() > 1;// Или Объект.Это1cnik;

	Если ВидимостьUnitТест Тогда
		ВремяНачалаТеста = ТекущаяДата();
		Сообщить(Строка(ВремяНачалаТеста) + " Начало Unit-тестирования.")
	Иначе
		Возврат
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ВыбратьПервуюОрганизацию();
		ЕстьЕдиныйНалог = ПроверитьУчетнуюПолитикуПоОрганизацииНаСервере(Объект.Организация);
		ОрганизацияПриИзмененииНаСервере(ЕстьЕдиныйНалог)
	КонецЕсли;

	Объект.UnitТест = Истина;
	вРежимОтладки = Объект.РежимОтладки;
	Объект.РежимОтладки = Истина;

	времВидФинДок = Объект.ТекВидОперации;
	вОтборПериодДатаНачала = ОтборПериод.ДатаНачала;
	вОтборПериодДатаОкончания = ОтборПериод.ДатаОкончания;

	ОтборПериод.ДатаНачала = НачалоДня(ТекущаяДата());
	ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());


	вПолеВводаТест1 = Объект.ПолеВводаТест1;
	Объект.ПолеВводаТест1 = "{
		|""status"" : ""SUCCESS"",
		|""type"" : ""transactions"",
		|""exist_next_page"" : false,
		|""next_page_id"" : ""9999999999_online"",
		|""transactions"" : [ {
		|	""AUT_MY_CRF"" : ""99999999"",
		|	""AUT_MY_MFO"" : ""305299"",
		|	""AUT_MY_ACC"" : ""UA999999999999999999999999999"",
		|	""AUT_MY_NAM"" : ""Текущий депозит Тест"",
		|	""AUT_MY_MFO_NAME"" : ""АТ КБ ПРИВАТБАНК"",
		|	""AUT_MY_MFO_CITY"" : ""Дніпро"",
		|	""AUT_CNTR_CRF"" : ""99999998"",
		|	""AUT_CNTR_MFO"" : ""305299"",
		|	""AUT_CNTR_ACC"" : ""UA999999999999999999999999998"",
		|	""AUT_CNTR_NAM"" : ""Тест - для валютних операцiй"",
		|	""AUT_CNTR_MFO_NAME"" : ""АТ КБ ПРИВАТБАНК"",
		|	""AUT_CNTR_MFO_CITY"" : ""Дніпро"",
		|	""CCY"" : ""UAH"",
		|	""FL_REAL"" : ""r"",
		|	""PR_PR"" : ""r"",
		|	""DOC_TYP"" : ""m"",
		|	""NUM_DOC"" : ""XY9999999"",
		|	""DAT_KL"" : ""21.12.2023"",
		|	""DAT_OD"" : ""21.12.2023"",
		|	""OSND"" : ""Тест"",
		|	""SUM"" : ""0.01"",
		|	""SUM_E"" : ""0.01"",
		|	""REF"" : ""XY99999999PPPP"",
		|	""REFN"" : ""Y"",
		|	""TIM_P"" : ""09:07"",
		|	""DATE_TIME_DAT_OD_TIM_P"" : ""21.12.2023 09:07:00"",
		|	""ID"" : ""9999999999"",
		|	""TRANTYPE"" : ""C"",
		|	""DLR"" : ""XY99999999PPP"",
		|	""TECHNICAL_TRANSACTION_ID"" : ""9999999999_online""
		|}, {
		|	""AUT_MY_CRF"" : ""99999998"",
	    |	""AUT_MY_MFO"" : ""305299"",
	    |	""AUT_MY_ACC"" : ""UA999999999999999999999999998"",
	    |	""AUT_MY_NAM"" : ""Тест - для валютних операцiй"",
	    |	""AUT_MY_MFO_NAME"" : ""АТ КБ ПРИВАТБАНК"",
	    |	""AUT_MY_MFO_CITY"" : ""Дніпро"",
	    |	""AUT_CNTR_CRF"" : ""99999999"",
	    |	""AUT_CNTR_MFO"" : ""305299"",
	    |	""AUT_CNTR_ACC"" : ""UA999999999999999999999999999"",
	    |	""AUT_CNTR_NAM"" : ""Текущий депозит Тест"",
	    |	""AUT_CNTR_MFO_NAME"" : ""АТ КБ ПРИВАТБАНК"",
	    |	""AUT_CNTR_MFO_CITY"" : ""Дніпро"",
	    |	""CCY"" : ""UAH"",
	    |	""FL_REAL"" : ""r"",
	    |	""PR_PR"" : ""r"",
	    |	""DOC_TYP"" : ""m"",
	    |	""NUM_DOC"" : ""CD9999998"",
	    |	""DAT_KL"" : ""22.12.2023"",
	    |	""DAT_OD"" : ""22.12.2023"",
	    |	""OSND"" : ""Тест"",
	    |	""SUM"" : ""0.01"",
	    |	""SUM_E"" : ""0.01"",
	    |	""REF"" : ""XY99999999PPPR"",
	    |	""REFN"" : ""1"",
	    |	""TIM_P"" : ""09:01"",
	    |	""DATE_TIME_DAT_OD_TIM_P"" : ""22.12.2023 09:01:00"",
	    |	""ID"" : ""2999470229"",
	    |	""TRANTYPE"" : ""D"",
	    |	""DLR"" : ""XY99999999PPR"",
	    |	""TECHNICAL_TRANSACTION_ID"" : ""99999999999_online""}]}";

	вПолеВводаТест2 = Объект.ПолеВводаТест2;
	Объект.ПолеВводаТест2 = "{
		|""status"" : ""SUCCESS"",
		|""type"" : ""balances"",
		|""exist_next_page"" : false,
		|""next_page_id"" : ""99999999999999"",
		|""balances"" : [{
		|	""acc"" : ""999999999999999999999999999"",
		|	""currency"" : ""UAH"",
		|	""balanceIn"" : ""0.00"",
		|	""balanceInEq"" : ""0.00"",
		|	""balanceOut"" : ""0.00"",
		|	""balanceOutEq"" : ""0.00"",
		|	""turnoverDebt"" : ""0.00"",
		|	""turnoverDebtEq"" : ""0.00"",
		|	""turnoverCred"" : ""0.00"",
		|	""turnoverCredEq"" : ""0.00"",
		|	""bgfIBrnm"" : "" "",
		|	""brnm"" : ""DNH0"",
		|	""dpd"" : ""22.12.2023 00:00:00"",
		|	""nameACC"" : ""TEST_TEST"",
		|	""state"" : ""a"",
		|	""atp"" : ""U"",
		|	""flmn"" : ""DN"",
		|	""date_open_acc_reg"" : ""10.05.2023 12:16:24"",
		|	""date_open_acc_sys"" : ""10.05.2023 00:00:00"",
		|	""date_close_acc"" : ""01.01.1900 00:00:00"",
		|	""is_final_bal"" : false
		|}, {
		|	""acc"" : ""UA999999999999999999999999998"",
		|	""currency"" : ""UAH"",
		|	""balanceIn"" : ""0.00"",
		|	""balanceInEq"" : ""0.00"",
		|	""balanceOut"" : ""0.00"",
		|	""balanceOutEq"" : ""0.00"",
		|	""turnoverDebt"" : ""0.00"",
		|	""turnoverDebtEq"" : ""0.00"",
		|	""turnoverCred"" : ""0.00"",
		|	""turnoverCredEq"" : ""0.00"",
		|	""bgfIBrnm"" : "" "",
		|	""brnm"" : ""DNH0"",
		|	""dpd"" : ""22.12.2023 00:00:00"",
		|	""nameACC"" : ""TEST_TEST"",
		|	""state"" : ""a"",
		|	""atp"" : ""U"",
		|	""flmn"" : ""DN"",
		|	""date_open_acc_reg"" : ""10.05.2023 12:16:24"",
		|	""date_open_acc_sys"" : ""10.05.2023 00:00:00"",
		|	""date_close_acc"" : ""01.01.1900 00:00:00"",
		|	""is_final_bal"" : false}]}";


	Если Объект.ИдКонф <> "BASR" Тогда

		//------------------------ Платежи --------------------------------

		
		// тест модульный Импорт и запись платежей начало
		вФлажокЗаменитьОтветСервера = Объект.ФлажокЗаменитьОтветСервера;
		Объект.ФлажокЗаменитьОтветСервера = Ложь;
		//вФлажокЗаполнятьДоговорыКонтрагентовИНДС = Объект.ФлажокЗаполнятьДоговорыКонтрагентовИНДС;
		//Объект.ФлажокЗаполнятьДоговорыКонтрагентовИНДС = Истина;
		вНеСоздаватьКонтрагентовАвтоматически = Объект.НеСоздаватьКонтрагентовАвтоматически;
		Объект.НеСоздаватьКонтрагентовАвтоматически = Истина;
		//вФлажокСоздаватьДоговоры = Объект.ФлажокСоздаватьДоговоры;
		//Объект.ФлажокСоздаватьДоговоры = Истина;
		ТекUnitТест = "Тест Импорт и запись платежей";
		UnitТестУспешно = Истина;
		Попытка
			ИмпортПлатежей("");
			Для каждого ПлатежныйДокумент Из Объект.ИмпортПлатежныеДокументы Цикл
				ПлатежныйДокумент.Флажок = Истина
			КонецЦикла;
			СоздатьВходящиеДокументы("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ЕстьFalse = Истина;
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			КонецЕсли
		КонецПопытки;
		Объект.ИмпортПлатежныеДокументы.Очистить();
		////Объект.ФлажокСоздаватьДоговоры = вФлажокСоздаватьДоговоры;
		//Объект.НеСоздаватьКонтрагентовАвтоматически = вНеСоздаватьКонтрагентовАвтоматически;
		////Объект.ФлажокЗаполнятьДоговорыКонтрагентовИНДС = вФлажокЗаполнятьДоговорыКонтрагентовИНДС;
		//Объект.ФлажокЗаменитьОтветСервера = вФлажокЗаменитьОтветСервера;
		// тест модульный Импорт и запись платежей окончание


		// тест модульный Получение остатков начало
		ТекUnitТест = "Тест Получение остатков";
		UnitТестУспешно = Истина;
		Попытка
			ОбновитьОстатки(Неопределено);
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		// тест модульный Получение остатков окончание

	Иначе
		Сообщить("Тест Импорт и запись платежей pass");
		Сообщить("Тест Получение остатков pass")
	КонецЕсли;


	//Объект.ПолеВводаТест1 = вПолеВводаТест1;

		
	// тест модульный Банковская выписка начало
	Объект.ФлажокЗаменитьОтветСервера = Истина;
	UnitТестУспешно = Истина;
	ТекUnitТест = "Тест Получение Банковской выписки";
	Попытка
		СформироватьВыписку("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	ТабДокВыпискаОчистить();
	Объект.ПолеВводаТест1 = вПолеВводаТест1;
	//Объект.ФлажокСоздаватьДоговоры = вФлажокСоздаватьДоговоры;
	Объект.НеСоздаватьКонтрагентовАвтоматически = вНеСоздаватьКонтрагентовАвтоматически;
	//Объект.ФлажокЗаполнятьДоговорыКонтрагентовИНДС = вФлажокЗаполнятьДоговорыКонтрагентовИНДС;

	Объект.ФлажокЗаменитьОтветСервера = вФлажокЗаменитьОтветСервера;
	Объект.ПолеВводаТест2 = вПолеВводаТест2;
	// тест модульный Банковская выписка окончание


	Если Объект.ИдКонф <> "BASR" Тогда

		// тест модульный Экспорт платежей начало
		вВыгружатьНеПроведенныеПлатежи = Объект.ВыгружатьНеПроведенныеПлатежи;
		вФлагЭкспортироватьПлатежиПовторно = Объект.ФлагЭкспортироватьПлатежиПовторно;
		Объект.ВыгружатьНеПроведенныеПлатежи = Истина;
		Объект.ФлагЭкспортироватьПлатежиПовторно = Истина;
		UnitТестУспешно = Истина;
		ТекUnitТест = "Тест Экспорт платежей";
		Попытка
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			Для Интервал = 1 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗаполнитьПлатежныеДокументы("");
				Если Объект.ЭкспортПлатежныеДокументы.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			// отметить первый
			i = 0;
			Для каждого ППИ Из Объект.ЭкспортПлатежныеДокументы Цикл
				ППИ.Флажок = Истина;
				Прервать
			КонецЦикла;
			ЭкспортПлатежей("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.ЭкспортПлатежныеДокументы.Очистить();
		Объект.ВыгружатьНеПроведенныеПлатежи = вВыгружатьНеПроведенныеПлатежи;
		Объект.ФлагЭкспортироватьПлатежиПовторно = вФлагЭкспортироватьПлатежиПовторно;
		// тест модульный Экспорт платежей окончание

	Иначе
		Сообщить("Тест Экспорт платежей pass")
	КонецЕсли;


	//------------------------ КорпКарты --------------------------------

	// тест модульный КорпКарты начало
	вПолеВводаТест1 = Объект.ПолеВводаТест1;
	Объект.ПолеВводаТест1 = "{""Data"":{""JurData"":{""ClientIdJur"":1004410776,""NameClientJur"":""TEST_TEST"",""OKPO"":""31435622"",""allCards"":89,""cardsShown"":89,
		|""CorpData"":[{""corpType"":""CORP"",""CorpCode"":""0050252823"",""Branch"":""DNI0"",""CorpCcy"":980,""jurId"":2341356,""createDate"":""2015-03-27 10:57:20"",
		|""channel"":""PR48"",""bank"":""PB"",""version"":4,""cardsAmount"":0,""cardsShown"":0,""MainCardAcc"":""UA583052990000026000050252823"",""MFO_ACC"":""305299"",
		|""АССState"":""c"",""NameCard"":""TEST, 2600005025282337. тест"",""CorpCcyS"":""980"",""MainCardNum"":""2600****2823=733496323"",""MaskedMainCardNum"":""260000****2823"",
		|""iban"":""UA583052990000026000050252823"",""grType"":null,""openingDate"":""2014-09-04 00:00:00"",""PanData"":[]},
		|{""corpType"":""ACCKEY"",""CorpCode"":""0050252823"",""Branch"":""DNI0"",""CorpCcy"":980,""jurId"":2341356,""createDate"":""2015-03-27 10:57:20"",""channel"":""PR48"",
		|""bank"":""PB"",""version"":4,""cardsAmount"":0,""cardsShown"":0,""MainCardAcc"":""UA583052990000026000050252823"",""MFO_ACC"":""305299"",""АССState"":""c"",
		|""NameCard"":""TEST, 2600005025282337. тест"",""CorpCcyS"":""980"",""MainCardNum"":""2600****2823=733496323"",""MaskedMainCardNum"":""260000****2823"",
		|""iban"":""UA583052990000026000050252823"",""grType"":null,""openingDate"":""2014-09-04 00:00:00"",""PanData"":[]},
		|{""corpType"":""CORP"",""CorpCode"":""31435622WE"",""Branch"":""DNL0"",""CorpCcy"":980,""jurId"":2144785,""createDate"":""2014-03-31 22:03:38"",""channel"":""PR48"",
		|""bank"":""PB"",""version"":143,""cardsAmount"":30,""cardsShown"":30,""MainCardAcc"":""UA303052990000026006050015376"",""MFO_ACC"":""305299"",""АССState"":""a"",
		|""NameCard"":""EDITED-1633210517025"",""CorpCcyS"":""980"",""MainCardNum"":""2600****5376=-503825861"",""MaskedMainCardNum"":""260060****5376"",
		|""iban"":""UA303052990000026006050015376"",""grType"":null,""openingDate"":""2016-07-01 00:00:00"",""PanData"":[{""PanNumber"":""4246****0836=-1467959006"",
		|""MaskedPanNumber"":""424600******0836"",""iban"":""UA303052990000026006050015376"",""ClientIdEkbFiz"":20906397,""InnFiz"":""2984215778"",
		|""FioFiz"":""СОХАЦЬКИЙ ОЛЕКСАНДР АНАТОЛІЙОВИЧ"",""clResident"":false,""PanCorpCode"":""31435622WE"",""PanCcy"":980,""PanState"":4,""PanStateS"":""4"",
		|""PanExpDate"":""1125"",""PanType"":""PK"",""Balance"":0,""DateLastTran"":null,""PanPurse"":10775494,""Bank"":null,""MainCardAcc"":""UA303052990000026006050015376"",
		|""MFO_ACC"":""305299"",""АССState"":""a"",""NameCard"":""EDITED-1633210517025"",""OKPO"":""31435622"",""Branch"":""DNL0"",""ClientIdEkbJur"":1004410776,""JurId"":2144785,
		|""PanFirstAcc"":""4246****6980=1987206443"",""PanCcyS"":""980"",""zachVozmEqaer"":null,""createDate"":null,""channel"":null,""version"":null,""refContract"":null,
		|""contractType"":null,""main"":false,""cardAlias"":""auto-test54"",""can"":null,""isAdd"":false,""believer"":false,""documentSeries"":null,""documentNumber"":null,
		|""openingDate"":""2016-07-01 00:00:00"",""Contact"":{""ContactNumber"":""+380868872230""}},
		|{""PanNumber"":""4246****6780=-461763000"",""MaskedPanNumber"":""424600******6780"",""iban"":""UA303052990000026006050015376"",""ClientIdEkbFiz"":45550367,
		|""InnFiz"":""3349903807"",""FioFiz"":""МУНТЯН ДАРИНА ІГОРІВНА"",""clResident"":false,""PanCorpCode"":""31435622WE"",""PanCcy"":980,""PanState"":1,""PanStateS"":""1"",
		|""PanExpDate"":""0324"",""PanType"":""00"",""Balance"":6.19,""DateLastTran"":null,""PanPurse"":12632026,""Bank"":""PB"",""MainCardAcc"":""UA303052990000026006050015376"",
		|""MFO_ACC"":""305299"",""АССState"":""a"",""NameCard"":""EDITED-1633210517025"",""OKPO"":""31435622"",""Branch"":""DNL0"",""ClientIdEkbJur"":1004410776,""JurId"":2144785,
		|""PanFirstAcc"":""4246****0980=1873092913"",""PanCcyS"":""980"",""zachVozmEqaer"":""N"",""createDate"":""2021-09-22 10:27:12"",""channel"":""PR48"",""version"":3,
		|""refContract"":""SAMDNWFC00070763536"",""contractType"":""BBCA"",""main"":false,""cardAlias"":""auto-test731"",""can"":""4246001066086780980"",""isAdd"":false,
		|""believer"":false,""documentSeries"":null,""documentNumber"":null,""openingDate"":""2016-07-01 00:00:00"",""Contact"":{""ContactNumber"":""+380868872230""}},
		|{""PanNumber"":""4246****4211=-442589313"",""MaskedPanNumber"":""424600******4211"",""iban"":""UA303052990000026006050015376"",""ClientIdEkbFiz"":1000558164,
		|""InnFiz"":""3271817242"",""FioFiz"":""ШАТІЛО АНАСТАСІЯ ОЛЕКСАНДРІВНА"",""clResident"":false,""PanCorpCode"":""31435622WE"",""PanCcy"":980,""PanState"":4,
		|""PanStateS"":""4"",""PanExpDate"":""0324"",""PanType"":""00"",""Balance"":0,""DateLastTran"":null,""PanPurse"":9577761,""Bank"":null,
		|""MainCardAcc"":""UA303052990000026006050015376"",""MFO_ACC"":""305299"",""АССState"":""a"",""NameCard"":""EDITED-1633210517025"",""OKPO"":""31435622"",""Branch"":""DNL0"",
		|""ClientIdEkbJur"":1004410776,""JurId"":2144785,""PanFirstAcc"":""4246****1980=1379360502"",""PanCcyS"":""980"",""zachVozmEqaer"":null,""createDate"":null,
		|""channel"":null,""version"":null,""refContract"":null,""contractType"":null,""main"":false,""cardAlias"":null,""can"":null,""isAdd"":false,""believer"":false,
		|""documentSeries"":null,""documentNumber"":null,""openingDate"":""2016-07-01 00:00:00"",""Contact"":{""ContactNumber"":""+380868872230""}},
		|{""PanNumber"":""4246****6976=-440461313"",""MaskedPanNumber"":""424600******6976"",""iban"":""UA303052990000026006050015376"",""ClientIdEkbFiz"":45627778,
		|""InnFiz"":""3284605569"",""FioFiz"":""КУЗЬМИЧ ОЛЬГА ВОЛОДИМИРІВНА"",""clResident"":false,""PanCorpCode"":""31435622WE"",""PanCcy"":980,""PanState"":4,""PanStateS"":""4"",
		|""PanExpDate"":""0324"",""PanType"":""00"",""Balance"":0.01,""DateLastTran"":null,""PanPurse"":8886313,""Bank"":""PB"",""MainCardAcc"":""UA303052990000026006050015376"",
		|""MFO_ACC"":""305299"",""АССState"":""a"",""NameCard"":""EDITED-1633210517025"",""OKPO"":""31435622"",""Branch"":""DNL0"",""ClientIdEkbJur"":1004410776,""JurId"":2144785,
		|""PanFirstAcc"":""4246****6980=-929887689"",""PanCcyS"":""980"",""zachVozmEqaer"":""N"",""createDate"":""2022-04-20 12:05:53"",""channel"":""PR48"",""version"":3,
		|""refContract"":""SAMDNWFC00076026846"",""contractType"":""BBCA"",""main"":false,""cardAlias"":null,""can"":""4246001066106976980"",""isAdd"":false,""believer"":false,
		|""documentSeries"":null,""documentNumber"":null,""openingDate"":""2016-07-01 00:00:00"",""Contact"":{""ContactNumber"":""+380868872230""}}
		|]}]}}}";
	UnitТестУспешно = Истина;
	ТекUnitТест = "Тест Получение КорпКарт";
	Попытка
		КомандаОбновитьСписокКорпКарт("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	// тест модульный КорпКарты окончание


	// тест модульный Получение всех КорпКарт начало
	UnitТестУспешно = Истина;
	ТекUnitТест = "Тест Получение всех КорпКарт";
	Попытка
		КомандаПоказатьВсеКарты("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	// тест модульный Получение всех КорпКарт окончание


	// тест модульный Получение закрытых и просроченных КорпКарт начало
	UnitТестУспешно = Истина;
	ТекUnitТест = "Тест Получение закрытых и просроченных КорпКарт";
	Попытка
		КомандаСкрытьЗакрытыеИПросроченныеКарты("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	ТабличноеПолеКорпКартыОчистить();
	// тест модульный Получение закрытых и просроченных КорпКарт окончание


	// тест модульный Получение выписки КорпКарт начало
	UnitТестУспешно = Истина;
	ТекUnitТест = "Тест Получение выписки корпкарт";
	Попытка
		Попытка
			branch = Объект.ТабличноеПолеКорпКарты[0].branch;
			corporation = Объект.ТабличноеПолеКорпКарты[0].corporation
		Исключение КонецПопытки;
		КомандаОбновитьВыпискаКорпКарты("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	ТабличноеПолеВыпискаОчистить();
	// тест модульный Получение выписки КорпКарт окончание


	// тест модульный Получение журнала КорпКарт начало
	UnitТестУспешно = Истина;
	ТекUnitТест = "Тест Получение журнала КорпКарт";
	Попытка
		КомандаОбновитьЖурналКорпКарты("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	ТабличноеПолеОтчетОчистить();
	Объект.ПолеВводаТест1 = вПолеВводаТест1;
	Объект.ФлажокЗаменитьОтветСервера = вФлажокЗаменитьОтветСервера;
	ТабличноеПолеКорпКартыОчистить();
	// тест модульный Получение журнала КорпКарт окончание

	//------------------------ ЗП --------------------------------

	// тест модульный Получение списка ЗП начало
	ТекUnitТест = "Тест Получение списка ЗП";
	вСписокЗП = Элементы.СписокЗП.СписокВыбора.ВыгрузитьЗначения();
	вТекущийЗП = Объект.ТекущийЗП;
	вПолеВводаТест1 = Объект.ПолеВводаТест1;
	Объект.ПолеВводаТест1 = "{""status"":""ok"",""data"":[{
		|""type"":""SALARY"",""name"":""TEST"",""rko"":0.25},
		|{""type"":""MASSPAYMENTS"",""name"":""TEST"",""rko"":0.5}]}";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ПолучениеЗарплатногоПроекта("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ТекущийЗП = вТекущийЗП;
	Элементы.СписокЗП.СписокВыбора.ЗагрузитьЗначения(вСписокЗП);
	// тест модульный Получение списка ЗП окончание


	// тест модульный Получение списка ведомостей ЗП начало
	ТекUnitТест = "Тест Получение списка ведомостей ЗП";
	вСписокЗПВедомостей = Элементы.ИДПакетаЗачислений.СписокВыбора.ВыгрузитьЗначения();
	вИДПакетаЗачислений = Объект.ИДПакетаЗачислений;
	Объект.ПолеВводаТест1 = "{""status"":""ok"",""data"":[{
		|""reference"":""99999999999999999999"",""system"":""maspay"",""createdAt"":""2024-01-09T09:27:49.922+0200"",""status"":""N"",
		|""packetName"":""тестова ЗП відомість автотест"",""recordCount"":0,""recordAmount"":0.0,""revision"":0},
		|{""reference"":""99999999999999999998"",""system"":""maspay"",""createdAt"":""2024-01-09T09:27:49.398+0200"",""status"":""N"",
		|""packetName"":""тестова ЗП відомість автотест"",""recordCount"":0,""recordAmount"":0.0,""revision"":0}]}";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ОбновитьСписокПакЗач("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ИДПакетаЗачислений = вИДПакетаЗачислений;
	Элементы.ИДПакетаЗачислений.СписокВыбора.ЗагрузитьЗначения(вСписокЗПВедомостей);
	// тест модульный Получение списка ведомостей ЗП окончание


	// тест модульный Проверка ведомости ЗП начало
	ТекUnitТест = "Тест Проверка ведомости ЗП";
	вСписокЗПВедомостей = Элементы.ИДПакетаЗачислений.СписокВыбора.ВыгрузитьЗначения();
	//вПолеВводаТест1 из предыдущего теста
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ПроверитьВедомость("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли;
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Элементы.ИДПакетаЗачислений.СписокВыбора.ЗагрузитьЗначения(вСписокЗПВедомостей);
	// тест модульный Проверка ведомости ЗП окончание
	

	// тест модульный Просмотр ведомости ЗП начало
	ПолеВводаТест1 = "{""status"":""ok"",""data"":[{""ref"":""9999999999999"",""fio"":""Зибуревич Арутюн Карапетович"",""inn"":""0000000000"",
		|""cardNumber"":""9999999999999999"",""comment"":""Заробітна плата"",""amount"":1.0,""status"":""R"",""tabNo"":""9999999999""}]}";
	ТекUnitТест = "Тест Просмотр ведомости ЗП";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ЗаполнитьПФВедомости("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	ТабДокВедомостьЗПОчистить();
	// тест модульный Просмотр ведомости ЗП окончание


	// тест модульный Получение списка карт ЗП начало
	Объект.ПолеВводаТест1 = "{""status"":""ok"",""data"":[{""id"":""9999999_8888888888"",""pan"":""9999 **** **** 8888"",
		|""fio"":[""Зибуревич"",""Арутюн"",""Карапетович""],""inn"":""9999999999"",""group"":""SALARY"",""tabn"":""99999""},
		|{""id"":""888888888_999"",""pan"":""9999 **** **** 9999"",""fio"":[""Сиперович"",""Дмитро"",""Олександрович""],""inn"":""8888888888"",
		|""group"":""SALARY"",""tabn"":""888""}]}";
	ТекUnitТест = "Тест Получение списка карт ЗП";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ПолучениеСпискаКарт("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ТабличноеПолеДобавлениеСотрудниковЗП.Очистить();
	// тест модульный Получение списка карт ЗП окончание


	// тест модульный Добавление сотрудника в группу ЗП начало
	ТекUnitТест = "Тест Добавление сотрудника в группу ЗП";
	НоваяСтрокаТЗ = Объект.ТабличноеПолеПолучателиЗП.Добавить();
	НоваяСтрокаТЗ.КолонкаСотрудник = ВыбратьПервогоСотрудникаНаСервере();
	НоваяСтрокаТЗ.КолонкаТабельныйНомер = "99999";
	НоваяСтрокаТЗ.КолонкаИНН = "9999999999";
	НоваяСтрокаТЗ.КолонкаНомерКарты = "9999999999999999";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ДобавитьСотрудникаВГруппу("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ТабличноеПолеПолучателиЗП.Очистить();
	// тест модульный Добавление сотрудника в группу ЗП окончание


	Если Найти("UT_3,OSMD", Объект.ИдКонф) = 0 Тогда

		// тест модульный Отправка ведомости ЗП / сохранение ведомости в файл начало
		ТекUnitТест = "Тест Отправка ведомости ЗП";
		ОтборПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
		Для Интервал = 1 По 5 Цикл
			ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
			ЗаполнитьСписокВедомостей("");
			Если Объект.ЗарплатныеВедомости.Количество() > 0 Тогда
				Прервать
			КонецЕсли
		КонецЦикла;
		// отметить первый
		Для каждого ЗПВедомости Из Объект.ЗарплатныеВедомости Цикл
			ЗПВедомости.Флажок = Истина;
			Прервать
		КонецЦикла;
		вСоздаватьНовуюВедомостьПоКаждойСтроке = Объект.СоздаватьНовуюВедомостьПоКаждойСтроке;
		Объект.ПолеВводаТест1 = "{""status"":""ok"",""data"":[{
			|""reference"":""99999999999999999999"",""system"":""maspay"",""createdAt"":""2024-01-09T09:27:49.922+0200"",""status"":""N"",
			|""packetName"":""тестова ЗП відомість автотест"",""recordCount"":0,""recordAmount"":0.0,""revision"":0},
			|{""reference"":""99999999999999999998"",""system"":""maspay"",""createdAt"":""2024-01-09T09:27:49.398+0200"",""status"":""N"",
			|""packetName"":""тестова ЗП відомість автотест"",""recordCount"":0,""recordAmount"":0.0,""revision"":0}]}";
		ОтправитьВедомости("");
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		ТекUnitТест = "Тест Сохранение ведомости ЗП в файл";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ВыгрузитьВедомостьВФайл("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.ЗарплатныеВедомости.Очистить();
		Объект.ТабличноеПолеДобавлениеСотрудниковЗП.Очистить();
		Объект.ПолеВводаТест1 = вПолеВводаТест1;
		Объект.СоздаватьНовуюВедомостьПоКаждойСтроке = вСоздаватьНовуюВедомостьПоКаждойСтроке;
		// тест модульный Отправка ведомости ЗП / сохранение ведомости в файл окончание

	Иначе
		Сообщить("Тест Сохранение ведомости ЗП в файл pass")
	КонецЕсли;
	Элементы.СписокЗП.СписокВыбора.Очистить();
	Объект.СписокЗП = "";
	Объект.ТекущийЗП = "";
	Объект.ИДПакетаЗачислений = "";


	//------------------------ РЛ --------------------------------


	// тест модульный Получение списка ЗП проектов РЛ начало
	ТекUnitТест = "Тест Получение списка ЗП проектов РЛ";
	вПолеВводаТест1 = Объект.ПолеВводаТест1;
	Объект.ПолеВводаТест1 = "[{""uploadTime"":""2021-05-20T00:00:00.000"",""project"":{""reference"":""99999999999"",""name"":""TEST1""},
		|""reportYm"": ""202401"",""fileType"":""PAYSHEET"",""status"":""UPLOADED""},
		|{""uploadTime"":""2021-05-20T00:00:00.000"",""project"":{""reference"":""99999999998"",""name"":""TEST2""},
		|""reportYm"": ""202401"",""fileType"":""PAYSHEET"",""status"":""UPLOADED""}]";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ПолучениеЗарплатногоПроектаРЛ("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ПолеВводаТест1 = вПолеВводаТест1;
	Объект.СписокЗПРЛ.Очистить();
	// тест модульный Получение списка ЗП проектов РЛ окончание
	Объект.РасчетныеЛистки.Очистить();


	Если Найти("BASR,UT_3", Объект.ИдКонф) = 0 Тогда

		// тест модульный Отправка РЛ начало
		Попытка
			ТекUnitТест = "Тест Отправка РЛ";
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
			Для Интервал = 3 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗаполнитьСписокРасчетныхЛистков("");
				Если Объект.РасчетныеЛистки.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			// отметить первый
			Для каждого РЛ Из Объект.РасчетныеЛистки Цикл
				РЛ.Флажок = Истина;
				Прервать
			КонецЦикла;
			ОтправитьРасчетныеЛискти("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		// тест модульный Отправка РЛ окончание


		// тест модульный Сохранение РЛ в файлы начало
		ТекUnitТест = "Тест Сохранение РЛ в файлы";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
			Для Интервал = 3 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗаполнитьСписокРасчетныхЛистков("");
				Если Объект.РасчетныеЛистки.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			// отметить первый
			Для каждого РЛ Из Объект.РасчетныеЛистки Цикл
				РЛ.Флажок = Истина;
				Прервать
			КонецЦикла;
			СохранитьФайлыРасчетныхЛистков("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.РасчетныеЛистки.Очистить();
		Объект.СписокЗПРЛ.Очистить();
		Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора.Очистить();
		Объект.ТекущийЗПРЛ = "";
		// тест модульный Сохранение РЛ в файлы окончание

	Иначе
		Сообщить("Тест Отправка РЛ pass");
		Сообщить("Тест Сохранение РЛ в файлы pass")
	КонецЕсли;


	//------------------------ ЭДО --------------------------------
	//------------------------ Налоговые док --------------------------------

	Если Найти("BASR,OSMD,AAA", Объект.ИдКонф) = 0 Тогда

		// тест модульный Заполнение, отправка, проверка статусов и подпись SmartID Налоговых накладных, приложений2 и ЗапросКЕРНН начало
		ТекUnitТест = "Тест Заполнение, отправка, проверка статусов и подпись SmartID Налоговых накладных, приложений2 и ЗапросКЕРНН";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			Элементы.ГруппаВходящиеИсходящиеНН.ТекущаяСтраница = Элементы.ННИсходящие;
			УстановитьТекВидОперации("НН");
			Если Ложь Тогда
				Если ВидимостьUnitТест Тогда
					Сообщить(ТекUnitТест + " pass")
				КонецЕсли
			Иначе
				i = 0; ВидДокументаНалоговые = "";
				Для Интервал = 1 По 5 Цикл
					ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
					ЗаполнитьСписокДокументов("");
					Если Объект.СписокДокументов.Количество() < 3 Или i > Объект.СписокДокументов.Количество() Тогда
						i = 0; ВидДокументаНалоговые = "";
						Продолжить
					КонецЕсли;
					Если Объект.СписокДокументов[i].ВидДокумента <> ВидДокументаНалоговые Тогда
						ВидДокументаНалоговые = Объект.СписокДокументов[i].ВидДокумента;
						i = i + 1
					КонецЕсли;
					Если i = 2 Тогда
						Прервать
					КонецЕсли
				КонецЦикла;
				// отметить первые 3 разные
				i = 0; ВидДокументаНалоговые1 = "";ВидДокументаНалоговые2 = "";ВидДокументаНалоговые3 = "";
				Для каждого ДокНалоговые Из Объект.СписокДокументов Цикл
					Если ВидДокументаНалоговые1 = "" Тогда
						ВидДокументаНалоговые1 = ДокНалоговые.ВидДокумента;
						ДокНалоговые.Флажок = Истина;
						i = i + 1
					ИначеЕсли ВидДокументаНалоговые2 = "" И ДокНалоговые.ВидДокумента <> ВидДокументаНалоговые1 Тогда
						ВидДокументаНалоговые2 = ДокНалоговые.ВидДокумента;
						ДокНалоговые.Флажок = Истина;
						i = i + 1
					ИначеЕсли ВидДокументаНалоговые3 = "" И ДокНалоговые.ВидДокумента <> ВидДокументаНалоговые1
							И ДокНалоговые.ВидДокумента <> ВидДокументаНалоговые2 Тогда
						ВидДокументаНалоговые3 = ДокНалоговые.ВидДокумента;
						ДокНалоговые.Флажок = Истина;
						i = i + 1
					КонецЕсли;
					Если i = 3 Тогда
						Прервать
					КонецЕсли
				КонецЦикла;
				ВыпВЦикле = Истина;
				Пока ВыпВЦикле Цикл
					ВыпВЦикле = ЗарегистрироватьДокументыНаСервере()
				КонецЦикла;
				//подпись SmartID
				Объект.ПолеВводаТест1 = "{""status"":""1"", ""clientId"":""тест"", ""operationId"":""тест1""}}";
				ВыгрузитьКолонкуФлажокНалоговыеНаСервере();
				ПодписьSmartID("СписокДокументов", "Налоговые", , Ложь);
				// проверка статусов
				// отметить (первые 3)
				Для каждого ДокНалоговые Из Объект.СписокДокументов Цикл
					ДокНалоговые.Флажок = Истина
				КонецЦикла;
				Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-10-14 21:28:10"",""DOC_DATE"":""2024-10-14"",
					|""RECEIPT_DATE"":null,""SEND_DATE"":null,""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,""AMOUNT"":-1189.00,""STATUS"":3,
					|""STATUS_NAME"":""READY_TO_WORK"",""OKPO_SENDER"":""31435622"",""OKPO_RECIPIENT"":""10000001"",""DOC_NUMBER"":""10"",
					|""ORIGINAL_DOC_NAME"":""04060031435622J1201215100000001011020240406.xml"",""DOC_TYPE"":2658,
					|""OKPO_RECIPIENT_NAME"":""Неплатник"",""OKPO_SENDER_NAME"":"" Нуль Нулевой Нулевич"",""ID"":1332626421,
					|""LAST_MODIFY_TIME"":""2024-10-14 21:28:10"",""DOC_NAME"":""04060031435622J1201215100000001011020240406.XML"",
					|""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",""ADDITION_STATUS"":null,
					|""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""-83.23\"",
					|\""taxData\"": {\""R001G03\"": \""-83.23\"", \""R01G111\"": \""-1189.00\"", \""R02G111\"": \""-83.23\""},
					|\""tinSender\"": \""31435622\"", \""tinRecipient\"": \""100000000000\""}"",""TIN_SENDER"":""31435622"",
					|""TIN_RECIPIENT"":""100000000000"",""VAT"":""-83.23"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,""PAYMENT_REFERENCE"":null,
					|""COMMENT"":null,""TAGS"":null,""TAXES"":null,""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}
					//,{"idStr":null,"CREATE_DATE":"2024-10-14 21:27:58","DOC_DATE":"2024-10-14","RECEIPT_DATE":null,"SEND_DATE":null,
					//"TAX_HDATETIME":null,"TAX_HNUMREG":null,"AMOUNT":1272.23,"STATUS":3,"STATUS_NAME":"READY_TO_WORK","OKPO_SENDER":"31435622","OKPO_RECIPIENT":"10000001","DOC_NUMBER":"9","ORIGINAL_DOC_NAME":"04060031435622J1201015100000000911020240406.xml","DOC_TYPE":2653,"OKPO_RECIPIENT_NAME":"Неплатник","OKPO_SENDER_NAME":" Нуль Нулевой Нулевич","ID":1332626420,"LAST_MODIFY_TIME":"2024-10-14 21:27:58","DOC_NAME":"04060031435622J1201015100000000911020240406.XML","IS_EDITED":false,"NEED_TO_EDIT":false,"IS_RENDERED_TO_PDF":false,"CREATOR":"USER","ADDITION_STATUS":null,"TAX_RESULT_STATUS":"UNKNOWN","ID_OF_BASE_DOC":null,"DOC_ADDITIONAL_DATA":"{\"vat\": \"83.23\", \"taxData\": {\"R03G11\": \"83.23\", \"R04G11\": \"1272.23\", \"R01G109\": \"1189.00\", \"R03G109\": \"83.23\"}, \"tinSender\": \"31435622\", \"tinRecipient\": \"100000000000\"}","TIN_SENDER":"31435622","TIN_RECIPIENT":"100000000000","VAT":"83.23","UNREAD_SENDER":0,"UNREAD_RECIPIENT":0,"PAYMENT_REFERENCE":null,"COMMENT":null,"TAGS":null,"TAXES":null,"UNREAD_DISCUSSION_SENDER":0,"UNREAD_DISCUSSION_RECIPIENT":0}
					|],""total"":2,""offset"":0,""limit"":500,""sorted_by"":""DOC_DATE""}";
				ПроверитьСостояниеРегистрации("");
				Если ВидимостьUnitТест Тогда
					Если UnitТестУспешно Тогда
						Сообщить(ТекUnitТест + " ОК")
					Иначе
						ВызватьИсключение("")
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.СписокДокументов.Очистить();
		// тест модульный Заполнение, отправка, проверка статусов и подпись SmartID Налоговых накладных, приложений2 и ЗапросКЕРНН окончание


		// тест модульный Импорт и запись Налоговых накладных и приложений2 начало
		ЕстьОшибки = Ложь;
		Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-09-02 01:33:13"",""DOC_DATE"":""2024-07-24"",
			|""RECEIPT_DATE"":""2024-09-02 01:33:13"",""SEND_DATE"":""2024-09-02 01:33:13"",""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,
			|""AMOUNT"":13.27,""STATUS"":12,""STATUS_NAME"":""SIGNED_BY_RECIPIENT"",""OKPO_SENDER"":""88888888"",""OKPO_RECIPIENT"":""99999999"",
			|""DOC_NUMBER"":""61735811"",""ORIGINAL_DOC_NAME"":""invoice.xml"",""DOC_TYPE"":2653,""OKPO_RECIPIENT_NAME"":""Тест тест"",
			|""OKPO_SENDER_NAME"":""ТОВ"",""ID"":1332304700,""LAST_MODIFY_TIME"":""2024-09-02 01:33:13"",
			|""DOC_NAME"":""invoice.xml"",""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",
			|""ADDITION_STATUS"":""PAYMENT_WAS_DELETED"",""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,
			|""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""2.21\"", \""tinRecipient\"": \""3143562222\""}"",""TIN_SENDER"":null,
			|""TIN_RECIPIENT"":""3143562222"",""VAT"":""2.21"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,
			|""PAYMENT_REFERENCE"":""1123976950679863048"",""COMMENT"":null,""TAGS"":""[\""Арбуз\""]"",""TAXES"":null,
			|""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0},

			|{""idStr"":null,""CREATE_DATE"":""2024-09-02 01:33:13"",""DOC_DATE"":""2024-07-24"",
			|""RECEIPT_DATE"":""2024-09-02 01:33:13"",""SEND_DATE"":""2024-09-02 01:33:13"",""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,
			|""AMOUNT"":13.27,""STATUS"":12,""STATUS_NAME"":""SIGNED_BY_RECIPIENT"",""OKPO_SENDER"":""88888888"",""OKPO_RECIPIENT"":""99999999"",
			|""DOC_NUMBER"":""61735811"",""ORIGINAL_DOC_NAME"":""invoice.xml"",""DOC_TYPE"":2658,""OKPO_RECIPIENT_NAME"":""Тест тест"",
			|""OKPO_SENDER_NAME"":""ТОВ"",""ID"":1332304700,""LAST_MODIFY_TIME"":""2024-09-02 01:33:13"",
			|""DOC_NAME"":""invoice.xml"",""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",
			|""ADDITION_STATUS"":""PAYMENT_WAS_DELETED"",""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,
			|""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""2.21\"", \""tinRecipient\"": \""3143562222\""}"",""TIN_SENDER"":null,
			|""TIN_RECIPIENT"":""3143562222"",""VAT"":""2.21"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,
			|""PAYMENT_REFERENCE"":""1123976950679863048"",""COMMENT"":null,""TAGS"":""[\""Арбуз\""]"",""TAXES"":null,
			|""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}],

			|""total"":1,""offset"":0,""limit"":500,
			|""sorted_by"":""LAST_MODIFY_TIME""}";
		Объект.ПолеВводаТест2 = "<?xml version=""1.0"" encoding=""windows-1251""?><DECLAR xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
			|xsi:noNamespaceSchemaLocation=""F1201015.xsd""><DECLARHEAD><TIN>8888888881</TIN>
			|<C_DOC>F12</C_DOC>
			|<C_DOC_SUB>010</C_DOC_SUB>
			|<C_DOC_VER>15</C_DOC_VER>
			|<C_DOC_TYPE>0</C_DOC_TYPE>
			|<C_DOC_CNT>1</C_DOC_CNT>
			|<C_REG>1</C_REG>
			|<C_RAJ>02</C_RAJ>
			|<PERIOD_MONTH>01</PERIOD_MONTH>
			|<PERIOD_TYPE>1</PERIOD_TYPE>
			|<PERIOD_YEAR>2024</PERIOD_YEAR>
			|<C_STI_ORIG>102</C_STI_ORIG>
			|<C_DOC_STAN>1</C_DOC_STAN>
			|<D_FILL>09012024</D_FILL>
			|</DECLARHEAD>
			|<DECLARBODY><HFILL>09012024</HFILL>
			|<HNUM>1</HNUM>
			|<HNAMESEL>ФОП Тестувальний Тарас Петрович</HNAMESEL>
			|<HNAMEBUY>Тест тест</HNAMEBUY>
			|<HKSEL>8888888881</HKSEL>
			|<HTINSEL>8888888881</HTINSEL>
			|<HKBUY>31435622</HKBUY>
			|<HTINBUY>31435622</HTINBUY>
			|<R04G11>5.76</R04G11>
			|<R03G11>0.96</R03G11>
			|<R03G7>0.96</R03G7>
			|<R01G7>4.80</R01G7>
			|<RXXXXG3S ROWNUM=""1"">Тест Аня</RXXXXG3S>
			|<RXXXXG4S ROWNUM=""1"">шт</RXXXXG4S>
			|<RXXXXG105_2S ROWNUM=""1"">2009</RXXXXG105_2S>
			|<RXXXXG5 ROWNUM=""1"">8</RXXXXG5>
			|<RXXXXG6 ROWNUM=""1"">0.6</RXXXXG6>
			|<RXXXXG008 ROWNUM=""1"">20</RXXXXG008>
			|<RXXXXG010 ROWNUM=""1"">4.80</RXXXXG010>
			|<RXXXXG11_10 ROWNUM=""1"">0.960</RXXXXG11_10>
			|<HBOS>Черненко Анна Олександрівна</HBOS>
			|<HKBOS>1234567890</HKBOS>
			|</DECLARBODY>
			|</DECLAR>";
		ТекUnitТест = "Тест Импорт и запись Налоговых накладных и приложений2";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			Элементы.ГруппаВходящиеИсходящиеНН.ТекущаяСтраница = Элементы.ННВходящие;
			УстановитьТекВидОперации("НН");
			Если Ложь Тогда
				Если ВидимостьUnitТест Тогда
					Сообщить(ТекUnitТест + " pass")
				КонецЕсли
			Иначе
				i = 0; ВидДокументаНалоговые = "";
				ОтборПериод.ДатаНачала = ТекущаяДата();
				ЗагрузитьФинДок("");
				Для каждого ДокНалоговые Из Объект.СписокДокументов Цикл
					ДокНалоговые.Флажок = Истина;
				КонецЦикла;
				ЗаписатьВходящиеНН("");
				Если ВидимостьUnitТест Тогда
					Если UnitТестУспешно Тогда
						Сообщить(ТекUnitТест + " ОК")
					Иначе
						ВызватьИсключение("")
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.СписокДокументов.Очистить();
		// тест модульный Импорт и запись Налоговых накладных и приложений2 окончание

	Иначе
		Сообщить("Тест Заполнение, отправка и проверка статусов Налоговых накладных, приложений2 и ЗапросКЕРНН pass");
		Сообщить("Тест Импорт и запись Налоговых накладных и приложений2 pass");
		//Сообщить("Тест Заполнение и отправка ЗапросКЕРНН pass")
	КонецЕсли;


	//------------------------ Финансовые док --------------------------------

	Если Объект.ИдКонф <> "BASR" Тогда

		// тест модульный Заполнение, отправка и проверка статусов актов начало
		ТекUnitТест = "Тест Заполнение, отправка и проверка статусов актов";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			УстановитьТекВидОперации("Акты");
			Если Ложь Тогда
				Если ВидимостьUnitТест Тогда
					Сообщить(ТекUnitТест + " pass")
				КонецЕсли
			Иначе
				Для Интервал = 1 По 5 Цикл
					ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
					ЗаполнитьСписокФинДок("");
					Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
						Прервать
					КонецЕсли
				КонецЦикла;
				// отметить первый
				Для каждого ДокАкт Из Объект.ФинансовыеДокументы Цикл
					ДокАкт.Флажок = Истина;
					Прервать
				КонецЦикла;
				ОтправитьФинДок("");
				// проверка статусов
				// отметить первый
				Для каждого ДокАкт Из Объект.ФинансовыеДокументы Цикл
					ДокАкт.Флажок = Истина;
					Прервать
				КонецЦикла;
				Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-10-14 21:28:10"",""DOC_DATE"":""2024-10-14"",
					|""RECEIPT_DATE"":null,""SEND_DATE"":null,""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,""AMOUNT"":-1189.00,""STATUS"":3,
					|""STATUS_NAME"":""READY_TO_WORK"",""OKPO_SENDER"":""31435622"",""OKPO_RECIPIENT"":""10000001"",""DOC_NUMBER"":""10"",
					|""ORIGINAL_DOC_NAME"":""04060031435622J1201215100000001011020240406.xml"",""DOC_TYPE"":2658,
					|""OKPO_RECIPIENT_NAME"":""Неплатник"",""OKPO_SENDER_NAME"":"" Нуль Нулевой Нулевич"",""ID"":1332626421,
					|""LAST_MODIFY_TIME"":""2024-10-14 21:28:10"",""DOC_NAME"":""04060031435622J1201215100000001011020240406.XML"",
					|""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",""ADDITION_STATUS"":null,
					|""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""-83.23\"",
					|\""taxData\"": {\""R001G03\"": \""-83.23\"", \""R01G111\"": \""-1189.00\"", \""R02G111\"": \""-83.23\""},
					|\""tinSender\"": \""31435622\"", \""tinRecipient\"": \""100000000000\""}"",""TIN_SENDER"":""31435622"",
					|""TIN_RECIPIENT"":""100000000000"",""VAT"":""-83.23"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,""PAYMENT_REFERENCE"":null,
					|""COMMENT"":null,""TAGS"":null,""TAXES"":null,""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}
					//,{"idStr":null,"CREATE_DATE":"2024-10-14 21:27:58","DOC_DATE":"2024-10-14","RECEIPT_DATE":null,"SEND_DATE":null,
					//"TAX_HDATETIME":null,"TAX_HNUMREG":null,"AMOUNT":1272.23,"STATUS":3,"STATUS_NAME":"READY_TO_WORK","OKPO_SENDER":"31435622","OKPO_RECIPIENT":"10000001","DOC_NUMBER":"9","ORIGINAL_DOC_NAME":"04060031435622J1201015100000000911020240406.xml","DOC_TYPE":2653,"OKPO_RECIPIENT_NAME":"Неплатник","OKPO_SENDER_NAME":" Нуль Нулевой Нулевич","ID":1332626420,"LAST_MODIFY_TIME":"2024-10-14 21:27:58","DOC_NAME":"04060031435622J1201015100000000911020240406.XML","IS_EDITED":false,"NEED_TO_EDIT":false,"IS_RENDERED_TO_PDF":false,"CREATOR":"USER","ADDITION_STATUS":null,"TAX_RESULT_STATUS":"UNKNOWN","ID_OF_BASE_DOC":null,"DOC_ADDITIONAL_DATA":"{\"vat\": \"83.23\", \"taxData\": {\"R03G11\": \"83.23\", \"R04G11\": \"1272.23\", \"R01G109\": \"1189.00\", \"R03G109\": \"83.23\"}, \"tinSender\": \"31435622\", \"tinRecipient\": \"100000000000\"}","TIN_SENDER":"31435622","TIN_RECIPIENT":"100000000000","VAT":"83.23","UNREAD_SENDER":0,"UNREAD_RECIPIENT":0,"PAYMENT_REFERENCE":null,"COMMENT":null,"TAGS":null,"TAXES":null,"UNREAD_DISCUSSION_SENDER":0,"UNREAD_DISCUSSION_RECIPIENT":0}
					|],""total"":2,""offset"":0,""limit"":500,""sorted_by"":""DOC_DATE""}";
				ПроверитьСтатусыФинДок("");
				Если ВидимостьUnitТест Тогда
					Если UnitТестУспешно Тогда
						Сообщить(ТекUnitТест + " ОК")
					Иначе
						ВызватьИсключение("")
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.ФинансовыеДокументы.Очистить();
		// тест модульный Заполнение, отправка и проверка статусов актов окончание

	Иначе
		Сообщить("Тест Заполнение, отправка и проверка статусов актов pass")
	КонецЕсли;


	// тест модульный Импорт и запись акты/заказы/расходныеНакладные/счета начало
	ЕстьОшибки = Ложь;
	Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-09-02 01:33:13"",""DOC_DATE"":""2024-07-24"",
		|""RECEIPT_DATE"":""2024-09-02 01:33:13"",""SEND_DATE"":""2024-09-02 01:33:13"",""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,
		|""AMOUNT"":13.27,""STATUS"":12,""STATUS_NAME"":""SIGNED_BY_RECIPIENT"",""OKPO_SENDER"":""88888888"",""OKPO_RECIPIENT"":""99999999"",
		|""DOC_NUMBER"":""61735811"",""ORIGINAL_DOC_NAME"":""invoice.xml"",""DOC_TYPE"":2655,""OKPO_RECIPIENT_NAME"":""Тест тест"",
		|""OKPO_SENDER_NAME"":""ТОВ"",""ID"":1332304700,""LAST_MODIFY_TIME"":""2024-09-02 01:33:13"",
		|""DOC_NAME"":""invoice.xml"",""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",
		|""ADDITION_STATUS"":""PAYMENT_WAS_DELETED"",""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,
		|""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""2.21\"", \""tinRecipient\"": \""3143562222\""}"",""TIN_SENDER"":null,
		|""TIN_RECIPIENT"":""3143562222"",""VAT"":""2.21"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,
		|""PAYMENT_REFERENCE"":""1123976950679863048"",""COMMENT"":null,""TAGS"":""[\""Арбуз\""]"",""TAXES"":null,
		|""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}],
		|""total"":1,""offset"":0,""limit"":500,
		|""sorted_by"":""LAST_MODIFY_TIME""}";
	Объект.ПолеВводаТест2 = "<?xml version=""1.0"" encoding=""windows-1251""?><DECLAR xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
		|xsi:noNamespaceSchemaLocation=""F1201015.xsd""><DECLARHEAD><TIN>8888888881</TIN>
		|<C_DOC>F12</C_DOC>
		|<C_DOC_SUB>010</C_DOC_SUB>
		|<C_DOC_VER>15</C_DOC_VER>
		|<C_DOC_TYPE>0</C_DOC_TYPE>
		|<C_DOC_CNT>1</C_DOC_CNT>
		|<C_REG>1</C_REG>
		|<C_RAJ>02</C_RAJ>
		|<PERIOD_MONTH>01</PERIOD_MONTH>
		|<PERIOD_TYPE>1</PERIOD_TYPE>
		|<PERIOD_YEAR>2024</PERIOD_YEAR>
		|<C_STI_ORIG>102</C_STI_ORIG>
		|<C_DOC_STAN>1</C_DOC_STAN>
		|<D_FILL>09012024</D_FILL>
		|</DECLARHEAD>
		|<DECLARBODY><HFILL>09012024</HFILL>
		|<HNUM>1</HNUM>
		|<HNAMESEL>ФОП Тестувальний Тарас Петрович</HNAMESEL>
		|<HNAMEBUY>Тест тест</HNAMEBUY>
		|<HKSEL>8888888881</HKSEL>
		|<HTINSEL>8888888881</HTINSEL>
		|<HKBUY>31435622</HKBUY>
		|<HTINBUY>31435622</HTINBUY>
		|<R04G11>5.76</R04G11>
		|<R03G11>0.96</R03G11>
		|<R03G7>0.96</R03G7>
		|<R01G7>4.80</R01G7>
		|<RXXXXG3S ROWNUM=""1"">Тест Аня</RXXXXG3S>
		|<RXXXXG4S ROWNUM=""1"">шт</RXXXXG4S>
		|<RXXXXG105_2S ROWNUM=""1"">2009</RXXXXG105_2S>
		|<RXXXXG5 ROWNUM=""1"">8</RXXXXG5>
		|<RXXXXG6 ROWNUM=""1"">0.6</RXXXXG6>
		|<RXXXXG008 ROWNUM=""1"">20</RXXXXG008>
		|<RXXXXG010 ROWNUM=""1"">4.80</RXXXXG010>
		|<RXXXXG11_10 ROWNUM=""1"">0.960</RXXXXG11_10>
		|<HBOS>Черненко Анна Олександрівна</HBOS>
		|<HKBOS>1234567890</HKBOS>
		|</DECLARBODY>
		|</DECLAR>";
	КонПериода = КонецДня(ТекущаяДата());
	Для ii = 1 По 4 Цикл
		Если ii = 1 Тогда
			ВидФинДок = "Акты"
		ИначеЕсли ii = 2 Тогда
			ВидФинДок = "Заказы"
		ИначеЕсли ii = 3 Тогда
			ВидФинДок = "Расходные"
		ИначеЕсли ii = 4 Тогда
			ВидФинДок = "Счета"
		КонецЕсли;
		ТекUnitТест = "Тест Импорт и запись " + ВидФинДок;
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			УстановитьТекВидОперации(ВидФинДок);
			Если Ложь Тогда
				Если ВидимостьUnitТест Тогда
					Сообщить(ТекUnitТест + " pass")
				КонецЕсли
			Иначе
				Интервал = 5;
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗагрузитьФинДок("");
				Для каждого ДокАкты Из Объект.ФинансовыеДокументы Цикл
					ДокАкты.Флажок = Истина;
					Прервать
				КонецЦикла;
				ЗаписатьВходящиеФинДок("");
				Если ВидимостьUnitТест Тогда
					Если UnitТестУспешно Тогда
						Сообщить(ТекUnitТест + " ОК")
					Иначе
						ВызватьИсключение("")
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.ФинансовыеДокументы.Очистить()
	КонецЦикла;
	// тест модульный Импорт и запись акты/заказы/расходныеНакладные/счета окончание


	Если Найти("BP,BASC,UABY", Объект.ИдКонф) = 0 Тогда

		// тест модульный Заполнение, отправка и проверка статусов заказов начало
		ТекUnitТест = "Тест Заполнение, отправка и проверка статусов заказов";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			УстановитьТекВидОперации("Заказы");
			Если Ложь Тогда
				Если ВидимостьUnitТест Тогда
					Сообщить(ТекUnitТест + " pass")
				КонецЕсли
			Иначе
				Для Интервал = 1 По 5 Цикл
					ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
					ЗаполнитьСписокФинДок("");
					Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
						Прервать
					КонецЕсли
				КонецЦикла;
				// отметить первый
				Для каждого ДокЗаказ Из Объект.ФинансовыеДокументы Цикл
					ДокЗаказ.Флажок = Истина;
					Прервать
				КонецЦикла;
				ОтправитьФинДок("");
				// проверка статусов
				// отметить первый
				Для каждого ДокАкт Из Объект.ФинансовыеДокументы Цикл
					ДокАкт.Флажок = Истина;
					Прервать
				КонецЦикла;
				Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-10-14 21:28:10"",""DOC_DATE"":""2024-10-14"",
					|""RECEIPT_DATE"":null,""SEND_DATE"":null,""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,""AMOUNT"":-1189.00,""STATUS"":3,
					|""STATUS_NAME"":""READY_TO_WORK"",""OKPO_SENDER"":""31435622"",""OKPO_RECIPIENT"":""10000001"",""DOC_NUMBER"":""10"",
					|""ORIGINAL_DOC_NAME"":""04060031435622J1201215100000001011020240406.xml"",""DOC_TYPE"":2658,
					|""OKPO_RECIPIENT_NAME"":""Неплатник"",""OKPO_SENDER_NAME"":"" Нуль Нулевой Нулевич"",""ID"":1332626421,
					|""LAST_MODIFY_TIME"":""2024-10-14 21:28:10"",""DOC_NAME"":""04060031435622J1201215100000001011020240406.XML"",
					|""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",""ADDITION_STATUS"":null,
					|""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""-83.23\"",
					|\""taxData\"": {\""R001G03\"": \""-83.23\"", \""R01G111\"": \""-1189.00\"", \""R02G111\"": \""-83.23\""},
					|\""tinSender\"": \""31435622\"", \""tinRecipient\"": \""100000000000\""}"",""TIN_SENDER"":""31435622"",
					|""TIN_RECIPIENT"":""100000000000"",""VAT"":""-83.23"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,""PAYMENT_REFERENCE"":null,
					|""COMMENT"":null,""TAGS"":null,""TAXES"":null,""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}
					//,{"idStr":null,"CREATE_DATE":"2024-10-14 21:27:58","DOC_DATE":"2024-10-14","RECEIPT_DATE":null,"SEND_DATE":null,
					//"TAX_HDATETIME":null,"TAX_HNUMREG":null,"AMOUNT":1272.23,"STATUS":3,"STATUS_NAME":"READY_TO_WORK","OKPO_SENDER":"31435622","OKPO_RECIPIENT":"10000001","DOC_NUMBER":"9","ORIGINAL_DOC_NAME":"04060031435622J1201015100000000911020240406.xml","DOC_TYPE":2653,"OKPO_RECIPIENT_NAME":"Неплатник","OKPO_SENDER_NAME":" Нуль Нулевой Нулевич","ID":1332626420,"LAST_MODIFY_TIME":"2024-10-14 21:27:58","DOC_NAME":"04060031435622J1201015100000000911020240406.XML","IS_EDITED":false,"NEED_TO_EDIT":false,"IS_RENDERED_TO_PDF":false,"CREATOR":"USER","ADDITION_STATUS":null,"TAX_RESULT_STATUS":"UNKNOWN","ID_OF_BASE_DOC":null,"DOC_ADDITIONAL_DATA":"{\"vat\": \"83.23\", \"taxData\": {\"R03G11\": \"83.23\", \"R04G11\": \"1272.23\", \"R01G109\": \"1189.00\", \"R03G109\": \"83.23\"}, \"tinSender\": \"31435622\", \"tinRecipient\": \"100000000000\"}","TIN_SENDER":"31435622","TIN_RECIPIENT":"100000000000","VAT":"83.23","UNREAD_SENDER":0,"UNREAD_RECIPIENT":0,"PAYMENT_REFERENCE":null,"COMMENT":null,"TAGS":null,"TAXES":null,"UNREAD_DISCUSSION_SENDER":0,"UNREAD_DISCUSSION_RECIPIENT":0}
					|],""total"":2,""offset"":0,""limit"":500,""sorted_by"":""DOC_DATE""}";
				ПроверитьСтатусыФинДок("");
				Если ВидимостьUnitТест Тогда
					Если UnitТестУспешно Тогда
						Сообщить(ТекUnitТест + " ОК")
					Иначе
						ВызватьИсключение("")
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.ФинансовыеДокументы.Очистить();
		// тест модульный Заполнение, отправка и проверка статусов заказов окончание

	Иначе
		Сообщить("Тест Заполнение, отправка и проверка статусов заказов pass")
	КонецЕсли;


	// тест модульный Заполнение, отправка и проверка статусов расходных накладных начало
	ТекUnitТест = "Тест Заполнение, отправка и проверка статусов расходных накладных";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
		УстановитьТекВидОперации("Расходные");
		Если Ложь Тогда
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " pass")
			КонецЕсли
		Иначе
			Для Интервал = 1 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗаполнитьСписокФинДок("");
				Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			// отметить первый
			Для каждого ДокРН Из Объект.ФинансовыеДокументы Цикл
				ДокРН.Флажок = Истина;
				Прервать
			КонецЦикла;
			ОтправитьФинДок("");
			// проверка статусов
			// отметить первый
			Для каждого ДокАкт Из Объект.ФинансовыеДокументы Цикл
				ДокАкт.Флажок = Истина;
				Прервать
			КонецЦикла;
			Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-10-14 21:28:10"",""DOC_DATE"":""2024-10-14"",
				|""RECEIPT_DATE"":null,""SEND_DATE"":null,""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,""AMOUNT"":-1189.00,""STATUS"":3,
				|""STATUS_NAME"":""READY_TO_WORK"",""OKPO_SENDER"":""31435622"",""OKPO_RECIPIENT"":""10000001"",""DOC_NUMBER"":""10"",
				|""ORIGINAL_DOC_NAME"":""04060031435622J1201215100000001011020240406.xml"",""DOC_TYPE"":2658,
				|""OKPO_RECIPIENT_NAME"":""Неплатник"",""OKPO_SENDER_NAME"":"" Нуль Нулевой Нулевич"",""ID"":1332626421,
				|""LAST_MODIFY_TIME"":""2024-10-14 21:28:10"",""DOC_NAME"":""04060031435622J1201215100000001011020240406.XML"",
				|""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",""ADDITION_STATUS"":null,
				|""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""-83.23\"",
				|\""taxData\"": {\""R001G03\"": \""-83.23\"", \""R01G111\"": \""-1189.00\"", \""R02G111\"": \""-83.23\""},
				|\""tinSender\"": \""31435622\"", \""tinRecipient\"": \""100000000000\""}"",""TIN_SENDER"":""31435622"",
				|""TIN_RECIPIENT"":""100000000000"",""VAT"":""-83.23"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,""PAYMENT_REFERENCE"":null,
				|""COMMENT"":null,""TAGS"":null,""TAXES"":null,""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}
				//,{"idStr":null,"CREATE_DATE":"2024-10-14 21:27:58","DOC_DATE":"2024-10-14","RECEIPT_DATE":null,"SEND_DATE":null,
				//"TAX_HDATETIME":null,"TAX_HNUMREG":null,"AMOUNT":1272.23,"STATUS":3,"STATUS_NAME":"READY_TO_WORK","OKPO_SENDER":"31435622","OKPO_RECIPIENT":"10000001","DOC_NUMBER":"9","ORIGINAL_DOC_NAME":"04060031435622J1201015100000000911020240406.xml","DOC_TYPE":2653,"OKPO_RECIPIENT_NAME":"Неплатник","OKPO_SENDER_NAME":" Нуль Нулевой Нулевич","ID":1332626420,"LAST_MODIFY_TIME":"2024-10-14 21:27:58","DOC_NAME":"04060031435622J1201015100000000911020240406.XML","IS_EDITED":false,"NEED_TO_EDIT":false,"IS_RENDERED_TO_PDF":false,"CREATOR":"USER","ADDITION_STATUS":null,"TAX_RESULT_STATUS":"UNKNOWN","ID_OF_BASE_DOC":null,"DOC_ADDITIONAL_DATA":"{\"vat\": \"83.23\", \"taxData\": {\"R03G11\": \"83.23\", \"R04G11\": \"1272.23\", \"R01G109\": \"1189.00\", \"R03G109\": \"83.23\"}, \"tinSender\": \"31435622\", \"tinRecipient\": \"100000000000\"}","TIN_SENDER":"31435622","TIN_RECIPIENT":"100000000000","VAT":"83.23","UNREAD_SENDER":0,"UNREAD_RECIPIENT":0,"PAYMENT_REFERENCE":null,"COMMENT":null,"TAGS":null,"TAXES":null,"UNREAD_DISCUSSION_SENDER":0,"UNREAD_DISCUSSION_RECIPIENT":0}
				|],""total"":2,""offset"":0,""limit"":500,""sorted_by"":""DOC_DATE""}";
			ПроверитьСтатусыФинДок("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ФинансовыеДокументы.Очистить();
	// тест модульный Заполнение, отправка и проверка статусов расходных накладных окончание


	Если Объект.ИдКонф <> "BASR" Тогда

		// тест модульный Заполнение, отправка и проверка статусов счетов начало
		ТекUnitТест = "Тест Заполнени, отправка и проверка статусов Счетов";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			УстановитьТекВидОперации("Счета");
			Если Ложь Тогда
				Если ВидимостьUnitТест Тогда
					Сообщить(ТекUnitТест + " pass")
				КонецЕсли
			Иначе
				Для Интервал = 1 По 5 Цикл
					ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
					ЗаполнитьСписокФинДок("");
					Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
						Прервать
					КонецЕсли
				КонецЦикла;
				// отметить первый
				Для каждого ДокСчет Из Объект.ФинансовыеДокументы Цикл
					ДокСчет.Флажок = Истина;
					Прервать
				КонецЦикла;
				ОтправитьФинДок("");
				// проверка статусов
				// отметить первый
				Для каждого ДокАкт Из Объект.ФинансовыеДокументы Цикл
					ДокАкт.Флажок = Истина;
					Прервать
				КонецЦикла;
				Объект.ПолеВводаТест1 = "{""documents"":[{""idStr"":null,""CREATE_DATE"":""2024-10-14 21:28:10"",""DOC_DATE"":""2024-10-14"",
					|""RECEIPT_DATE"":null,""SEND_DATE"":null,""TAX_HDATETIME"":null,""TAX_HNUMREG"":null,""AMOUNT"":-1189.00,""STATUS"":3,
					|""STATUS_NAME"":""READY_TO_WORK"",""OKPO_SENDER"":""31435622"",""OKPO_RECIPIENT"":""10000001"",""DOC_NUMBER"":""10"",
					|""ORIGINAL_DOC_NAME"":""04060031435622J1201215100000001011020240406.xml"",""DOC_TYPE"":2658,
					|""OKPO_RECIPIENT_NAME"":""Неплатник"",""OKPO_SENDER_NAME"":"" Нуль Нулевой Нулевич"",""ID"":1332626421,
					|""LAST_MODIFY_TIME"":""2024-10-14 21:28:10"",""DOC_NAME"":""04060031435622J1201215100000001011020240406.XML"",
					|""IS_EDITED"":false,""NEED_TO_EDIT"":false,""IS_RENDERED_TO_PDF"":false,""CREATOR"":""USER"",""ADDITION_STATUS"":null,
					|""TAX_RESULT_STATUS"":""UNKNOWN"",""ID_OF_BASE_DOC"":null,""DOC_ADDITIONAL_DATA"":""{\""vat\"": \""-83.23\"",
					|\""taxData\"": {\""R001G03\"": \""-83.23\"", \""R01G111\"": \""-1189.00\"", \""R02G111\"": \""-83.23\""},
					|\""tinSender\"": \""31435622\"", \""tinRecipient\"": \""100000000000\""}"",""TIN_SENDER"":""31435622"",
					|""TIN_RECIPIENT"":""100000000000"",""VAT"":""-83.23"",""UNREAD_SENDER"":0,""UNREAD_RECIPIENT"":0,""PAYMENT_REFERENCE"":null,
					|""COMMENT"":null,""TAGS"":null,""TAXES"":null,""UNREAD_DISCUSSION_SENDER"":0,""UNREAD_DISCUSSION_RECIPIENT"":0}
					//,{"idStr":null,"CREATE_DATE":"2024-10-14 21:27:58","DOC_DATE":"2024-10-14","RECEIPT_DATE":null,"SEND_DATE":null,
					//"TAX_HDATETIME":null,"TAX_HNUMREG":null,"AMOUNT":1272.23,"STATUS":3,"STATUS_NAME":"READY_TO_WORK","OKPO_SENDER":"31435622","OKPO_RECIPIENT":"10000001","DOC_NUMBER":"9","ORIGINAL_DOC_NAME":"04060031435622J1201015100000000911020240406.xml","DOC_TYPE":2653,"OKPO_RECIPIENT_NAME":"Неплатник","OKPO_SENDER_NAME":" Нуль Нулевой Нулевич","ID":1332626420,"LAST_MODIFY_TIME":"2024-10-14 21:27:58","DOC_NAME":"04060031435622J1201015100000000911020240406.XML","IS_EDITED":false,"NEED_TO_EDIT":false,"IS_RENDERED_TO_PDF":false,"CREATOR":"USER","ADDITION_STATUS":null,"TAX_RESULT_STATUS":"UNKNOWN","ID_OF_BASE_DOC":null,"DOC_ADDITIONAL_DATA":"{\"vat\": \"83.23\", \"taxData\": {\"R03G11\": \"83.23\", \"R04G11\": \"1272.23\", \"R01G109\": \"1189.00\", \"R03G109\": \"83.23\"}, \"tinSender\": \"31435622\", \"tinRecipient\": \"100000000000\"}","TIN_SENDER":"31435622","TIN_RECIPIENT":"100000000000","VAT":"83.23","UNREAD_SENDER":0,"UNREAD_RECIPIENT":0,"PAYMENT_REFERENCE":null,"COMMENT":null,"TAGS":null,"TAXES":null,"UNREAD_DISCUSSION_SENDER":0,"UNREAD_DISCUSSION_RECIPIENT":0}
					|],""total"":2,""offset"":0,""limit"":500,""sorted_by"":""DOC_DATE""}";
				ПроверитьСтатусыФинДок("");
				Если ВидимостьUnitТест Тогда
					Если UnitТестУспешно Тогда
						Сообщить(ТекUnitТест + " ОК")
					Иначе
						ВызватьИсключение("")
					КонецЕсли
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.ФинансовыеДокументы.Очистить();
		// тест модульный Заполнение, отправка и проверка статусов счетов окончание

	Иначе
		Сообщить("Тест Заполнение, отправка и проверка статусов счетов pass")
	КонецЕсли;


	//------------------------ PDF док --------------------------------

	// тест модульный Заполнение, отправка и проверка статусов PDF документов начало
	ТекUnitТест = "Тест Заполнение, отправка и проверка статусов PDF документов";
	вВидДокументаPDF = ВидДокументаPDF;
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
		Для каждого КонкретныйВидДокументаPDF Из Элементы.ВидДокументаPDF.СписокВыбора Цикл
			ВидДокументаPDF = КонкретныйВидДокументаPDF.Значение;
			Если Найти(КонкретныйВидДокументаPDF.Значение, "ВсеВиды") > 0 Тогда
				Продолжить
			КонецЕсли;
			Для Интервал = 1 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗаполнитьСписокPDF("");
				Если Объект.СписокЭкспортаPDF.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			ЗаполнитьСписокПечатныхФорм();
			Если Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Количество() = 0 Тогда
				Продолжить
			КонецЕсли;
			ИмяПечатнойФормыПредставление = Элементы.ИмяПечатнойФормыPDF.СписокВыбора[0].Представление;
			i = 0;
			Пока Лев(ИмяПечатнойФормы, 8) = "Комплект" Или Лев(ИмяПечатнойФормыПредставление, 8) = "Комплект"
					Или Лев(ИмяПечатнойФормы, 13) = "Настраиваемый" Или Лев(ИмяПечатнойФормыПредставление, 13) = "Настраиваемый"
					Или Лев(ИмяПечатнойФормы, 6) = "Налашт" Или Лев(ИмяПечатнойФормыПредставление, 6) = "Налашт" Цикл
				i = i + 1;
				ИмяПечатнойФормы = Элементы.ИмяПечатнойФормыPDF.СписокВыбора[i].Значение;
				ИмяПечатнойФормыПредставление = Элементы.ИмяПечатнойФормыPDF.СписокВыбора[i].Представление
			КонецЦикла;
			Если Не ЗначениеЗаполнено(ИмяПечатнойФормы) Тогда
				Продолжить
			КонецЕсли;
			// отметить первый
			Для каждого ДокPDF Из Объект.СписокЭкспортаPDF Цикл
				ДокPDF.Флажок = Истина;
				Прервать
			КонецЦикла;
			ОтправитьPDFДок("");
			// проверка статусов
			// отметить первый
			Для каждого ДокАкт Из Объект.СписокЭкспортаPDF Цикл
				ДокАкт.Флажок = Истина;
				Прервать
			КонецЦикла;
			ПроверитьСтатусыФинДокPDF("");
			Сообщить(КонкретныйВидДокументаPDF.Значение)
		КонецЦикла;
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.СписокЭкспортаPDF.Очистить();
	ВидДокументаPDF = вВидДокументаPDF;
	ВидДокументаPDFПриИзменении("");
	// тест модульный Заполнение, отправка и проверка статусов PDF документов окончание


	//------------------------ PaperLess --------------------------------

	// тест модульный Авторизация PaperLess начало
	ТекUnitТест = "Тест Авторизация PaperLess";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		АвторизацияПапка24("");
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	// тест модульный Авторизация PaperLess окончание


	// тест модульный Заполнение и отправка документов PaperLess начало
	ТекUnitТест = "Тест Заполнение и отправка документов PaperLess";
	вВидДокументаPDF = ВидДокументаPDF;
	вОбъектПодписыватьPDF = Объект.ПодписыватьPDF;
	Объект.ПодписыватьPDF = Ложь;
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
		Для каждого КонкретныйВидДокументаPDF Из Элементы.ВидДокументаPDF.СписокВыбора Цикл
			ВидДокументаPDF = КонкретныйВидДокументаPDF.Значение;
			Если Найти(КонкретныйВидДокументаPDF.Значение, "ВсеВиды") > 0 Тогда
				Продолжить
			КонецЕсли;
			Для Интервал = 1 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ЗаполнитьСписокPDF("");
				Если Объект.СписокЭкспортаPDF.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			ЗаполнитьСписокПечатныхФорм();
			Если Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Количество() = 0 Тогда
				Продолжить
			КонецЕсли;
			ИмяПечатнойФормыПредставление = Элементы.ИмяПечатнойФормыPDF.СписокВыбора[0].Представление;
			i = 0;
			Пока Лев(ИмяПечатнойФормы, 8) = "Комплект" Или Лев(ИмяПечатнойФормыПредставление, 8) = "Комплект"
					Или Лев(ИмяПечатнойФормы, 13) = "Настраиваемый" Или Лев(ИмяПечатнойФормыПредставление, 13) = "Настраиваемый"
					Или Лев(ИмяПечатнойФормы, 6) = "Налашт" Или Лев(ИмяПечатнойФормыПредставление, 6) = "Налашт" Цикл
				i = i + 1;
				ИмяПечатнойФормы = Элементы.ИмяПечатнойФормы.СписокВыбора[i].Значение;
				ИмяПечатнойФормыПредставление = Элементы.ИмяПечатнойФормыPDF.СписокВыбора[i].Представление
			КонецЦикла;
			Если Не ЗначениеЗаполнено(ИмяПечатнойФормы) Тогда
				Продолжить
			КонецЕсли;
			// отметить первый
			Для каждого ДокPaperLess Из Объект.СписокЭкспортаPDF Цикл
				ДокPaperLess.Флажок = Истина;
				Прервать
			КонецЦикла;
			ВыгрузитьPDF("");
		    Сообщить(КонкретныйВидДокументаPDF.Значение)
		КонецЦикла;
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.СписокЭкспортаPDF.Очистить();
	Объект.ПодписыватьPDF = вОбъектПодписыватьPDF;
	ВидДокументаPDF = вВидДокументаPDF;
	ВидДокументаPDFПриИзменении("");
	// тест модульный Заполнение и отправка документов PaperLess окончание


	//------------------------ Расшифровки кредита --------------------------------

	// тест модульный Заполнение и отправка расшифровок кредита начало
	ТекUnitТест = "Тест Заполнение и отправка расшифровок кредита";
	Попытка
		UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КаталогВыгрузки", Объект.КаталогВыгрузки);
		ПараметрыФормы.Вставить("ПутьКурл", Объект.ПутьКурл);
		ПараметрыФормы.Вставить("ПоддерживаетсяTLS12", Объект.ПоддерживаетсяTLS12 И Не Объект.ФлажокИспользоватьКурлВсегда);
		ПараметрыФормы.Вставить("АдресДокументооборота", Объект.АдресДокументооборота);
		ПараметрыФормы.Вставить("КодПоЕДРПОУ", Объект.КодПоЕДРПОУ);
		ПараметрыФормы.Вставить("ИспользоватьТокены", Объект.ИспользоватьТокены);
		ПараметрыФормы.Вставить("ТокеныКомпаний", Объект.ТокеныКомпаний);
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("РежимОтладки", Объект.РежимОтладки);
		ПараметрыФормы.Вставить("ФлажокПоказыватьПароль", Объект.ФлажокПоказыватьПароль);
		ПараметрыФормы.Вставить("ОтборПериодДатаОкончания", ТекущаяДата());
		ПараметрыФормы.Вставить("UnitТест", Объект.UnitТест);
		Для Интервал = 1 По 5 Цикл
			ДатаНачалаОтчета = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
			ПараметрыФормы.Вставить("ОтборПериодДатаНачала", ДатаНачалаОтчета);
			Попытка//Если Объект.ОбработкаВнешняя Тогда
				ФормаРК = ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормированиеОтчетовДляКредитования", ПараметрыФормы);
			Исключение
				ФормаРК = ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ФормированиеОтчетовДляКредитования", ПараметрыФормы);
			КонецПопытки;
			ФормаРК.Открыть();
			ФормаРК.Сформировать("");
			Если Объект.ТаблицаПоказателей.Количество() > 0 Или Интервал = 5 Тогда
				Прервать
			КонецЕсли;
			ФормаРК.Закрыть()
		КонецЦикла;
		ФормаРК.ОтправитьОтчет("");
		ФормаРК.СохранитьОтчет("");
		Попытка
			ФормаРК.Закрыть()
		Исключение КонецПопытки;
		Если ВидимостьUnitТест Тогда
			Если UnitТестУспешно Тогда
				Сообщить(ТекUnitТест + " ОК")
			Иначе
				ВызватьИсключение("")
			КонецЕсли
		КонецЕсли
	Исключение
		Если ВидимостьUnitТест Тогда
			Сообщить(ТекUnitТест + " False");
			ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
			ЕстьFalse = Истина
		КонецЕсли
	КонецПопытки;
	Объект.ТаблицаПоказателей.Очистить();
	// тест модульный Заполнение и отправка расшифровок кредита окончание


	//------------------------ Курсы валют --------------------------------

	Если Объект.ИдКонф <> "BASR" Тогда

		// тест модульный Курсы валют безнал начало
		ТекUnitТест = "Тест Курсы валют безнал";
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ТекДатаПоКурсыВалют = КонецДня(ТекущаяДата());
			ТекДатаКурсыВалют = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
			ПрочитатьКурсВалют("");
			ЗаписатьКурсыВалют("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.КурсыВалют.Очистить();
		// тест модульный Курсы валют безнал окончание

	Иначе
		Сообщить("Тест Курсы валют безнал pass")
	КонецЕсли;


	Если Найти("BASR,AAA,OSMD,UNF", Объект.ИдКонф) = 0 Тогда
		

		// тест модульный Отправка ЭО начало
		ТекUnitТест = "Тест Отправка ЭО";
		вНачПериода = ОтборПериод.ДатаНачала;
		вКонПериода = ОтборПериод.ДатаОкончания;
		Попытка
			UnitТестУспешно = Истина;//вдальнейшем получать из процедуры
			ОтборПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			Для Интервал = 1 По 5 Цикл
				ОтборПериод.ДатаНачала = ПолучитьИнтервалДат(ТекущаяДата(), Интервал);
				ДействиеАналитики = "ЗаполнениеСпискаРеглОтчетов";
				ЗаполнитьСписокОтчетовНаСервере();
				Если Объект.РеглОтчеты.Количество() > 0 Тогда
					Прервать
				КонецЕсли
			КонецЦикла;
			// отметить первый
			Для каждого ДокОтчет Из Объект.РеглОтчеты Цикл
				ДокОтчет.Флажок = Истина;
				Прервать
			КонецЦикла;
			ОтправитьОтчеты("");
			Если ВидимостьUnitТест Тогда
				Если UnitТестУспешно Тогда
					Сообщить(ТекUnitТест + " ОК")
				Иначе
					ВызватьИсключение("")
				КонецЕсли
			КонецЕсли
		Исключение
			Если ВидимостьUnitТест Тогда
				Сообщить(ТекUnitТест + " False");
				ПереченьFalse = ПереченьFalse + ?(ЗначениеЗаполнено(ПереченьFalse), Символы.ПС, "") + ТекUnitТест;
				ЕстьFalse = Истина
			КонецЕсли
		КонецПопытки;
		Объект.СписокДокументов.Очистить();
		ОтборПериод.ДатаНачала = вНачПериода;
		ОтборПериод.ДатаОкончания = вКонПериода;
		// тест модульный Отправка ЭО окончание


	КонецЕсли;


	УстановитьТекВидОперации(времВидФинДок);
	ОтборПериод.ДатаНачала = вОтборПериодДатаНачала;
	ОтборПериод.ДатаОкончания = вОтборПериодДатаОкончания;
	Объект.ОстатокНаСчетеВПБ = "";
	Объект.ОстатокНаСчетеВ1С = "";
	Объект.ДельтаОстатка = "";

	ПодключитьОбработчикОжидания("ОжиданиеОкончанияUnitТеста", 0.1, Истина)

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьКолонкуФлажокНалоговыеНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьКолонкуФлажокНалоговые();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеОкончанияUnitТеста()

	ОтключитьОбработчикОжидания("ОжиданиеОкончанияUnitТеста");

	ИндексЦикла = 0;
	Пока Не UnitТестПодписиSmartIDОК И ИндексЦикла < 1000 Цикл
		ИндексЦикла = ИндексЦикла + 1
	КонецЦикла;

	Если ЕстьFalse Тогда
		Сообщить("Есть ошибка(и) модульных unit-тестов False:" + Символы.ПС + ПереченьFalse)
	Иначе
		Сообщить("Все модульные UNIT-тесты ОК")
	КонецЕсли;

	Объект.UnitТест = Ложь;
	ЕстьОшибки = Ложь;
	Если ВидимостьUnitТест Тогда
		ВремяОкончанияТеста = ТекущаяДата();
		Сообщить(Строка(ВремяОкончанияТеста) + " Окончание Unit-тестирования. Время выполнения " + Строка(ВремяОкончанияТеста - ВремяНачалаТеста)
			+ " секунд.")
	КонецЕсли;

	Объект.typeЧП = "";
	ВидимостьUnitТест = Ложь

КонецПроцедуры

&НаСервере
Функция ВыбратьПервогоСотрудникаНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыбратьПервогоСотрудника();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецФункции

&НаСервере
Процедура ТабДокВедомостьЗПОчистить()

	ТабДокВедомостьЗП.Очистить()
	
КонецПроцедуры

&НаСервере
Процедура ТабДокВыпискаОчистить()

	ТабДокВыписка.Очистить()
	
КонецПроцедуры

&НаСервере
Процедура ТабличноеПолеКорпКартыОчистить()

	Объект.ТабличноеПолеКорпКарты.Очистить()
	
КонецПроцедуры

&НаСервере
Процедура ТабличноеПолеВыпискаОчистить()

	Объект.ТабличноеПолеВыписка.Очистить()
	
КонецПроцедуры

&НаСервере
Процедура ТабличноеПолеОтчетОчистить()

	Объект.ТабличноеПолеОтчет.Очистить()
	
КонецПроцедуры

//Процедура на время перехода с раздельных на единый ИдТокен
//&НаСервере
//Процедура ПеренестиИдАКВТокен()
//
//	Для каждого СтрокаТЗ Из Объект.ТокеныКомпаний Цикл
//		Если ЗначениеЗаполнено(СтрокаТЗ.ИдАвтоклиента) Тогда
//			СтрокаТЗ.ТокенАвтоклиента = СтрокаТЗ.ТокенАвтоклиента + СтрокаТЗ.ИдАвтоклиента;
//			СтрокаТЗ.ИдАвтоклиента = ""
//		КонецЕсли
//	КонецЦикла
//
//КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗаполнитьПредприятияАКСервер()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПрочитатьЗаполнитьПредприятияАК();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры	//	ПрочитатьЗаполнитьПредприятияАК()

&НаКлиенте
Процедура ТокеныКомпанийПередУдалением(Элемент, Отказ)

	ТекущаяСтрока = Элементы.ТокеныКомпаний.ТекущиеДанные;
	Попытка
		ОКПО = ТекущаяСтрока.КодКомпании;
		ИндексСтроки = ТекущаяСтрока.НомерСтроки - 1;
		Объект.ТокеныКомпаний.Удалить(ИндексСтроки);
		Элементы.ТокеныКомпаний.Обновить();
		УдалитьФайлыMopСервер(ОКПО);//УдалитьФайлы(appdata + "\mop24", СокрЛП(ОКПО) + ".dat")
		ОбновитьОтображениеСтатуса(ОпределитьСостояниеАвторизовано())
	Исключение
	КонецПопытки

КонецПроцедуры

&НаСервере
Процедура УдалитьФайлыMopСервер(ОКПО)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УдалитьФайлыMop(ОКПО);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаСервере
Функция НайтиОрганизациюНаСервере(КодКомпании, ЕслиНеНайденаБеремИзНастроекМодуля)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	НайденнаяОрганизация = ОбработкаОбъект.НайтиОрганизацию(КодКомпании, ЕслиНеНайденаБеремИзНастроекМодуля);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

	Возврат НайденнаяОрганизация

КонецФункции

&НаКлиенте
Процедура ТокеныКомпанийКодКомпанииПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТокеныКомпаний.ТекущиеДанные;
	ЗначениеКолонкаId = ТекущаяСтрока.ИдАвтоклиента;
	ЗначениеКолонкаОКПО = ТекущаяСтрока.КодКомпании;
	ЗначениеКолонкаToken = ТекущаяСтрока.ТокенАвтоклиента;

	ТекущаяСтрока.Организация = НайтиОрганизациюНаСервере(ТекущаяСтрока.КодКомпании, Ложь);//Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ", ТекущаяСтрока.КодКомпании);
	ОбновитьОтображениеСтатуса(ОпределитьСостояниеАвторизовано());

	Если ЗначениеЗаполнено(ЗначениеКолонкаОКПО) И ЗначениеЗаполнено(ЗначениеКолонкаToken) Тогда
		ЗаписатьВMOP(ЗначениеКолонкаОКПО, ЗначениеКолонкаId, ЗначениеКолонкаToken)
	КонецЕсли;

	ПроверкаТабличноеПолеБыстраяАвторизация(Истина)

КонецПроцедуры

&НаСервере
Процедура ПроверкаТабличноеПолеБыстраяАвторизация(ВыводитьСообщения)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПроверкаТабличноеПолеБыстраяАвторизация(ВыводитьСообщения);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ТокеныКомпанийИдАвтоклиентаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТокеныКомпаний.ТекущиеДанные;
	ЗначениеКолонкаId = ТекущаяСтрока.ИдАвтоклиента;
	ЗначениеКолонкаОКПО = ТекущаяСтрока.КодКомпании;
	ЗначениеКолонкаToken = ТекущаяСтрока.ТокенАвтоклиента;

	Если ЗначениеЗаполнено(ЗначениеКолонкаОКПО) И ЗначениеЗаполнено(ЗначениеКолонкаId) И ЗначениеЗаполнено(ЗначениеКолонкаToken) Тогда
		ЗаписатьВMOP(ЗначениеКолонкаОКПО, ЗначениеКолонкаId, ЗначениеКолонкаToken)
	КонецЕсли;

	ПроверкаТабличноеПолеБыстраяАвторизация(Истина)

КонецПроцедуры

&НаКлиенте
Процедура ТокеныКомпанийТокенАвтоклиентаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТокеныКомпаний.ТекущиеДанные;
	ЗначениеКолонкаId = ТекущаяСтрока.ИдАвтоклиента;
	ЗначениеКолонкаОКПО = ТекущаяСтрока.КодКомпании;
	ЗначениеКолонкаToken = ТекущаяСтрока.ТокенАвтоклиента;

	Если ЗначениеЗаполнено(ЗначениеКолонкаОКПО) И ЗначениеЗаполнено(ЗначениеКолонкаToken) Тогда
		ЗаписатьВMOP(ЗначениеКолонкаОКПО, ЗначениеКолонкаId, ЗначениеКолонкаToken)
	КонецЕсли;

	ПроверкаТабличноеПолеБыстраяАвторизация(Истина)

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВMOP(ОКПО, Id, Token)

	Если Не Объект.ЭтоВебКлиент И Не Объект.РаботаВМоделиСервисаПБ Тогда
		ЗаписатьIdTokenВMOPСервер(ОКПО, Id, Token)
	Иначе
		СтруктураНастроек = ПодготовитьНастройкиФормыДляСохранения();
		СохранитьНастройкиФормы(СтруктураНастроек)
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ЗаписатьIdTokenВMOPСервер(ОКПО, Id, Token)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаписатьIdTokenВMOP(ОКПО, Id, Token);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

// не используется
&НаСервере
Процедура ПрочитатьНовостиBO()
	
	//ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	//НовостиБО = ОбработкаОбьект.ПрочитатьНовостиBO();	
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОтправитьСтатистикуОткрытия()

	ОтправитьСтатистку("Открытие", "Открытие", , Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСтатистикуРаботы()
	
	Если Объект.СтатистикаРаботы.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ОтправитьСтатистку("", "", , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоУмолчанию()
	
	Попытка
		Если Найти("BP,BASC,UT_3,BASR,KUBU,ERP,OSMD,UABY", Объект.ИдКонф) > 0 Тогда 
			Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		Иначе
			//	BSB, AAA, ...
			Объект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли;		
	Исключение
		ТекстОшибки = НСтр("ru='Не удалось заполнить ставку НДС по умолчанию. Заполните ставку вручную! ';uk='Не вдалося заповнити ставку ПДВ за замовчуванням. Заповніть ставку вручну! '"); 
		СообщениеПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция РаботаСКонфигурациейПоддерживается()
	
	Возврат НЕ СтрДлина(Объект.ИдКонф) > 4;		
	
КонецФункции

// Процедура - заполняет списки выбора расположенные на форме
//
&НаКлиенте
Процедура ЗаполнитьСпискиВыбора() 
	
	Элементы.ОтборПоЖурналу.СписокВыбора.Очистить();
	Элементы.ОтборПоЖурналу.СписокВыбора.Добавить("К выгрузке", НСтр("ru='Требуют отправки';uk='Потребують відправки'"),,БиблиотекаКартинок.Документ);
	Элементы.ОтборПоЖурналу.СписокВыбора.Добавить("Выгруженные", НСтр("ru='Выгруженные';uk='Вивантажені'"),,БиблиотекаКартинок.СинтаксическийКонтроль);
	Элементы.ОтборПоЖурналу.СписокВыбора.Добавить("Все документы", НСтр("ru='Все документы';uk='Всі документи'"),,БиблиотекаКартинок.ЖурналДокументов);
	
	Если НЕ ЗначениеЗаполнено(ОтборПоЖурналу) Тогда
		ОтборПоЖурналу = "К выгрузке";
	КонецЕсли;
	
	Элементы.ОтборПоВидуДок.СписокВыбора.Очистить();
	Элементы.ОтборПоВидуДок.СписокВыбора.Добавить("Все виды документов", НСтр("ru='Все виды документов';uk='Всі види документів'"),,БиблиотекаКартинок.ЖурналДокументов);
	Элементы.ОтборПоВидуДок.СписокВыбора.Добавить("Налоговые накладные", НСтр("ru='Налоговые накладные';uk='Податкові накладні'"),,БиблиотекаКартинок.Документ);
	Элементы.ОтборПоВидуДок.СписокВыбора.Добавить("Приложения 2 к НН", НСтр("ru='Приложения 2 к НН';uk='Додатки 2 до ПН'"),,БиблиотекаКартинок.Документ);
	Элементы.ОтборПоВидуДок.СписокВыбора.Добавить("Запрос к ЕРНН", НСтр("ru='Запрос к ЕРНН';uk='Запит до ЄРПН'"),,БиблиотекаКартинок.Отчет);

	Если НЕ ЗначениеЗаполнено(ОтборПоВидуДок) Тогда
		ОтборПоВидуДок = "Все виды документов";
	КонецЕсли;

	АдресАКб = "acp.privatbank.ua";

	//Если НЕ Объект.РаботаВМоделиСервисаПБ Тогда
		Объект.АдресАК = АдресАКб;
		АдресАКб = Объект.АдресАК;
		ИнициализироватьНачальныеПараметрыАдресовСервер();
		Если Элементы.ИнтернетАдресДляСоединения.СписокВыбора.НайтиПоЗначению(АдресАКб) = Неопределено Тогда
			Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Добавить(АдресАКб)
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ИнтернетАдресДляСоединения) Тогда	
			Объект.ИнтернетАдресДляСоединения = Элементы.ИнтернетАдресДляСоединения.СписокВыбора[0]
		КонецЕсли;
	//Иначе
	//	Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Добавить(".test/p24", ".ua/p24");
	//КонецЕсли;	

	ЗаполнитьСписокВыбораЗП();
	
КонецПроцедуры

&НаСервере
Функция ПеременнаяОкруженияСервер(ПеременнаяP24bCurls)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	P24bCurls = ОбработкаОбьект.ПеременнаяОкружения(ПеременнаяP24bCurls);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	Возврат P24bCurls
	
КонецФункции

&НаКлиенте
Процедура ДобавитьАдресаСерверов()//ПризнакДобавления)//на случай динамической зависимости от РежимОтладки

	Попытка
		//Windows
		Разделитель = ";";
		ПеременнаяP24bCurls = "%P24b1Curls%";
		P24bCurls = ПеременнаяОкруженияСервер(ПеременнаяP24bCurls);
		Если P24bCurls <> ПеременнаяP24bCurls Тогда
			Пока СтрДлина(P24bCurls) > 0 Цикл
				ПозицияРазделителя = Найти(P24bCurls, Разделитель);
				url = Сред(P24bCurls, 1, ПозицияРазделителя - 1);
				НайденнаяСтрока = Элементы.ИнтернетАдресДляСоединения.СписокВыбора.НайтиПоЗначению(url);
				//Если ПризнакДобавления Тогда
					Если Не ЗначениеЗаполнено(НайденнаяСтрока) Тогда
						Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Добавить(url)
				//	КонецЕсли
				//Иначе
				//	Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				//		Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Удалить(НайденнаяСтрока)
					КонецЕсли;
				//	КонецЕсли;
				Если СтрДлина(P24bCurls) > СтрДлина(url) Тогда
					P24bCurls = Сред(P24bCurls, ПозицияРазделителя + 1)
				Иначе
					Прервать
				КонецЕсли
			КонецЦикла
		Иначе
		КонецЕсли
	Исключение
		//Linux /etc/squid/squid.conf
	КонецПопытки;

	Если Не ЗначениеЗаполнено(Объект.ИнтернетАдресДляСоединения) Тогда
		Объект.ИнтернетАдресДляСоединения = Элементы.ИнтернетАдресДляСоединения.СписокВыбора[0]
	КонецЕсли;
	Объект.АдресАК = Объект.ИнтернетАдресДляСоединения

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНачальныеПараметрыАдресовСервер()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ИнициализироватьНачальныеПараметрыАдресов();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтернетАдресДляСоединенияПриИзменении(Элемент)

	Объект.АдресАК = Объект.ИнтернетАдресДляСоединения;
	ИнициализироватьНачальныеПараметрыАдресовСервер();
	ОбновитьЗаголовокФормы()

КонецПроцедуры

&НаКлиенте
Процедура ВидДокНазад(Команда)
	
	СдвинутьСписокЗначНазад(Элементы.ОтборПоВидуДок, ОтборПоВидуДок);
	ЗаполнитьСписокДокументов(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьСписокЗначНазад(СписокЗнч, Реквизит)
	
	ТекЭл = СписокЗнч.Списоквыбора.НайтиПоЗначению(Реквизит);
	Если ТекЭл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекИнд = СписокЗнч.Списоквыбора.Индекс(ТекЭл);
	
	Если ТекИнд - 1 >= 0 Тогда
		НовЭлем = СписокЗнч.Списоквыбора.Получить(ТекИнд - 1);
		Реквизит = НовЭлем.Значение;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьСписокЗначВперед(СписокЗнч, Реквизит)
	
	ТекЭл = СписокЗнч.Списоквыбора.НайтиПоЗначению(Реквизит);
	Если ТекЭл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекИнд = СписокЗнч.Списоквыбора.Индекс(ТекЭл);
	
	Если ТекИнд + 1 <= СписокЗнч.Списоквыбора.Количество() - 1 Тогда
		НовЭлем = СписокЗнч.Списоквыбора.Получить(ТекИнд + 1);
		Реквизит = НовЭлем.Значение;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Объект.ТекущийЗП = Элементы.СписокЗП.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Значение

КонецПроцедуры

&НаКлиенте
Процедура РасчетныеЛисткиСписокЗПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Объект.ТекущийЗПРЛ = Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение)

КонецПроцедуры

&НаКлиенте
Процедура ЖурналНазад(Команда)
	
	СдвинутьСписокЗначНазад(Элементы.ОтборПоЖурналу, ОтборПоЖурналу);
	ЗаполнитьСписокДокументов(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если НЕ (ЗавершениеРаботы = Истина) Тогда
		АвторизацияПапка24(Истина);
	КонецЕсли;

КонецПроцедуры

//не используется
&НаСервере
Функция ЗначениеВСтрокуВнутрСервер(Значение)

	Возврат ЗначениеВСтрокуВнутр(Значение);

КонецФункции	

//begin---------------- Общие процедуры сохранения значений -----------------

&НаСервере
Функция СформироватьСтруктуруСохраняемыхРеквизитов(СтруктураНастроек)
	
	//Все реквизиты которые НЕ нужно сохранять добавлять ниже в отдельную структуру
	СтруктураИсключений = Новый Структура;
	СтруктураИсключений.Вставить("XML");
	СтруктураИсключений.Вставить("ОбработкаВнешняя");
	СтруктураИсключений.Вставить("Авторизовано");
	СтруктураИсключений.Вставить("Сессия");
	СтруктураИсключений.Вставить("ИДПакетаЗачислений");
	СтруктураИсключений.Вставить("СпискоПакЗач");
	СтруктураИсключений.Вставить("ТекВерсия");
	//СтруктураИсключений.Вставить("АвтоматическийОбмен");
	СтруктураИсключений.Вставить("UserAgentHeaders");
	СтруктураИсключений.Вставить("ТекНомСтроки");
	СтруктураИсключений.Вставить("ОстатокНаСчетеВ1С");
	СтруктураИсключений.Вставить("ОстатокНаСчетеВПБ");
	СтруктураИсключений.Вставить("ДельтаОстатка");
	СтруктураИсключений.Вставить("ДокументОприходования");
	//СтруктураИсключений.Вставить("Склад");
	СтруктураИсключений.Вставить("ЦенаПродажи");
	СтруктураИсключений.Вставить("РежимОтладки");
	СтруктураИсключений.Вставить("ПарольПапка24");
	СтруктураИсключений.Вставить("АдресДокументооборота");
	СтруктураИсключений.Вставить("АдресПапка24");
	СтруктураИсключений.Вставить("АдресРасченыхЛистов");
	СтруктураИсключений.Вставить("АдресДляЗП");
	СтруктураИсключений.Вставить("БезПроверкиСертификатаСайта");
	СтруктураИсключений.Вставить("РаботаВМоделиСервисаПБ");
	СтруктураИсключений.Вставить("ПоддерживаетсяTLS12");
	СтруктураИсключений.Вставить("ИдКонф");
	//СтруктураИсключений.Вставить("СтарыйВариантАвторизации");
	СтруктураИсключений.Вставить("ЗаписьЛогаВФайл");
	СтруктураИсключений.Вставить("АдресАК");
	СтруктураИсключений.Вставить("АдресЭО");
	СтруктураИсключений.Вставить("FollowId");
	СтруктураИсключений.Вставить("ИспользоватьТокены");
	СтруктураИсключений.Вставить("ТекущийИДКлиентаГруппыЧП");
	СтруктураИсключений.Вставить("тзНовыйДокФин");
	СтруктураИсключений.Вставить("тзСписокКарт");
	СтруктураИсключений.Вставить("Это1cnik");
	СтруктураИсключений.Вставить("ЭтоWindows");
	СтруктураИсключений.Вставить("ЭтоLinuxСервер");
	СтруктураИсключений.Вставить("ЭтоLinuxКлиент");
	СтруктураИсключений.Вставить("ЭтоMacOS");
	СтруктураИсключений.Вставить("ВыводилосьГС");
	СтруктураИсключений.Вставить("typeЧП");
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого Реквизит Из ОбработкаОбьект.Метаданные().Реквизиты Цикл
		Если СтруктураИсключений.Свойство(Реквизит.Имя) Тогда//если реквизит в списке несохраняемых - идем дальше
			Продолжить;
		КонецЕсли;
		СтруктураНастроек.Вставить(Реквизит.Имя, Объект[Реквизит.Имя])
	КонецЦикла;
	
	Возврат СтруктураНастроек;
	
КонецФункции //СформироватьСтруктуруСохраняемыхРеквизитов

&НаКлиенте
Функция ПодготовитьНастройкиФормыДляСохранения()

	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("ОтборПоЖурналу", ОтборПоЖурналу);
	СтруктураНастроек.Вставить("ОтборПоВидуДок", ОтборПоВидуДок);
 	СтруктураНастроек.Вставить("ПериодВесьПометка", Элементы.ПериодВесь.Пометка);
	СтруктураНастроек.Вставить("ПериодДеньПометка", Элементы.ПериодДень.Пометка);
	СтруктураНастроек.Вставить("ПериодНеделяПометка", Элементы.ПериодНеделя.Пометка);
	СтруктураНастроек.Вставить("ПериодМесяцПометка", Элементы.ПериодМесяц.Пометка);
	СтруктураНастроек.Вставить("ПериодКварталПометка", Элементы.ПериодКвартал.Пометка);
	СтруктураНастроек.Вставить("ПериодГодПометка", Элементы.ПериодГод.Пометка);
	
	СтруктураНастроек = СформироватьСтруктуруСохраняемыхРеквизитов(СтруктураНастроек);
	
	МассивАдресов = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.ТаблицаКлючей Цикл 
		Если СтрокаТЧ.Пометка Тогда
			МассивАдресов.Добавить(СтрокаТЧ.АдресКлюча);
		КонецЕсли;	
	КонецЦикла;	
	СтруктураНастроек.Вставить("ТаблицаКлючей", МассивАдресов); // сохранение таблицы ключей
    
	СтруктураНастроек.Вставить("ВидДокументаPDF", ВидДокументаPDF);

	Возврат СтруктураНастроек

КонецФункции

&НаСервере
Процедура СохранитьНастройкиФормы(СтруктураНастроек, ИмяСохраняемогоФайла = Неопределено)
	
	СтруктураНастроек.Вставить("ТаблицаПравил", Объект.ТаблицаПравил.Выгрузить());//это здесь из-за того что на клиенте нельзя получить ТЗ
	СтруктураНастроек.Вставить("ТокеныКомпаний", Объект.ТокеныКомпаний.Выгрузить());

	СтруктураНастроек.Вставить("ПоляДляПоискаПлатежей", Объект.ПоляДляПоискаПлатежей.Выгрузить());

	СтруктураНастроек.Вставить("КодПоЕДРПОУ", Объект.КодПоЕДРПОУ);
	СтруктураНастроек.Вставить("ИНН", Объект.ИНН);

	Попытка
		Если ЗначениеЗаполнено(ИмяСохраняемогоФайла) Тогда
			ЗаписатьФайлНастроекНаСервере(ИмяСохраняемогоФайла, СтруктураНастроек)
		Иначе
			ХранилищеНастроекДанныхФорм.Сохранить("1С_ПБ", "СтруктураНастроек", СтруктураНастроек)
		КонецЕсли
	Исключение
		Попытка
			ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("1С_ПБ", "СтруктураНастроек", СтруктураНастроек)
		Исключение
			ТекстСообщения = НСтр("ru='Ошибка сохранения настроек модуля. ';uk='Помилка збереження налаштувань модуля. '") + ОписаниеОшибки();
			СообщениеПользователю(ТекстСообщения)
		КонецПопытки
	КонецПопытки;

	СтруктураНастроек.Очистить();
	
КонецПроцедуры

//end---------------- Общие процедуры сохранения значений -----------------

//begin---------------- СохранитьЗначенияВФайл -----------------

&НаСервере
Процедура ЗаписатьФайлНастроекНаСервере(ИмяСохраняемогоФайла, СтруктураНастроек)

	ЗначениеВФайл(ИмяСохраняемогоФайла, СтруктураНастроек)

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗначенияВФайлНажатие()

	Перем ОповещениеЗавершения;

	РасширениеРаботыСФайламиУстановлено = Ложь;
	Если Не Объект.ЭтоПлатформаBAF Тогда// в магазине google отсутствует расширение для работы с файлами
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			//УстановитьРасширениеРаботыСФайлами();
			//НачатьУстановкуРасширенияРаботыСФайлами();
			РасширениеРаботыСФайламиУстановлено = ПодключитьРасширениеРаботыСФайлами()
		Иначе
			РасширениеРаботыСФайламиУстановлено = Истина
		КонецЕсли
	КонецЕсли;

	Если НЕ РасширениеРаботыСФайламиУстановлено Тогда
		ТекстСообщения = НСтр("ru = 'Расширение работы с файлами не установлено. Для данной операции необходимо установить расширение работы с файлами.';uk='Розширення роботи з файлами не встановлено. Для цієї операції необхідно встановити розширення роботи з файлами.'");
		Попытка
			Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения)")
		Исключение
			СообщениеПользователю(ТекстСообщения, Ложь);
		КонецПопытки;
		Возврат
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = НСтр("ru='Выберите каталог настроек.';uk='Виберіть каталог налаштувань.'");
	Попытка
		Попытка
			Выполнить("ОповещениеЗавершения = Новый ОписаниеОповещения(""ВыборФайлаСохранитьЗначенияВФайлЗавершение"", ЭтотОбъект)");
		Исключение
			Выполнить("ОповещениеЗавершения = Новый ОписаниеОповещения(""ВыборФайлаСохранитьЗначенияВФайлЗавершение"", ЭтаФорма)")//для старых версий
		КонецПопытки;
		Диалог.Показать(ОповещениеЗавершения)
	Исключение
		//совместимость с более ранними версиями платформы, не поддерживающих асинхронность (до 8.3.3)
		//Если Диалог.Выбрать() Тогда
		//	КаталогНастроек = Диалог.Каталог;
		//	ПолноеИмяФайлаНастроек = ДобавитьКонечныйРазделительПути(КаталогНастроек) + ИмяФайлаНастроек;
		//	ЗначениеВФайл(ПолноеИмяФайлаНастроек, стСохраняемыеНастройки)
		//Иначе
		//	ТекстСообщенияОтказОтВводаПути = НСтр("ru='Вы отказались от ввода пути к файлу настроек.';uk='Ви відмовилися від введення шляху до файлу налаштувань.'");
		//	СообщениеПользователю(ТекстСообщенияОтказОтВводаПути, Ложь);
		//	Возврат
		//КонецЕсли;
	КонецПопытки

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаСохранитьЗначенияВФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ТекстСообщения = НСтр("ru='Выполняется запись файла настроек...';uk='Виконується запис файлу налаштувань...'");
		СообщениеПользователю(ТекстСообщения, Ложь);

		ИмяСохраняемогоФайла = ДобавитьКонечныйРазделительПути(ВыбранныеФайлы[0]) + ИмяФайлаНастроек;
		СтруктураНастроек = ПодготовитьНастройкиФормыДляСохранения();
		СохранитьНастройкиФормы(СтруктураНастроек, ИмяСохраняемогоФайла);

		ТекстСообщения = НСтр("ru='Сохранение настроек из файла %ИмяФайлаНастроек% выполнено.';uk='Збереження налаштувань з файлу %ИмяФайлаНастроек% виконано.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайлаНастроек%", ИмяСохраняемогоФайла);
		СообщениеПользователю(ТекстСообщения)
	Иначе
		ТекстСообщенияОтказОтВводаПути = НСтр("ru='Вы отказались от ввода пути к файлу настроек.';uk='Ви відмовилися від введення шляху до файлу налаштувань.'");
		СообщениеПользователю(ТекстСообщенияОтказОтВводаПути, Ложь)
	КонецЕсли

КонецПроцедуры

//end---------------- СохранитьЗначенияВФайл -----------------

//begin---------------- ВосстановитьЗначенияИзФайла -----------------

&НаКлиенте
Процедура КомандаВосстановитьЗначенияИзФайла(Команда)

	Перем ОповещениеЗавершения;

	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		НачатьУстановкуРасширенияРаботыСФайлами()
	КонецЕсли;	
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		ТекстСообщения = НСтр("ru = 'Расширение работы с файлами не установлено. Для данной операции необходимо установить расширение работы с файлами.';uk='Розширення роботи з файлами не встановлено. Для цієї операції необхідно встановити розширення роботи з файлами.'");
		Попытка
			Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения)")
		Исключение
			СообщениеПользователю(ТекстСообщения, Ложь);
		КонецПопытки;
		Возврат;
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru='Выберите файл настроек.';uk='Виберіть файл налаштувань.'");
	Попытка
		Попытка
			Выполнить("ОповещениеЗавершения = Новый ОписаниеОповещения(""ВыборФайлаВосстановитьЗначенияИзФайлаЗавершение"", ЭтотОбъект)");
		Исключение
			Выполнить("ОповещениеЗавершения = Новый ОписаниеОповещения(""ВыборФайлаВосстановитьЗначенияИзФайлаЗавершение"", ЭтаФорма)")//для старых версий
		КонецПопытки;
		Диалог.Показать(ОповещениеЗавершения)
	Исключение
		//совместимость с более ранними версиями платформы, не поддерживающих асинхронность (до 8.3.3)
		//Если Диалог.Выбрать() Тогда
		//	КаталогНастроек = Диалог.Каталог;
		//	ПолноеИмяФайлаНастроек = ДобавитьКонечныйРазделительПути(КаталогНастроек) + ИмяФайлаНастроек;
		//	ЗначениеВФайл(ПолноеИмяФайлаНастроек, стСохраняемыеНастройки)
		//Иначе
		//	ТекстСообщенияОтказОтВводаПути = НСтр("ru='Вы отказались от ввода пути к файлу настроек.';uk='Ви відмовилися від введення шляху до файлу налаштувань.'");
		//	СообщениеПользователю(ТекстСообщенияОтказОтВводаПути, Ложь);
		//	Возврат
		//КонецЕсли;
	КонецПопытки

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаВосстановитьЗначенияИзФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ТекстСообщения = НСтр("ru='Выполняется восстановление файла настроек...';uk='Виконується відновлеення файлу налаштувань...'");
		СообщениеПользователю(ТекстСообщения, Ложь);

		ПолноеИмяФайлаНастроек = ДобавитьКонечныйРазделительПути(ВыбранныеФайлы[0]);
		ВосстановитьЗначенияИзФайла(ПолноеИмяФайлаНастроек)
	Иначе
		ТекстСообщенияОтказОтВводаПути = НСтр("ru='Вы отказались от ввода пути к файлу настроек.';uk='Ви відмовилися від введення шляху до файлу налаштувань.'");
		СообщениеПользователю(ТекстСообщенияОтказОтВводаПути, Ложь)
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ВосстановитьЗначенияИзФайла(ПолноеИмяФайлаНастроек)

	Попытка
		стВосстанавливаемыеНастройки = ЗначениеИзФайла(ПолноеИмяФайлаНастроек)
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка чтения файла настроек: ';uk='Помилка читання файлу налаштувань: '") + ОписаниеОшибки();
		СообщениеПользователю(ТекстСообщения);
		Возврат
	КонецПопытки;
	ВосстановитьНастройкиФормыИзХранилищаИИзФайла(стВосстанавливаемыеНастройки);
	ТекстСообщения = НСтр("ru='Восстановление настроек из файла %ИмяФайлаНастроек% выполнено.';uk='Відновлення налаштувань з файлу %ИмяФайлаНастроек% виконано.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайлаНастроек%", ПолноеИмяФайлаНастроек);
	СообщениеПользователю(ТекстСообщения, Ложь)

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()

	Попытка
		СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("1С_ПБ", "СтруктураНастроек");
		ВосстановитьНастройкиФормыИзХранилищаИИзФайла(СтруктураНастроек)
	Исключение
	КонецПопытки

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормыИзХранилищаИИзФайла(СтруктураНастроек)

	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда

		Для Каждого СтрокаСтр Из СтруктураНастроек Цикл
			Если ТипЗнч(СтрокаСтр.Значение) = Тип("Строка") И ПустаяСтрока(СтрокаСтр.Значение) Тогда
				Продолжить
			КонецЕсли;
			// исключения восстановления настроек
			Если СтрокаСтр.Ключ = "ПутьКурл" И (ЗначениеЗаполнено(Объект.ПутьКурл) Или Не ЗначениеЗаполнено(СтрокаСтр.Значение))
					Или Найти("XML,ОбработкаВнешняя,Авторизовано,Сессия,ИДПакетаЗачислений,СпискоПакЗач,ТекВерсия,//АвтоматическийОбмен,
						|UserAgentHeaders,ТекНомСтроки,ОстатокНаСчетеВ1С,ОстатокНаСчетеВПБ,ДельтаОстатка,ДокументОприходования,//Склад,
						|ЦенаПродажи,РежимОтладки,ПарольПапка24,АдресДокументооборота,АдресПапка24,АдресРасченыхЛистов,АдресДляЗП,
						|БезПроверкиСертификатаСайта,РаботаВМоделиСервисаПБ,ПоддерживаетсяTLS12,ИдКонф,//СтарыйВариантАвторизации,
						|ЗаписьЛогаВФайл,АдресАК,АдресЭО,FollowId,ИспользоватьТокены,ТекущийИДКлиентаГруппыЧП,тзНовыйДокФин,
						|тзСписокКарт,ПроверенСертификатCURL,ТекВидОперации,Это1cnik,ЭтоWindows,ЭтоLinuxСервер,ЭтоLinuxКлиент,ЭтоMacOS,
						|ВыводилосьГС,typeЧП", СтрокаСтр.Ключ) > 0 
					Тогда//не восстанавливать ПутьКурл
				Продолжить;
			КонецЕсли;
			ВосстановитьНастройкиИзСтруктуры(СтрокаСтр.Ключ, СтрокаСтр.Значение);
		КонецЦикла;

		Если СтруктураНастроек.Свойство("ОтборПоЖурналу") Тогда
			ОтборПоЖурналу = СтруктураНастроек.ОтборПоЖурналу;
		Иначе
			ОтборПоЖурналу = "Все документы";
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ОтборПоВидуДок") Тогда
			ОтборПоВидуДок = СтруктураНастроек.ОтборПоВидуДок;
		Иначе
			ОтборПоВидуДок = "Все виды документов";
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ПериодВесьПометка") Тогда
			Элементы.ПериодВесь.Пометка = СтруктураНастроек.ПериодВесьПометка;
		Иначе
			Элементы.ПериодВесь.Пометка = Истина;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ПериодДеньПометка") Тогда
			Элементы.ПериодДень.Пометка = СтруктураНастроек.ПериодДеньПометка;
		Иначе
			Элементы.ПериодДень.Пометка = Ложь;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ПериодНеделяПометка") Тогда
			Элементы.ПериодНеделя.Пометка = СтруктураНастроек.ПериодНеделяПометка;
		Иначе
			Элементы.ПериодНеделя.Пометка = Ложь;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ПериодМесяцПометка") Тогда
			Элементы.ПериодМесяц.Пометка = СтруктураНастроек.ПериодМесяцПометка;
		Иначе
			Элементы.ПериодМесяц.Пометка = Ложь;
		КонецЕсли;

		Если СтруктураНастроек.Свойство("ПериодКварталПометка") Тогда
			Элементы.ПериодКвартал.Пометка = СтруктураНастроек.ПериодКварталПометка;
		Иначе
			Элементы.ПериодКвартал.Пометка = Ложь;
		КонецЕсли;

		Если СтруктураНастроек.Свойство("ПериодГодПометка") Тогда
			Элементы.ПериодГод.Пометка = СтруктураНастроек.ПериодГодПометка;
		Иначе
			Элементы.ПериодГод.Пометка = Ложь;
		КонецЕсли;

		Попытка
			Объект.ТаблицаКлючей.Очистить();
			Для Каждого СтрокаМассива Из СтруктураНастроек.ТаблицаКлючей Цикл
				НоваяСтрока = Объект.ТаблицаКлючей.Добавить();
				НоваяСтрока.Пометка = Истина;
				НоваяСтрока.АдресКлюча = СтрокаМассива;
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		Попытка
			ВидДокументаPDF	= СтруктураНастроек.ВидДокументаPDF;	
		Исключение
		КонецПопытки;
		
		Попытка
			Объект.ТаблицаПравил.Очистить();
			Для Каждого СтрокаПравил Из СтруктураНастроек.ТаблицаПравил Цикл
				НоваяСтрока = Объект.ТаблицаПравил.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПравил);
			КонецЦикла;				
		Исключение
		КонецПопытки;
		
		Попытка
			Объект.ТокеныКомпаний.Очистить();
			Для Каждого СтрокаТЗ Из СтруктураНастроек.ТокеныКомпаний Цикл
				НоваяСтрока = Объект.ТокеныКомпаний.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		Попытка
			Объект.ПоляДляПоискаПлатежей.Очистить();
			Для Каждого СтрокаПолейПоиска Из СтруктураНастроек.ПоляДляПоискаПлатежей Цикл
				НоваяСтрока = Объект.ПоляДляПоискаПлатежей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолейПоиска);
			КонецЦикла;				
		Исключение
		КонецПопытки;

	КонецЕсли;
	
	Если НЕ Элементы.ПериодВесь.Пометка
		   И НЕ Элементы.ПериодДень.Пометка
		   И НЕ Элементы.ПериодНеделя.Пометка
		   И НЕ Элементы.ПериодМесяц.Пометка
		   И НЕ Элементы.ПериодКвартал.Пометка
		   И НЕ Элементы.ПериодГод.Пометка
	   Тогда

		Элементы.ПериодДень.Пометка = Истина;
		
	КонецЕсли;

	Попытка
		Если СтруктураНастроек.Свойство("КодПоЕДРПОУ") Тогда
			Элементы.КодПоЕДРПОУ = СтруктураНастроек.КодПоЕДРПОУ;
		КонецЕсли
	Исключение
	КонецПопытки;
	Попытка
		Если СтруктураНастроек.Свойство("ИНН") Тогда
			Элементы.ИНН = СтруктураНастроек.ИНН;
		КонецЕсли
	Исключение
	КонецПопытки;

	Если НЕ ЗначениеЗаполнено(Объект.КодПоЕДРПОУ) ИЛИ НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
		ЗаполнитьСтавкуНДСПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиИзСтруктуры(Ключ, Значение)
	
	Попытка
		Объект[Ключ] = Значение;
	Исключение	
	КонецПопытки;	
	
КонецПроцедуры	

//end---------------- ВосстановитьЗначенияИзФайла -----------------

&НаКлиенте
Процедура ВидДокВперед(Команда)
	
	СдвинутьСписокЗначВперед(Элементы.ОтборПоВидуДок, ОтборПоВидуДок);
	ЗаполнитьСписокДокументов(Команда)

КонецПроцедуры

&НаКлиенте
Процедура ЖурналВперед(Команда)
	
	СдвинутьСписокЗначВперед(Элементы.ОтборПоЖурналу, ОтборПоЖурналу);
	ЗаполнитьСписокДокументов(Команда)

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДокументов(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана ""Организация"". Формирование списка документов невозможно.';uk='Не вибрана ""Організація"". Формування списку документів неможливо.'"),,"Организация","Объект");	
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокДокументовСервер();
	ЗаполнитьСпискиВыбора();

	ВидимостьКнопокНалоговыеИсходящие();

	ЗапомнитьСписокДокументовСервер()

КонецПроцедуры

&НаСервере
Процедура ЗапомнитьСписокДокументовСервер()

	Объект.фСписокДокументов.Загрузить(Объект.СписокДокументов.Выгрузить())

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокНалоговыеИсходящие()

	ЕстьСписокДок = Объект.СписокДокументов.Количество() > 0;
	Элементы.СписокДокументовЗарегистрироватьДокументы.Доступность = ЕстьСписокДок;
	Элементы.СписокДокументовПроверитьСостояниеРегистрации.Доступность = ЕстьСписокДок;
	Элементы.СписокДокументовПодписатьНалоговые.Доступность = ЕстьСписокДок;
	Элементы.СписокДокументовВыгрузитьВXML.Доступность = ЕстьСписокДок

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокНалоговыеВходящие()

	ЕстьСписокДок = Объект.СписокДокументов.Количество() > 0;
	Элементы.ВходящиеННЗаписатьДокументы.Доступность = ЕстьСписокДок

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПослеУдаления(Элемент)

	ВидимостьКнопокНалоговыеИсходящие();
	ВидимостьКнопокНалоговыеВходящие()

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументовСервер()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	
	Отборы = Новый Структура;
	Отборы.Вставить("ОтборПоЖурналу", ОтборПоЖурналу);
	Отборы.Вставить("ОтборПоВидуДок", ОтборПоВидуДок);

	ОбработкаОбьект.ЗаполнитьСписок(Отборы, ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если Поле.Имя = "СписокДокументовНомерСтроки" Тогда
		Если ЗначениеЗаполнено(ТД.ТекстОшибки) Тогда
			СообщениеПользователю(ТД.ТекстОшибки, Ложь)
		КонецЕсли;
	ИначеЕсли Поле.Имя <> "СписокДокументовФлажок" Тогда
		ОткрытьНалоговуюНакладную();
	КонецЕсли;
	
КонецПроцедуры

//Процедура - открывает текущую налоговую налкадную на редактирование или просмотр
//Параметры:
//	- ТолькоПросмотр: Булево. Режим открытия налоговой накладной
&НаКлиенте
Процедура ОткрытьНалоговуюНакладную(ТолькоПросмотр = Ложь)
	
	//Откроем налоговую накладную
	ТД = Элементы.СписокДокументов.ТекущиеДанные; 
	ТекДок = ТД.СсылкаНаДокумент;
	
	Док = Новый Структура;
    Док.Вставить("Ключ", ТекДок);

	ВерсияДанных = ПолучитьВерсияДанныхДокументаСервер(Элементы.СписокДокументов.ТекущиеДанные.СсылкаНаДокумент);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВерсияДанных", ВерсияДанных);
	ДопПараметры.Вставить("ТЧ", "СписокДокументов");
	ОписаниеОповещения = Новый ОписаниеОповещения("ПереЗаполнитьСписокДокументовЗавершение", ЭтаФорма, ДопПараметры);

	Если ТД.ВидДокумента = "Налоговая накладная" Тогда
		//ОткрытьФорму("Документ.НалоговаяНакладная.ФормаОбъекта",Док);//совместимость с более ранними версиями платформы, не поддерживающих асинхронность (до 8.3.3)
		ОткрытьФорму("Документ.НалоговаяНакладная.ФормаОбъекта", Док,,,,, ОписаниеОповещения)//, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	ИначеЕсли ТД.ВидДокумента = "Приложение 2 к налоговой накладной" Тогда
		//ОткрытьФорму("Документ.НалоговаяНакладная.ФормаОбъекта", Док);//совместимость с более ранними версиями платформы, не поддерживающих асинхронность (до 8.3.3)
		ОткрытьФорму("Документ.Приложение2КНалоговойНакладной.ФормаОбъекта", Док,,,,, ОписаниеОповещения)//, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	Иначе//ЗапросКЕРНН
		//ОткрытьФорму("Документ.Приложение2КНалоговойНакладной.ФормаОбъекта",Док);//совместимость с более ранними версиями платформы, не поддерживающих асинхронность (до 8.3.3)
		ОткрытьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.ФормаОбъекта", Док,,,,, ОписаниеОповещения)//, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереЗаполнитьСписокДокументовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.БанковскийСчет = Результат;
		
	КонецЕсли;
	
КонецПроцедуры // ИмпортБанковскийСчетНачалоВыбораЗавершение()

&НаСервере
Функция ПолучитьВерсияДанныхДокументаСервер(СсылкаНаДокумент)

	Возврат СсылкаНаДокумент.ВерсияДанных
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеКаталогаИВыгрузить(Знач ИмяКаталога, ВидФайла) Экспорт
	
	// ищем нужный нам каталог, если его нет - то пытаемся создать
	Если ПустаяСтрока(ИмяКаталога) Тогда 
		ТекстСообщения = НСтр("ru='Не задан каталог для выгрузки XML';uk='Не заданий каталог для вивантаження XML'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат;
	КонецЕсли;
	
	ВыбФайл = Новый Файл();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКаталога", ИмяКаталога);
	СтруктураПараметров.Вставить("ВидФайла", ВидФайла);

	Если Не Объект.UnitТест Тогда
		НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПроверкаРасширенияРаботыСфайламиПродолжение", ЭтаФорма, СтруктураПараметров));
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаРасширенияРаботыСфайламиПродолжение(Подключено, СтруктураПараметров) Экспорт 

	Если Не Подключено Тогда
		ТекстСообщения = НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами. Операция займет несколько секунд...';uk='Для цієї операції необхідно встановити розширення роботи з файлами. Операція займе кілька секунд...'");
		Попытка
			Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения)")
		Исключение
			СообщениеПользователю(ТекстСообщения, Ложь);
		КонецПопытки;
		НачатьУстановкуРасширенияРаботыСФайлами();

		Ответ = Истина;
		ПроверкаСуществованияФайлаЗавершение(Ответ, СтруктураПараметров);

		Возврат;
	КонецЕсли;
	
	ВыбФайл = Новый Файл(СтруктураПараметров.ИмяКаталога);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаСуществованияФайлаЗавершение", ЭтаФорма, СтруктураПараметров);
	ВыбФайл.НачатьПроверкуСуществования(ОписаниеОповещения);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПроверкаФайла(Ответ, Параметры) Экспорт
//	
//	ВыбФайл = Ответ;
//	ИмяКаталога = Параметры.ИмяКаталога;
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаСуществованияФайла", ЭтаФорма, Параметры);
//	ВыбФайл.НачатьПроверкуСуществования(ОписаниеОповещения); 
//	 
// КонецПроцедуры	 
 
// &НаКлиенте
//совместимость с более ранними версиями платформы, не поддерживающих асинхронность (до 8.3.3)?
//Процедура ПроверкаСуществованияФайла(Ответ, Параметры) Экспорт

// 	Если НЕ Ответ Тогда
//		ТекстСообщения = НСтр("ru='Не найден каталог для выгрузки XML: ';uk='Не знайдений каталог для вивантаження XML: '") + Параметры.ИмяКаталога;
//		СообщениеПользователю(ТекстСообщения, Ложь);
//		Возврат;
//	КонецЕсли;
//	
//	Если Параметры.ВидФайла = "XML" Тогда
//		ВыпВЦикле = ВыгрузитьВXMLНаСервере(); //
//		Если ВыпВЦикле = Истина Тогда
//			Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
//			//ЭтаФорма.Доступность = Ложь;
//			ПодключитьОбработчикОжидания("ВыгрузитьВXMLВЦикле", 1);
//		КонецЕсли;
//		
//	ИначеЕсли Параметры.ВидФайла = "PDF" Тогда
//		Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
//			Возврат;
//		КонецЕсли;
//		
//		Если мИмяТекЭлемента = "ТекстPDFДокументы" Тогда
//			ВыпВЦикле = ОтправитьPDFДокНаСервере(Ложь);
//			Если ВыпВЦикле Тогда
//				Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
//				//ЭтаФорма.Доступность = Ложь;
//				ПодключитьОбработчикОжидания("ОтправитьPDFДокВЦикле", 1);
//			КонецЕсли;
//			
//		Иначе
//			ВыпВЦикле = ВыгрузитьPDFНаСервере(Ложь); 
//			Если ВыпВЦикле Тогда
//				Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
//				//ЭтаФорма.Доступность = Ложь;
//				ПодключитьОбработчикОжидания("СохранитьPDFВЦикле", 1);
//			КонецЕсли;
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСуществованияФайлаЗавершение(Ответ, Параметры) Экспорт

 	Если НЕ Ответ Тогда
		ТекстСообщения = НСтр("ru='Не найден каталог для выгрузки: ';uk='Не знайдений каталог для вивантаження: '") + Параметры.ИмяКаталога;
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат;
	КонецЕсли;
	
	Если Параметры.ВидФайла = "XML" Тогда

		вДействиеАналитики = Объект.ДействиеАналитики;
		ВыпВЦикле = ВыгрузитьВXMLНаСервере();
		Объект.ДействиеАналитики = вДействиеАналитики;
		
		Если ВыпВЦикле = Истина Тогда
			Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
			ПодключитьОбработчикОжидания("ВыгрузитьВXMLВЦикле", 1);
		КонецЕсли;
		
	ИначеЕсли Параметры.ВидФайла = "PDF" Тогда
		
		Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
			Возврат;
		КонецЕсли;
		
		Если мИмяТекЭлемента = "ТекстPDFДокументы" Тогда
			//	pdf док.
			вДействиеАналитики = Объект.ДействиеАналитики;
			ВыпВЦикле = ОтправитьPDFДокНаСервере(Ложь);
			Объект.ДействиеАналитики = вДействиеАналитики;
	
			Если ВыпВЦикле Тогда
				Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
				ЭтаФорма.Доступность = Ложь;
				ПодключитьОбработчикОжидания("ОтправитьPDFДокВЦикле", 1);
			КонецЕсли;

			СохранитьФайлВыгрузкиНаКлиенте(Параметры.ИмяКаталога)

		Иначе
			//	PaperLess
			вДействиеАналитики = Объект.ДействиеАналитики;
			ВыпВЦикле = ВыгрузитьPDFНаСервере(Ложь);
			Объект.ДействиеАналитики = вДействиеАналитики;
			
			Если ВыпВЦикле Тогда
				Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
				ЭтаФорма.Доступность = Ложь;
				ПодключитьОбработчикОжидания("СохранитьPDFВЦикле", 1);
			КонецЕсли;

			СохранитьФайлВыгрузкиНаКлиенте(Параметры.ИмяКаталога);

			Объект.ДействиеАналитики = "Папка24Сохранение";
			ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)

		КонецЕсли;
		
	ИначеЕсли Параметры.ВидФайла = "XLS" Тогда
		ВыгрузитьВедомостьВФайлНаСервере();//ФормированиеОтчетовДляКредитования);
		Если Не Объект.UnitТест Тогда
			СохранитьФайлВыгрузкиНаКлиенте(Параметры.ИмяКаталога);
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВXML(Команда)
	
	Объект.ДействиеАналитики = "ННВыгрузкаВФайл";

	Объект.ТекВидОперации = "Налоговые";
	
	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузки, "XML");
		
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВXMLНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Если Объект.ТекВидОперации = "Налоговые" Тогда
		ВыпВЦикле = ОбработкаОбьект.СформироватьXML_Налоговые(ОтборПериод.ДатаОкончания, Ложь, УникальныйИдентификатор); //параметр Ложь - говорит что выгрузка на диск
	Иначе//Если Объект.ТекВидОперации = "СчетНаОплату%" ИЛИ Объект.ТекВидОперации = "АктВыполненныхРабот" ИЛИ Объект.ТекВидОперации = "ЗаказПоставщику" Тогда
		ВыпВЦикле = ОбработкаОбьект.СформироватьXML_ФинДок(ОтборПериод.ДатаОкончания, Ложь, УникальныйИдентификатор); //параметр Ложь - говорит что выгрузка на диск	
	КонецЕсли;	
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле; 
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВXMLВЦикле()

	вДействиеАналитики = Объект.ДействиеАналитики;
	ВыпВЦикле = ВыгрузитьВXMLНаСервере();
	Объект.ДействиеАналитики = вДействиеАналитики;
	
	Если ВыпВЦикле = Ложь Тогда
		ОтключитьОбработчикОжидания("ВыгрузитьВXMLВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		СохранитьФайлВыгрузкиНаКлиенте(Объект.КаталогВыгрузки);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция ЭтоПлатформаBAF()

	//BAF существует в ограниченном количестве версий: 8.3.19.1529,8.3.18.1627,8.3.16.1690,8.3.15.1887,8.3.14.1669,8.3.13.1849,8.3.12.1855,8.3.12.1811
	СисИнфо = Новый СистемнаяИнформация;
	Если Найти("8.3.19.1529,8.3.18.1627,8.3.16.1690,8.3.15.1887,8.3.14.1669,8.3.13.1849,8.3.12.1855,8.3.12.1811", СисИнфо.ВерсияПриложения) > 0 Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли

КонецФункции

&НаКлиенте
Процедура СохранитьФайлВыгрузкиНаКлиенте(ИмяКаталога)

	РасширениеРаботыСФайламиУстановлено = Ложь;
	Если Не Объект.ЭтоПлатформаBAF Тогда// в магазине google отсутствует расширение для работы с файлами
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			//УстановитьРасширениеРаботыСФайлами();
			//НачатьУстановкуРасширенияРаботыСФайлами();
			РасширениеРаботыСФайламиУстановлено = ПодключитьРасширениеРаботыСФайлами();
		КонецЕсли
	КонецЕсли;

	Попытка
		
		ПолучаемыеФайлы = Новый Массив;
		
		Если Объект.СписокФайлов.Количество() = 0 Тогда
			Возврат;	
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Объект.СписокФайлов Цикл
			ПолноеИмяPDFФайлаДокумента = ДобавитьКонечныйРазделительПути(ИмяКаталога) + СтрокаТЧ.ИмяФайла;
			Если Не РасширениеРаботыСФайламиУстановлено Тогда
				Если Объект.ЭтоВебКлиент И Объект.ЭтоПлатформаBAF Тогда
					// в магазине google отсутствует расширение для работы с файлами
					АдресФайлаДляЗаписи = СтрокаТЧ.ИмяФайла
				Иначе
					АдресФайлаДляЗаписи = ПолноеИмяPDFФайлаДокумента
				КонецЕсли;
				ПолучитьФайл(СтрокаТЧ.АдресФайла, АдресФайлаДляЗаписи, Истина)
			Иначе
				АдресФайлаДляЗаписи = ПолноеИмяPDFФайлаДокумента;
				ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ПолноеИмяPDFФайлаДокумента, СтрокаТЧ.АдресФайла);
				ПолучаемыеФайлы.Добавить(ОписаниеФайла);
			КонецЕсли;
			//сообщаем о записи файлов на клиенте
			ТекстСообщения = НСтр("ru='Файл %ИмяФайла% записан.';uk='Файл %ИмяФайла% записаний.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", АдресФайлаДляЗаписи);//ПолноеИмяPDFФайлаДокумента//ОписаниеФайла.Имя
			СообщениеПользователю(ТекстСообщения, Ложь)
		КонецЦикла;	
		
		Объект.СписокФайлов.Очистить();

		Если РасширениеРаботыСФайламиУстановлено Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыССервера", ЭтаФорма);
			НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДобавитьКонечныйРазделительПути(ИмяКаталога), Ложь)//Объект.КаталогВыгрузки
		КонецЕсли
		
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось записать файлы! Возможно, недостаточно места на диске или диск защищен от записи.';
		|;uk='Не вдалося записати файли! Можливо, недостатньо місця на диску або диск захищений від запису'");
		ТекстСообщения = ТекстСообщения + НСтр("ru=' Также, возможно, не подключено расширение для работы с файлами.';uk='Також, можливо, не підключено розширення для роботи з файлами.'")
			+ Символы.ПС + ОписаниеОшибки() + Символы.ПС + НСтр("ru='Не удалось выполнить сохранение документов!';uk='Не вдалося виконати збереження документів!'");
		СообщениеПользователю(ТекстСообщения, Ложь)
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыССервера(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Не удалось записать файлы! Возможно, недостаточно места на диске или диск защищен от записи.';
		|;uk='Не вдалося записати файли! Можливо, недостатньо місця на диску або диск захищений від запису'");
		ТекстСообщения = ТекстСообщения + НСтр("ru=' Также, возможно, не подключено расширение для работы с файлами.';uk='Також, можливо, не підключено розширення для роботи з файлами.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		СообщениеПользователю(НСтр("ru='Не удалось выполнить сохранение документов!';uk='Не вдалося виконати збереження документів!'"), Ложь)
	Иначе
		СообщениеПользователю(НСтр("ru='Сохранение документов завершено.';uk='Збереження документів завершено.'"), Ложь);
		Если ЗначениеЗаполнено(Объект.ДействиеАналитики) Тогда
			ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
		КонецЕсли
	КонецЕсли;
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗарегистрироватьДокументы(Команда)

	Если Не Объект.UnitТест И Не ПроверитьНаличиеСтатусовПолучитьСтатусыНаСервере() Тогда
		Возврат
	КонецЕсли;

	ВыпВЦикле = ЗарегистрироватьДокументыНаСервере(); 
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ЗарегистрироватьДокументыВЦикле", 1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьДокументыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.СформироватьXML_Налоговые(ОтборПериод.ДатаОкончания, Истина); //параметр Истина - говорит что передача на сервис Приват24
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьДокументыВЦикле()
	
	ВыпВЦикле = ЗарегистрироватьДокументыНаСервере(); 
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ЗарегистрироватьДокументыВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьКаталог(Элемент);
	
КонецПроцедуры

// Вызывает диалог выбора каталога
//
// Параметры:
//  ПараметрыВыбора - Структура - путь к каталогу.
//		Описание струткуры:
//			ИмяРеквизита 		- Строка - имя реквизита в который происходит выбор
//          ИмяТЧ 		        - Строка - имя табличной части в которой происходит выбор
//			ТекстРедактирования - Строка - текуший адрес файла
//  ВыборКаталогаВТабличнойЧасти - Булево - признак что выбор проиходит из табличной части формы
//
&НаКлиенте
Процедура ВыбратьКаталог(ПараметрыВыбора, ВыборКаталогаВТабличнойЧасти = Ложь)
	
	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		ТекстСообщения = НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами. Операция займет несколько секунд...';uk='Для цієї операції необхідно встановити розширення роботи з файлами. Операція займе кілька секунд...'");
		Попытка
			Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения)")
		Исключение
			СообщениеПользователю(ТекстСообщения, Ложь);
		КонецПопытки;
		НачатьУстановкуРасширенияРаботыСФайлами();
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Заголовок = НСтр("ru = 'Укажите каталог обмена';uk='Вкажіть каталог обміну'");
	
	Диалог.Каталог   = ПараметрыВыбора.ТекстРедактирования; //ДобавитьКонечныйРазделительПути(Каталог);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяРеквизита", ПараметрыВыбора.Имя); 
	
	Если ВыборКаталогаВТабличнойЧасти Тогда
		СтруктураПараметров.Вставить("ИмяТЧ", ПараметрыВыбора.ИмяТЧ); 
		ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогВыбораАдресаВТабличнойЧасти", ЭтаФорма, СтруктураПараметров);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогВыбораАдреса", ЭтаФорма, СтруктураПараметров);
	КонецЕсли;	
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

// Вызывает диалог выбора файла
//
// Параметры:
//  ПараметрыВыбора - Структура - путь к каталогу.
//		Описание струткуры:
//			ИмяРеквизита 		- Строка - имя реквизита в который происходит выбор
//          ИмяТЧ 		        - Строка - имя табличной части в которой происходит выбор
//			ТекстРедактирования - Строка - текуший адрес файла
//			РасширениеФайла     - Строка - расширение файла
//  ВыборКаталогаВТабличнойЧасти - Булево - признак что выбор проиходит из табличной части формы
//
&НаКлиенте
Процедура ВыбратьФайл(ПараметрыВыбора, ВыборКаталогаВТабличнойЧасти = Ложь)

	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		НачатьУстановкуРасширенияРаботыСФайлами()
	КонецЕсли;	
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		ТекстСообщения = НСтр("ru = 'Расширение работы с файлами не установлено. Для данной операции необходимо установить расширение работы с файлами.';uk='Розширення роботи з файлами не встановлено. Для цієї операції необхідно встановити розширення роботи з файлами.'");
		Попытка
			Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения)")
		Исключение
			СообщениеПользователю(ТекстСообщения, Ложь);
		КонецПопытки;
		Возврат
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Фильтр = " (*." + ПараметрыВыбора.РасширениеФайла + ")|*." + ПараметрыВыбора.РасширениеФайла;   
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяРеквизита", ПараметрыВыбора.Имя); 
	
	Если ВыборКаталогаВТабличнойЧасти Тогда
		СтруктураПараметров.Вставить("ИмяТЧ", ПараметрыВыбора.ИмяТЧ); 
		ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогВыбораАдресаВТабличнойЧасти", ЭтаФорма, СтруктураПараметров);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогВыбораАдреса", ЭтаФорма, СтруктураПараметров);
	КонецЕсли;	
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораАдреса(Ответ, Параметры) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("Массив") И Ответ.Количество() <> 0 Тогда
		Объект[Параметры.ИмяРеквизита] = Ответ[0];//ДобавитьКонечныйРазделительПути(Ответ[0]);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораАдресаВТабличнойЧасти(Ответ, Параметры) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("Массив") И Ответ.Количество() <> 0 Тогда
		Объект[Параметры.ИмяТЧ][Элементы[Параметры.ИмяТЧ].ТекущиеДанные.НомерСтроки - 1][Параметры.ИмяРеквизита] = Ответ[0]; //ДобавитьКонечныйРазделительПути(Ответ[0]);
	КонецЕсли;	
	
КонецПроцедуры

// Добавляет к переданному пути каталога конечный символ-разделитель, если он отсутствует.
//
// Параметры:
//  ПутьКаталога - Строка - путь к каталогу.
//
// Возвращаемое значение:
//  Строка - путь к каталогу с конечным символом-разделителем.
//
// Примеры использования:
//  Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог"); // возвращает "C:\Мой каталог\"
//  Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог\"); // возвращает "C:\Мой каталог\"
//  Результат = ДобавитьКонечныйРазделительПути("%APPDATA%"); // возвращает "%APPDATA%\"
//
&НаКлиенте
Функция ДобавитьКонечныйРазделительПути(Знач ПутьКаталога, Знач Удалить_Платформа = Неопределено)

	Если ПустаяСтрока(ПутьКаталога) Тогда
		Возврат ПутьКаталога;
	КонецЕсли;
	
	ДобавляемыйСимвол = ПолучитьРазделительПути();
	
	Если Прав(ПутьКаталога, 1) = ДобавляемыйСимвол Тогда
		Возврат ПутьКаталога;
	Иначе 
		Возврат ПутьКаталога + ДобавляемыйСимвол;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура УстановитьОрганизациюВТокеныКомпанийНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.УстановитьОрганизациюВТокеныКомпаний();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ЕстьЕдиныйНалог = ПроверитьУчетнуюПолитикуПоОрганизацииНаСервере(Объект.Организация);
	ОрганизацияПриИзмененииНаСервере(ЕстьЕдиныйНалог);

	Объект.ТаблицаИДГруппыЧП.Очистить();
	Объект.ИмпортПлатежныеДокументы.Очистить();
	Объект.ЭкспортПлатежныеДокументы.Очистить();
	ТабДокВыпискаОчистить();

	Объект.ТабличноеПолеКорпКарты.Очистить();
	Объект.ТабличноеПолеВыписка.Очистить();
	Объект.ТабличноеПолеОтчет.Очистить();

	Объект.ЗарплатныеВедомости.Очистить();
	Объект.РасчетныеЛистки.Очистить();

	Объект.ФинансовыеДокументы.Очистить();
	Объект.СписокДокументов.Очистить();

	Объект.СписокЭкспортаPDF.Очистить();
	Объект.РеглОтчеты.Очистить();

	Объект.typeЧП = "";

	Если Не Объект.ФлагАвтоИмпЭкспДокументы Тогда

		УстановитьОрганизациюВТокеныКомпанийНаСервере();

		Объект.ТекущийЗП = "";
		Объект.СписокЗП.Очистить();
		Объект.ТекущийЗПРЛ = "";
		Объект.СписокЗПРЛ.Очистить();

		Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблОтправкаВедомости.Имя Тогда
			ПолучениеЗарплатногоПроекта("")
		КонецЕсли;

		ЗаполнитьСписокВыбораЗП();
		ЗаполнитьСписокВыбораЗПРЛ()

	КонецЕсли;

	ПереключитьПоказатьСообщениеНеАвторизовано()

КонецПроцедуры

&НаСервере
Функция ПроверитьУчетнуюПолитикуПоОрганизацииНаСервере(Организация)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ЕстьЕдиныйНалог = ОбработкаОбьект.ПроверитьУчетнуюПолитикуПоОрганизации(Организация);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат ЕстьЕдиныйНалог

КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере(ЕстьЕдиныйНалог = Неопределено)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСведенияОбОрганизации(ОбработкаОбьект.Организация, ТекущаяДата(), ЕстьЕдиныйНалог);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.СписокДокументов Цикл
		СтрокаТЧ.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.СписокДокументов Цикл
		СтрокаТЧ.Флажок = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСписокНалоговыхДокументовНажатие(Элемент)
	
	Если Найти("BASR,AAA", Объект.ИдКонф) > 0 Тогда
		СообщениеПользователю(НСтр("ru = 'Данный вид документа отсутствует в вашей конфигурации.'; 
		 |uk='Даний вид документа відсутній у вашій конфігурації.'"), Ложь);
		Возврат	
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);
	УстановитьТекВидОперации("НН");
	ВидимостьФлагСчетИзЗаказа()

КонецПроцедуры

&НаКлиенте
Процедура ТекстПараметрыОтправкиНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТекстРеестрППНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьГруппы(Команда)
	
	Если Команда = Истина Тогда
		Объект.ГруппаКартинокРазделовСвернута = Истина;	
	Иначе	
		Объект.ГруппаКартинокРазделовСвернута = НЕ Объект.ГруппаКартинокРазделовСвернута;
	КонецЕсли;
	
	Для Каждого Раздел Из Элементы.ПанельРазделов.ПодчиненныеЭлементы Цикл
		Если Лев(Раздел.Имя,2) <> "Гр" Тогда
			Продолжить;
		КонецЕсли;	
		Раздел.ПодчиненныеЭлементы[0].Видимость = НЕ Объект.ГруппаКартинокРазделовСвернута;
	КонецЦикла;
	
	Элементы.КнопкаСвернутьРазвернутьГруппы.Картинка = ?(НЕ Объект.ГруппаКартинокРазделовСвернута, Элементы.КартинкаСтрелкаВверх.Картинка, Элементы.КартинкаСтрелкаВниз.Картинка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеСтатуса(Аторизован, ИмяПользователя = Неопределено)

	//Аторизован - картинка слева//ИмяПользователя заполнено из ПаперЛесс (авторизация/отправка)
	ВидимостьСтатусаАвторизацииМодуля = Не Элементы.ПанельОбластей.ТекущаяСтраница.Имя = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблВыгрузкаPDF.Имя;
	Если Аторизован Тогда
		Если ЗначениеЗаполнено(ИмяПользователя) Тогда
			//паперлесс
			Элементы.КартинкаНетАвторизации.Видимость = Ложь;
			Элементы.КартинкаЕстьАвторизация.Видимость = Истина
		Иначе
			//остальной функционал
			Элементы.КартинкаНетАвторизации1.Видимость = Ложь;
			Элементы.КартинкаЕстьАвторизация1.Видимость = ВидимостьСтатусаАвторизацииМодуля//Истина
		КонецЕсли;
		Элементы.ТекстСтатусАвторизации.Заголовок = НСтр("ru='Подключено: ';uk='Підключено: '") + Объект.Организация;
		Элементы.ТекстСтатусАвторизации.ЦветТекста = Новый Цвет(0, 110, 0); //зеленый
		
		Если НЕ Объект.ГруппаКартинокРазделовСвернута Тогда
			МассивЭкранов = ПолучитьИнформациюЭкрановКлиента();
			Для Каждого СтрокаМассива Из МассивЭкранов Цикл
				Если СтрокаМассива.Высота < 769 Тогда
					СвернутьРазвернутьГруппы(Истина);
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	Иначе
		//не авторизован
		Если ЗначениеЗаполнено(ИмяПользователя) Тогда
			//паперлесс
			Элементы.КартинкаЕстьАвторизация.Видимость = Ложь;
			Элементы.КартинкаНетАвторизации.Видимость = Истина
		Иначе
			//остальной функционал
			Элементы.КартинкаЕстьАвторизация1.Видимость = Ложь;
			Элементы.КартинкаНетАвторизации1.Видимость = ВидимостьСтатусаАвторизацииМодуля//Истина
		КонецЕсли;
		Элементы.ТекстСтатусАвторизации.Заголовок = НСтр("ru='Требуется авторизация для предприятия ';uk='Потрібна авторизація для підприємства '")
			+ Объект.Организация;
		Элементы.ТекстСтатусАвторизации.ЦветТекста = Новый Цвет(208, 53, 86); //красный
		Если Не Объект.UnitТест Тогда
			ИндексТекСтрокиТокены = ПолучитьИндексТекСтрокиТокеныКомпанийНаСервере(Объект.Организация);
			Если ИндексТекСтрокиТокены <> Неопределено Тогда
				Элементы.ТокеныКомпаний.ТекущаяСтрока = ИндексТекСтрокиТокены
			КонецЕсли
		КонецЕсли
	КонецЕсли;	

	УстановитьВидимостьПолейТокенАвторизации();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексТекСтрокиТокеныКомпанийНаСервере(Организация)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ИндексОрганизации = ОбработкаОбьект.ПолучитьИндексТекСтрокиТокеныКомпаний(Организация);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	Возврат ИндексОрганизации
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
	
	Элементы.ПротоколПрокси.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.НеИспользоватьПроксиДляЛокальныхАдресов.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.ГруппаАдресПорт.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.ГруппаПроксиПользовательПароль.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.КнопкаПолучитьПараметрыПрокси.Видимость = Объект.ФлажокИспользоватьПрокси
	
КонецПроцедуры

//установка параметров прокси из ОС и по умолчанию
&НаСервере
Процедура УстановкаПараметровПроксиНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.УстановкаПараметровПрокси(); 
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВходящиеДокументыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.СоздатьИмпортированныеДокументы(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВходящиеДокументы(Команда)

	СоздатьВходящиеДокументыНаСервере()

КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеТокенаОрганизацииНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	НаличиеТокенаОрганизации = ОбработкаОбьект.ПроверитьНаличиеТокенаОрганизации();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	Возврат НаличиеТокенаОрганизации

КонецФункции

&НаКлиенте
Процедура ПереключитьПоказатьСообщениеНеАвторизовано()

	ЕстьТокен = ПроверитьНаличиеТокенаОрганизацииНаСервере();
	Если Не ЕстьТокен Тогда
		ПереключитьРаздел(Элементы.ГрНастройки, Ложь);
		ПереключитьРабочуюОбласть(Элементы.ТекстАвторизация);
		СообщениеПользователю(НСтр("ru = 'Для работы требуется авторизация. Укажите токен для выбранной организации ';uk='Для роботи потрібна авторизація. Вкажіть токен для обраної організації '") + Объект.Организация, Ложь);
	КонецЕсли;
	ОбновитьОтображениеСтатуса(ОпределитьСостояниеАвторизовано());
	УстановитьВидимостьСтатусаАвторизацииМодуля(ЕстьТокен)

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтатусаАвторизацииМодуля(ЕстьТокен)

	ВидимостьСтатусаАвторизацииМодуля = Не Элементы.ПанельОбластей.ТекущаяСтраница.Имя = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблВыгрузкаPDF.Имя;
	Элементы.КартинкаЕстьАвторизация1.Видимость = ВидимостьСтатусаАвторизацииМодуля И ЕстьТокен;
	Элементы.КартинкаНетАвторизации1.Видимость = ВидимостьСтатусаАвторизацииМодуля И Не ЕстьТокен;
	Элементы.ТекстСтатусАвторизации.Видимость = ВидимостьСтатусаАвторизацииМодуля
	
КонецПроцедуры

&НаСервере
Функция ИмпортПлатежейНаСервере()

	ВыпВЦикле = Ложь;
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ИмпортПлатежей(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ИмпортПлатежей(Команда)

	Если Объект.ИмпортПлатежныеДокументы.Количество() <> 0 И Не Объект.UnitТест Тогда
		
		ТекстВопроса = НСтр("ru = 'Табличная часть по платежным документам будет очищена. Продолжить?'; uk='Таблична частина з платіжними документами буде очищена. Продовжити?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросИмпортПлатежей", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		
	Иначе	

		//оптимизация вызовов клиент-сервер
		НачалаОперацииВыполнятьТолькоНаСервере();

		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;

		ВыпВЦикле = ИмпортПлатежейНаСервере();
		
		Элементы.ГруппаКартИТекстОжидания.Видимость = ВыпВЦикле;
		
		Если ВыпВЦикле Тогда
			ЗапаснойСчетчикНаВыходИзЦикла = 0;
			ПодключитьОбработчикОжидания("ИмпортПлатежейВЦикле", 2);

			//оптимизация вызовов клиент-сервер
		Иначе
			ОкончаниеОперацииВыполнятьТолькоНаСервере()

		КонецЕсли;
		
	КонецЕсли;

	Если Не Объект.UnitТест И Объект.ФлажокВыводитьОстаткиПлатежи Тогда
		ОбновитьОстатки(Неопределено)
	КонецЕсли;

КонецПроцедуры

//оптимизация вызовов клиент-сервер
&НаКлиенте
Процедура НачалаОперацииВыполнятьТолькоНаСервере()

	Если Объект.РежимОтладки И (Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Количество() > 1 Или Объект.Это1cnik) Тогда
		Объект.ВремяНачалаОперацииВыполнятьТолькоНаСервере = ТекущаяДата();
		ТекстСообщения = Строка(Объект.ВремяНачалаОперацииВыполнятьТолькоНаСервере)
			+ НСтр("ru=' Начало измерения ФлагВыполнятьТолькоНаСервере = ';uk=' Початок виміру ФлагВыполнятьТолькоНаСервере = '")
			+ Объект.ФлагВыполнятьТолькоНаСервере;
		СообщениеПользователю(ТекстСообщения)
	КонецЕсли

КонецПроцедуры

//оптимизация вызовов клиент-сервер
&НаКлиенте
Процедура ОкончаниеОперацииВыполнятьТолькоНаСервере()

	Если Объект.РежимОтладки И (Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Количество() > 1 Или Объект.Это1cnik) Тогда
		ТекстСообщения = НСтр("ru='Окончание измерения ВремяНачалаОперацииВыполнятьТолькоНаСервере = ';uk='Закінчення виміру ВремяНачалаОперацииВыполнятьТолькоНаСервере = '")
			+ Строка(ТекущаяДата() - Объект.ВремяНачалаОперацииВыполнятьТолькоНаСервере) + "сек";
		СообщениеПользователю(ТекстСообщения)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВопросИмпортПлатежей(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		//оптимизация вызовов клиент-сервер
		НачалаОперацииВыполнятьТолькоНаСервере();

		Объект.ИмпортПлатежныеДокументы.Очистить();
		
		ВыпВЦикле = ИмпортПлатежейНаСервере();
		
		Если ВыпВЦикле Тогда
			Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
			ЗапаснойСчетчикНаВыходИзЦикла = 0;
			ПодключитьОбработчикОжидания("ИмпортПлатежейВЦикле", 2);

			//оптимизация вызовов клиент-сервер
		Иначе
			ОкончаниеОперацииВыполнятьТолькоНаСервере()

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ИмпортПлатежейВЦикле()
	
	ЗапаснойСчетчикНаВыходИзЦикла = ЗапаснойСчетчикНаВыходИзЦикла + 1;
	Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
	ВыпВЦикле = ИмпортПлатежейНаСервере();
	Элементы.ГруппаКартИТекстОжидания.Видимость = ВыпВЦикле;
	
	Если НЕ ВыпВЦикле ИЛИ ЗапаснойСчетчикНаВыходИзЦикла = 10000 Тогда
		Если ЗапаснойСчетчикНаВыходИзЦикла = 10000 Тогда
			СообщениеПользователю(НСтр("ru='Выполнение прервано принудительно';uk='Виконання перервано примусово'") + Символы.ПС + ОписаниеОшибки(), Ложь);
		КонецЕсли;
		
		ЗапаснойСчетчикНаВыходИзЦикла = 0;
		ОтключитьОбработчикОжидания("ИмпортПлатежейВЦикле");

		//оптимизация вызовов клиент-сервер
		ОкончаниеОперацииВыполнятьТолькоНаСервере();

		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		Если Не Объект.UnitТест И Объект.ФлажокВыводитьОстаткиПлатежи Тогда
			ОбновитьОстатки(Неопределено);
			ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
		КонецЕсли
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ПоддерживаетсяTLS12()
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если СравнитьВерсии(СисИнфо.ВерсияПриложения, "8.3.8.2054") < 0 Тогда
		
		ТекстСообщения = НСтр("ru='Версия Вашей платформы не поддерживает работу с безопасным интернет соединением по протоколу TLS 1.2. Дальнейшая работа возможна после обновления на платформу 8.3.8.2054 и выше или при использовании Курл.';
		 |uk='Версія Вашої платформи не підтримує роботу з безпечним інтернет з'єднанням по протоколу TLS 1.2. Подальша робота можлива після поновлення на платформу 8.3.8.2054 і вище або при використанні Курл.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗапущеноПодWindows()
	
	СисИнфо = Новый СистемнаяИнформация;
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка1, ".");//Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		//ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//	НСтр("ru='Неправильный формат параметра СтрокаВерсии1: %1';uk='Неправильний формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
		СообщениеПользователю(НСтр("ru='Неправильный формат параметра СтрокаВерсии1: ';uk='Неправильний формат параметра СтрокаВерсии1: '")
			+ СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка2, ".");//Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		//ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//	НСтр("ru='Неправильный формат параметра СтрокаВерсии2: %1';uk='Неправильний формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
		СообщениеПользователю(НСтр("ru='Неправильный формат параметра СтрокаВерсии2: ';uk='Неправильний формат параметра СтрокаВерсии2: '")
			+ СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     - если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые строки;
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  РазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьЗаголовокФормы()

	ОбработкаОбьект = Объект;
	СисИнфо = Новый СистемнаяИнформация;
	ЭтаФорма.Заголовок = НСтр("ru='Модуль обмена с Приват24';uk='Модуль обміну з Приват24'") + " " + ОбработкаОбьект.ТекВерсия + ", "
		+ Объект.ИдКонф + " " + Метаданные.Версия + ", " + ?(ОбработкаОбьект.ЭтоПлатформаBAF, "BAF ", "") + СисИнфо.ВерсияПриложения
		+ " сервер " + Объект.ИнтернетАдресДляСоединения + ", " + СисИнфо.ТипПлатформы + " " + СисИнфо.ВерсияОС;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Попытка

		Для Каждого Эл Из Элементы Цикл
			Если (ТипЗнч(Эл) = Тип("ПолеФормы"))
				И (Эл.Вид=ВидПоляФормы.ПолеКартинки) Тогда
			Иначе
				Продолжить;    
			КонецЕсли;
			Если (ТипЗнч(Эл.Родитель)=Тип("ГруппаФормы"))И(Эл.Родитель.Вид=ВидГруппыФормы.ГруппаКолонок) Тогда
				Эл.Видимость = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Параметры.Свойство("ДополнительнаяОбработкаСсылка", ОбъектСсылка);
		
		Объект.ИдКонф = ИДКонфигурации();
		Объект.ПолноеИмяКонфигурации = ПолноеИмяКонфигурации();

		ОбработкаОбьект = РеквизитФормыВЗначение("Объект");

		ОбработкаОбьект.БазовоеИмяФайла = "Privat24to1CManaged";
		ОбработкаОбьект.РасширениеФайла = ".epf";

		ОбработкаОбьект.ПоддерживаетсяTLS12 = ПоддерживаетсяTLS12();
		ОбработкаОбьект.ЭтоВебКлиент = ЭтоВебКлиент();

		Если Найти(ЭтаФорма.ИмяФормы, "Внешняя") <> 0 И Не ОбработкаОбьект.ЭтоВебКлиент И ЗапущеноПодWindows() Тогда
					
			ОбработкаОбьект.ОбработкаВнешняя = Истина;
			
			//Если НЕ ОбработкаОбьект.ПоддерживаетсяTLS12 Или ОбработкаОбьект.ФлажокИспользоватьКурлВсегда Тогда//на случай включения Курл в тек.сеансе
				ОбработкаОбьект.ЭтоWindows = ЗапущеноПодWindows();
				ОбработкаОбьект.ЗаписатьФайлыВнешнихКомпонент();
				Элементы.ПутьКурл.Видимость = Истина;
			//КонецЕсли;
					
		ИначеЕсли НЕ ОбработкаОбьект.ПоддерживаетсяTLS12 И Не Объект.ФлажокИспользоватьКурлВсегда Тогда
			ТекстСообщения = НСтр("ru='Версия Вашей платформы не поддерживает работу с безопасным интернет соединением по протоколу TLS 1.2. Дальнейшая работа возможна после обновления на платформу 8.3.8.2054 и выше.';
				|uk='Версія Вашої платформи не підтримує роботу з безпечним інтернет з'єднанням по протоколу TLS 1.2. Подальша робота можлива після оновлення на платформу 8.3.8.2054 і вище.'");
			Если Не ОбработкаОбьект.ЭтоВебКлиент И ЗапущеноПодWindows() Тогда
				ТекстСообщения = ТекстСообщения + НСтр("ru=' или включения флажка `Использовать курл всегда`.';
					|uk=' або увімкнення прапорця `Використовувати курл завжди`.'");
				СообщениеПользователю(ТекстСообщения, Ложь);
				Отказ = Истина
			Иначе
				СообщениеПользователю(ТекстСообщения, Ложь);
				Отказ = Истина;
				Возврат
			КонецЕсли;
		КонецЕсли;	
		
		АдресБазы = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		Если Найти(АдресБазы, "pb.ua") > 0 ИЛИ Найти(АдресБазы, "privatbank.ua") > 0 ИЛИ Найти(АдресБазы, "1cnik.net") > 0
				Или Найти(АдресБазы, "bo.in.ua") > 0 Тогда
			ОбработкаОбьект.РаботаВМоделиСервисаПБ = Истина;
		КонецЕсли;
			
		ОбработкаОбьект.ИнициализироватьНачальныеПараметры();
		ОбработкаОбьект.ЗаполнитьПоляПоиска();
		ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
		
		ВосстановитьНастройкиФормы();

		ОбработкаОбьект.ЭтоWindows = ЗапущеноПодWindows();
		ОбработкаОбьект.ЭтоMacOS = ОбработкаОбьект.ЭтоMacOS();
		ОбработкаОбьект.ЭтоLinuxСервер = ОбработкаОбьект.ЭтоLinuxСервер();

		ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
		
		ОбработкаОбьект.ТекущийИДКлиентаГруппыЧП = "";

		Если НЕ ОбработкаОбьект.РаботаВМоделиСервисаПБ Тогда

			//Если НЕ Параметры.Свойство("ОткрытиеПослеОбновления") Тогда//проверяется при старте и каждые 4ч
			//	//проверяем минимально допустимую версию
			//	стТребуетсяОбновление = ОбработкаОбьект.ПроверкаОбновления(Истина);
			//	ТребуетсяОбновление = стТребуетсяОбновление.ТребуетсяОбновление;
			//	Объект.АктуальнаяВерсия = стТребуетсяОбновление.АктуальнаяВерсия
			//КонецЕсли;
			ТребуетсяОбновление = Ложь;
			
			ОбработкаОбьект.ТекВерсия = ОбработкаОбьект.ТекВерсия + "l";
			
		Иначе
			Элементы.ГруппаОбновленияИСайт.Видимость = Ложь;
			ТребуетсяОбновление = Ложь
		КонецЕсли;

		// BASC, AAA
		НазваниеСправочникаСчета = "БанковскиеСчета";
		Если Найти("UT_3,ERP,BASR,BSB", Объект.ИдКонф) <> 0 Тогда	
			НазваниеСправочникаСчета = "БанковскиеСчетаОрганизаций";
		ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
			НазваниеСправочникаСчета = "РасчетныеСчета";
		КонецЕсли;
		Попытка
			ДлинаНомераСчета = Метаданные.Справочники[НазваниеСправочникаСчета].Реквизиты.НомерСчета.Тип.КвалификаторыСтроки.Длина;
		Исключение
		КонецПопытки;

		ОбработкаОбьект.ЭтоПлатформаBAF = ЭтоПлатформаBAF();

		СисИнфо = Новый СистемнаяИнформация;

		ОбновитьЗаголовокФормы();

		СписокДок = Параметры.СписокСсылокНаДокументы;
		
		Если СписокДок.Количество() > 0 Тогда
			Для Каждого СтрокаСписка Из СписокДок Цикл
				
				СсылкаНаДок = СтрокаСписка.Значение;
				ИмяДок = СсылкаНаДок.Метаданные().Имя;
				
				ТекВид = "Счета";
				
				Если Найти(ИмяДок, "Акт") > 0 Тогда
					ТекВид = "Акты";
				КонецЕсли;
			
				Если Найти(ИмяДок, "РеализацияТоваровУслуг") > 0 Тогда
					Если СсылкаНаДок.Товары.Количество() > 0 Тогда	
						ТекВид = "Расходные";		
					Иначе	
						ТекВид = "Акты";
					КонецЕсли;
				КонецЕсли;
				
				Если Найти(ИмяДок, "Заказ") > 0 Тогда
					ТекВид = "Заказы";
				КонецЕсли;	
							
				ОбработкаОбьект.ТекВидОперации = ТекВид;
				
				Если Объект.ИдКонф = "UNF" ИЛИ Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Или Объект.ИдКонф = "BSB" Тогда
					ОбработкаОбьект.UNF_BP_ЗаполнитьФинДок(ТекущаяДата(), ТекущаяДата(), СсылкаНаДок);
				ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
					ОбработкаОбьект.UT_3_ЗаполнитьФинДок(ТекущаяДата(), ТекущаяДата(), СсылкаНаДок);
				ИначеЕсли Объект.ИдКонф = "BASR" Тогда
					ОбработкаОбьект.BASR_ЗаполнитьФинДок(ТекущаяДата(), ТекущаяДата(), СсылкаНаДок)
				ИначеЕсли Объект.ИдКонф = "AAA" Тогда
					ОбработкаОбьект.AAA_ЗаполнитьФинДок(ТекущаяДата(), ТекущаяДата(), СсылкаНаДок)
				ИначеЕсли Объект.ИдКонф = "UABY" Тогда
					ОбработкаОбьект.UABY_ЗаполнитьФинДок(ТекущаяДата(), ТекущаяДата(), СсылкаНаДок)
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ОбработкаОбьект.ТекВидОперации) Тогда
			ОбработкаОбьект.ТекВидОперации = "Налоговые"
		КонецЕсли;

		ОбработкаОбьект.ИспользоватьТокены = Истина;
		
		Если Объект.ИспользоватьТокены Тогда
			ОбработкаОбьект.Авторизовано = Истина;
		КонецЕсли;
			
		ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

		ЗаполнитьСтатусыЭДО();
		ЗаполнитьДопСтатусыЭДО();

		//ПросмотрДокЭДО
		////ОбработкаОбьект.тзНовыйДокФин.Колонки.Добавить("НовыйДок")

		Объект.СписокДопустимыхДляПодписиСтатусов = НСтр("ru='Проверен и сохранен (в работе)';uk='Перевірений та збережений (в роботі)'")
			+ "," + НСтр("ru = 'Подписан получателем';uk = 'Підписаний отримувачем'")
			+ "," + НСтр("ru = 'Подписан контрагентом'z;uk = 'Підписаний контрагентом'") + "," + НСтр("ru = 'В работе';uk = 'В роботі'");
		Объект.СписокДопустимыхДляПодписиСтатусовPDFДок = НСтр("ru = 'Есть дубли';uk = 'Є дублі'");

	Исключение
		ТекстОписаниеОшибки = "Ошибка открытия, этап 3: " + ОписаниеОшибки();
		СообщениеПользователю(НСтр("ru = 'Ошибка при открытии: ';uk='Помилка при відкритті: '") + ТекстОписаниеОшибки);
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопСтатусыЭДО()

	Объект.сзДопСтатусыЭДО.Очистить();
	Объект.сзДопСтатусыЭДО.Добавить(НСтр("ru='Неизвестный доп.статус';uk='Невідомий дод.статус'"), НСтр("ru='Неизвестный доп.статус';uk='Невідомий дод.статус'"));//(0)
	Объект.сзДопСтатусыЭДО.Добавить("PAYMENT_WAS_CREATED", НСтр("ru='Создан платеж';uk='Створений платіж'"));//1
	Объект.сзДопСтатусыЭДО.Добавить("PAYMENT_WAS_BLOCKED", НСтр("ru='Возвращен платеж';uk='Повернений платіж'"));//2
	Объект.сзДопСтатусыЭДО.Добавить("PAYMENT_WAS_PAYED", НСтр("ru='Оплачен платеж';uk='Оплачений платіж'"));//3
	Объект.сзДопСтатусыЭДО.Добавить("PAYMENT_WAS_DELETED", НСтр("ru='Удален платеж';uk='Видалений платіж'"));//4

КонецПроцедуры

//запасной вариант
//&НаКлиенте
//#Если ВебКлиент Тогда
//Функция ЭтоВебКлиентПО()
//	Возврат Истина
//КонецФункции
//#Иначе
//Функция ЭтоВебКлиентПО()
//	Возврат Ложь
//КонецФункции
//#КонецЕсли

&НаСервере
Функция ЭтоВебКлиент()

	Попытка
		//БСП
		Возврат (ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ЭтоВебКлиент") = Истина)

	Исключение
		Попытка
			//БУ2, АГРОБух, АГРО_БЭМКЗ, BASsc, BASCorp, BASRetail, BASIEM, ERP, BASКомпУпрПредпр(BASIEM), УНФ, ДокументоОборотКорп2
			Возврат ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент()

		Исключение
			Попытка
				//BASsc, BASscProf+FlyDoc
				Возврат ОбщегоНазначения.ЭтоВебКлиент()

			Исключение
				//УТ3, ОСМД, ОП - нет 
				Попытка
					Соединения = ПолучитьСоединенияИнформационнойБазы();
				Исключение
					Соединения = Новый Массив
				КонецПопытки;
				
				ТекущееСоединение = Неопределено;
				НомерСоед = НомерСоединенияИнформационнойБазы();
				
				Для Каждого СтрокаСоединения Из Соединения Цикл
					Если СтрокаСоединения.НомерСоединения = НомерСоед Тогда
						ТекущееСоединение = СтрокаСоединения.ИмяПриложения;
						Прервать;
					КонецЕсли;	
				КонецЦикла;	

				Если ТекущееСоединение = Неопределено Тогда
					Возврат Объект.ЭтоВебКлиент
				КонецЕсли;

				Возврат Найти(ТекущееСоединение, "Web") <> 0

			КонецПопытки
		КонецПопытки
	КонецПопытки

КонецФункции

&НаСервере
Функция ПолноеИмяКонфигурации() Экспорт
	
	Возврат Метаданные.Имя;
	
КонецФункции	

&НаСервере
Функция ИДКонфигурации() Экспорт
	
	ИДКонфигурации = Метаданные.Имя;
	
	Если Найти(ВРег(ИДКонфигурации), ВРег("ERPforUkraine")) > 0 ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASERP")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASКомплексноеУправлениеПредприятием")) > 0//BASIEM
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASIEM_ЗаполнитьДанныеРЛ")) > 0 Тогда
		Возврат "ERP";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("BASБухгалтерияКОРП")) > 0 Тогда
		Возврат "BASC"
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("БухгалтерияДляУкраины")) > 0 
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("БухгалтерияСельскохозяйственногоПредприятия")) > 0  
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("БухгалтерияСтроительнойОрганизации")) > 0 
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASБух")) > 0
			Или Найти(ВРег(ИДКонфигурации), ВРег("BASБухгалтерия")) > 0//не тест
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("ОбщепитУкр1С")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("КомплексноеРешениеСельскохозяйственногоПредприятия")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASBBO")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASАгроБухгалтерия")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASPublicCatering")) > 0
			Или Найти(ВРег(ИДКонфигурации), ВРег("BASБухгалтерияЭлеватораМельницыИКомбикормовогоЗавода")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASPB")) > 0//Business Automation Software for Construction. Financial Management
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASPBCORP")) > 0//Business Automation Software for Construction. Financial Management CORP
			Или Найти(ВРег(ИДКонфигурации), ВРег("BASRent")) > 0 Или Найти(ВРег(ИДКонфигурации), ВРег("BASRentCORP")) > 0//BAS Оренда та управління нерухомістю КОРП
			Тогда
		Возврат "BP";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("ЗарплатаИУправлениеПерсоналомДляУкраины")) > 0 Тогда
		Возврат "ZUP";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("УправлениеПроизводственнымПредприятиемДляУкраины")) > 0 Тогда
		Возврат "UPP";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("УправлениеТорговымПредприятиемДляУкраины")) > 0 Тогда
	    Возврат "UTP";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("BASРозничнаяТорговля")) > 0 Тогда
	    Возврат "BASR";
	ИначеЕсли (Найти(ВРег(ИДКонфигурации), ВРег("УправлениеТорговлейДляУкраины")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("BASУправлениеТорговлей")) > 0) И Лев(Метаданные.Версия,1) = "3" Тогда
	    Возврат "UT_3";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("УправлениеТорговлейДляУкраины")) > 0 И Лев(Метаданные.Версия,1) = "2" Тогда
	    Возврат "UT_2";	
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("BASSmallBusiness")) > 0
			Или Найти(ВРег(ИДКонфигурации), ВРег("BASSmallBusinessFlyDoc")) > 0 Тогда
	    Возврат "BSB";	
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("УправлениеНебольшойФирмойДляУкраины")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("УНФ")) > 0
			ИЛИ Найти(ВРег(ИДКонфигурации), ВРег("УправлениеШвейнымПроизводствомДляУкраины")) > 0
			Тогда
	    Возврат "UNF";		
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("КомплексныйУчетДляБюджетныхУчрежденийУкраины")) > 0 Тогда
		Возврат "KUBU";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("UAБюджет")) > 0 Или Найти(ВРег(ИДКонфигурации), ВРег("УчетБюджетногоУчреждения")) > 0 Тогда
		Возврат "UABY"
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("УчетВОСМДдляУкраины")) > 0 Тогда
		Возврат "OSMD";
	ИначеЕсли Найти(ВРег(ИДКонфигурации), ВРег("Автосалон6ДляУкраины")) > 0 Тогда
		Возврат "AAA"
	Иначе
		Возврат ИДКонфигурации;
	КонецЕсли;
	
КонецФункции // ИДКонфигурации()

&НаСервере
Функция ВыполнитьКомандуНапрямую(ИдентификаторКоманды, ПараметрыКоманды)
	
	Возврат ДополнительныеОтчетыИОбработки.ВыполнитьКомандуИзФормыВнешнегоОбъекта(ИдентификаторКоманды, ПараметрыКоманды, ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура БанковскийСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПроверкаЗаполненияБанка();
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Банк) Тогда
		ПараметрыФормы = Новый Структура("РежимВыбора, ТекущаяСтрока, Отбор", Истина, Объект.БанковскийСчет, Новый Структура("Банк, Владелец",Объект.Банк, Объект.Организация))
	Иначе
		ПараметрыФормы = Новый Структура("РежимВыбора, ТекущаяСтрока, Отбор", Истина, Объект.БанковскийСчет, Новый Структура("гвФОП", Объект.Организация))
	КонецЕсли;

	Попытка
		
		Если Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Или Объект.ИдКонф = "BASR" Тогда
			ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("БанковскийСчетНачалоВыбораЗавершение", ЭтаФорма));	
		ИначеЕсли Объект.ИдКонф = "UABY" Тогда
			ОткрытьФорму("Справочник.РасчетныеСчета.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("БанковскийСчетНачалоВыбораЗавершение", ЭтаФорма));	
		Иначе
			//	BSB, BASC, AAA, ...
			ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("БанковскийСчетНачалоВыбораЗавершение", ЭтаФорма));	
		КонецЕсли;
	
	Исключение
		
		Если Найти("UT_3,ERP,BASR", Объект.ИдКонф) > 0 Тогда
			ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.ФормаВыбора", ПараметрыФормы)
		ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
			ОткрытьФорму("Справочник.РасчетныеСчета.ФормаВыбора", ПараметрыФормы)
		Иначе
			//	BSB, BASC, AAA, ...
			ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы);
		КонецЕсли;
		
	КонецПопытки;	
	
КонецПроцедуры //ИмпортБанковскийСчетНачалоВыбора()

&НаКлиенте
Процедура БанковскийСчетНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.БанковскийСчет = Результат;
		
	КонецЕсли;
	
КонецПроцедуры // ИмпортБанковскийСчетНачалоВыбораЗавершение()

&НаКлиенте
Процедура ИмпортПлатежныеДокументыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	ПроцентНДС = СтрокаТабличнойЧасти.СтавкаНДС.Ставка;
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма * ПроцентНДС / (ПроцентНДС + 1);
									 
КонецПроцедуры //ИмпортПлатежныеДокументыСтавкаНДСПриИзменении()

&НаКлиенте
Процедура ТекстПараметрыИмпортаПталежейНажатие(Элемент)

	ИмяОбластиВозврата = Элементы.ПанельОбластей.ТекущаяСтраница;
	ИмяЗаголовкаВозврата = Элементы.РабочаяОбласть.Заголовок;

	вТекущийЭлемент = Элементы[мИмяТекЭлемента];
	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элементы.ТекстПараметрыОбмена);

КонецПроцедуры //ТекстПараметрыИмпортаПталежейНажатие()

&НаКлиенте
Процедура ТекстПараметрыИмпортаЭДОНажатие(Элемент)

	ИмяОбластиВозврата = Элементы.ПанельОбластей.ТекущаяСтраница;
	ИмяЗаголовкаВозврата = Элементы.РабочаяОбласть.Заголовок;

	вТекущийЭлемент = Элементы[мИмяТекЭлемента];
	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элементы.ТекстПараметрыОбменаФинДок);

КонецПроцедуры //ТекстПараметрыИмпортаПталежейНажатие()

&НаКлиенте
Процедура ТекстПараметрыЗПНажатие(Элемент)

	ИмяОбластиВозврата = Элементы.ПанельОбластей.ТекущаяСтраница;//.Имя;
	ИмяЗаголовкаВозврата = Элементы.РабочаяОбласть.Заголовок;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ТекстЗПНажатие(Элемент)

	ТекущийЭлемент = Элемент;

	ПереключитьРабочуюОбласть(ИмяОбластиВозврата,, ИмяЗаголовкаВозврата, Истина);
	ИмяОбластиВозврата = "";
	ИмяЗаголовкаВозврата = ""

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОбменаДоп(Элемент)
	
	Если Элементы.ПанельРазделов.ПодчиненныеЭлементы[0].Отображение = ОтображениеОбычнойГруппы.СильноеВыделение Тогда //если активен первый раздел - обмен платежами
		ТекущийЭлемент = Элементы.ТекстПараметрыОбмена;
	Иначе	
		ТекущийЭлемент = Элементы.ТекстПараметрыОбменаФинДок;
	КонецЕсли;

	ИмяОбластиВозврата = Элементы.ПанельОбластей.ТекущаяСтраница;
	ИмяЗаголовкаВозврата = Элементы.РабочаяОбласть.Заголовок;
	вТекущийЭлемент = Элементы[мИмяТекЭлемента];

	ПереключитьРабочуюОбласть(Элементы.ТекстПараметрыОбмена);
	
КонецПроцедуры //ПараметрыОбменаДоп()

&НаКлиенте
Процедура ИмпортПлатежныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ИмпортПлатежныеДокументыВидДокумента" ИЛИ Поле.Имя = "ИмпортПлатежныеДокументыНомер" Тогда
		ОткрытьДокумент(Элементы.ИмпортПлатежныеДокументы.ТекущиеДанные);
	ИначеЕсли Поле.Имя = "ИмпортПлатежныеДокументыНомерСтроки" Тогда
		Если ЗначениеЗаполнено(Элементы.ИмпортПлатежныеДокументы.ТекущиеДанные.ТекстОшибки) Тогда
			СообщениеПользователю(Элементы.ИмпортПлатежныеДокументы.ТекущиеДанные.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ИмпортПлатежныеДокументыВыбор()

&НаСервере
Функция ПолучитьТекстXMLПоФинДокНаСервере(ТДДокИД)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	XMLФинДок = ОбработкаОбьект.ПолучитьТекстXMLПоФинДок(ТДДокИД);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат XMLФинДок

КонецФункции

&НаСервере
Процедура ЗаполнитьСсылкуНаФинДокНаСервере(ТипДок, ТД)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСсылкуНаФинДок(ТипДок, ТД);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция МетаданныеИмяОбъектаНаСервере(НазваниеОбъекта)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ТекстОтвета = ОбработкаОбьект.МетаданныеИмяОбъекта(НазваниеОбъекта);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат ТекстОтвета

КонецФункции

&НаКлиенте
Процедура ОткрытьДокумент(ТД, ЭлементИмя = Неопределено)

	ТекДок = ТД.СсылкаНаДокумент;

	Если НЕ ЗначениеЗаполнено(ТекДок) Тогда

		//ПросмотрДокЭДО
		ТекстСообщения = НСтр("ru = 'Для просмотра документ необходимо записать.'; uk='Для перегляду документ необхідно записати.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат;
	КонецЕсли;

	Док = Новый Структура;
    Док.Вставить("Ключ", ТекДок);

	ОписаниеОповещения = Неопределено;
	ДокументНайден = Ложь;
	Для каждого ЭлементСписка Из Элементы.ВидДокументаPDF.СписокВыбора Цикл
		Если ЭлементСписка.Представление = Строка(ТипЗнч(ТекДок)) Тогда
			ДокументНайден = Истина;
			Прервать
		КонецЕсли
	КонецЦикла;
	Если ДокументНайден Тогда
		ВерсияДанных = ПолучитьВерсияДанныхДокументаСервер(ТД.СсылкаНаДокумент);
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВерсияДанных", ВерсияДанных);
		ДопПараметры.Вставить("ТЧ", ЭлементИмя);//СписокЭкспортаPDF");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПереЗаполнитьСписокДокументовЗавершение", ЭтаФорма, ДопПараметры)
	КонецЕсли;

	Попытка
		Если НЕ ЗначениеЗаполнено(ТекДок) Тогда
			врем = 0/0
		КонецЕсли;
		//	документ записан
		Если Найти("UABY", Объект.ИдКонф) > 0 Тогда
			Если ТД.ИмяДокумента = "БанковскаяВыписка" Тогда
				ТДИмяДокумента = "ПлатежноеПоручение"
			ИначеЕсли Найти("Счет,Пост,Полу,Реал", Лев(ТД.ИмяДокумента, 4)) > 0 Тогда
				ТДИмяДокумента = ТД.ИмяДокумента
			ИначеЕсли Найти("ВедомостьНаВыплатуЗарплатыВБанк,ВедомостьНаВыплатуЗарплатыПеречислением", Лев(ТД.ИмяДокумента, 4)) > 0 Тогда
				ТДИмяДокумента = "ВедомостьНаВыплатуЗарплатыПеречислением"
			Иначе
				ТДИмяДокумента = "ПлатежноеПоручение"
			КонецЕсли
		ИначеЕсли Найти("ERP,UNF,BSB", Объект.ИдКонф) > 0 Тогда
			Если Найти("Зака,Счет,Пост,Реал,АктВ,Расх", Лев(ТД.ИмяДокумента, 4)) > 0 Тогда
				ТДИмяДокумента = МетаданныеИмяОбъектаНаСервере(ТД.СсылкаНаДокумент)
			Иначе
				ТДИмяДокумента = ТД.ИмяДокумента
			КонецЕсли
		ИначеЕсли (Найти(ВРег(МетаданныеИмяНаСервере()), ВРег("BASRent")) > 0 Или Найти(ВРег(МетаданныеИмяНаСервере()), ВРег("BASRentCORP")) > 0)
				И ТипЗнч(Док.Ключ) = Тип("ДокументСсылка.АР_СчетНаАренду") Тогда
			ТДИмяДокумента = "АР_СчетНаАренду"
		Иначе
			ТДИмяДокумента = ТД.ИмяДокумента
		КонецЕсли;
		Если ОписаниеОповещения = Неопределено Тогда
			ОткрытьФорму("Документ." + СтрЗаменить(ТДИмяДокумента, "%", "") + ".ФормаОбъекта", Док)
		Иначе
			ОткрытьФорму("Документ." + СтрЗаменить(ТДИмяДокумента, "%", "") + ".ФормаОбъекта", Док,,,,, ОписаниеОповещения)//, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
		КонецЕсли
	Исключение
		Попытка
			Если ОписаниеОповещения = Неопределено Тогда
				ОткрытьФорму("Документ." + СтрЗаменить(ТДИмяДокумента, "%", "") + ".ФормаДокумента", Док)
			Иначе
				ОткрытьФорму("Документ." + СтрЗаменить(ТДИмяДокумента, "%", "") + ".ФормаДокумента", Док,,,,, ОписаниеОповещения)
			КонецЕсли
		Исключение
			Попытка
				Если ОписаниеОповещения = Неопределено Тогда
					ОткрытьФорму("Документ." + Строка(ТипЗнч(ТД.СсылкаНаДокумент)) + ".ФормаОбъекта", Док)
				Иначе
					ОткрытьФорму("Документ." + Строка(ТипЗнч(ТД.СсылкаНаДокумент)) + ".ФормаОбъекта", Док,,,,, ОписаниеОповещения)
				КонецЕсли
			Исключение
				Попытка
					Если ОписаниеОповещения = Неопределено Тогда
						ОткрытьФорму("Документ." + Строка(ТипЗнч(ТД.СсылкаНаДокумент)) + ".ФормаДокумента", Док)
					Иначе
						ОткрытьФорму("Документ." + Строка(ТипЗнч(ТД.СсылкаНаДокумент)) + ".ФормаДокумента", Док,,,,, ОписаниеОповещения)
					КонецЕсли
				Исключение
					Попытка
						Если ОписаниеОповещения = Неопределено Тогда
							ОткрытьФорму("Документ.ПоступлениеТоваровНаСклад.ФормаОбъекта", Док)
						Иначе
							ОткрытьФорму("Документ.ПоступлениеТоваровНаСклад.ФормаОбъекта", Док,,,,, ОписаниеОповещения)
						КонецЕсли
					Исключение
						//ПросмотрДокЭДО
						//////	документ не записан
						////Попытка
						////	//предварительный просмотр входящих фин.док.
						////	ТипДок = СтрЗаменить(ТД.ИмяДокумента, "%", "");
						////	////ЗаполнитьСсылкуНаФинДокНаСервере(ТипДок, ТД);
						////	//Если Не (ЗначениеЗаполнено(ТД.XML)
						////	//		И (ТД.СтатусДокумента = НСтр("ru='Подписан и отправлен';uk='Підписаний та відправлений'")
						////	//			Или ТД.СтатусДокумента = НСтр("ru = 'Подписан получателем';uk = 'Підписаний отримувачем'"))) Тогда
						////	Если Не ЗначениеЗаполнено(ТД.XML) Тогда
						////		ТД.XML = ПолучитьТекстXMLПоФинДокНаСервере(ТД.ИдДокумента);
						////		вСостояниеФлажка = ТД.Флажок;
						////		ТД.Флажок = Истина;
						////		ЗаписатьВходящиеФинДокБезЗаписиНаСервере(ТипДок);
						////		ТД.Флажок = вСостояниеФлажка
						////	КонецЕсли;
						////	//НовыйДок = Объект.тзНовыйДокФин[ТД.НомерСтроки - 1].НовыйДок;
						////	//Форма = НовыйДок.ПолучитьФорму();
						////	//Форма.ТолькоПросмотр = ТолькоПросмотр;
						////	//Форма.Открыть();
						////	ПолучитьИмяДок
						////	ОткрытьФорму("Документ." + СтрЗаменить(ТД.ИмяДокумента, "%", "") + ".ФормаОбъекта", Док)
						////Исключение
							//Если Объект.РежимОтладки Тогда
								СообщениеПользователю(НСтр("ru = 'Ошибка при открытии документа '; uk='Помилка при відкритті документа '") + ОписаниеОшибки())
							//КонецЕсли;
						////КонецПопытки//ПросмотрДокЭДО
					КонецПопытки
				КонецПопытки
			КонецПопытки
		КонецПопытки
	КонецПопытки;

КонецПроцедуры //ОткрытьДокумент()

&НаСервере
Процедура ЗаполнитьПлатежныеДокументыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокПлатежей(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерСчетаИМФОКонтрагентаПоДокументуНаСервере(СтрокаППИСсылкаНаДокумент)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	БанкКод = ОбработкаОбьект.ПолучитьНомерСчетаИМФОКонтрагентаПоДокументу(СтрокаППИСсылкаНаДокумент);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат БанкКод

КонецФункции

&НаКлиенте
Процедура ЗаполнитьПлатежныеДокументы(Команда)

	Если Объект.ЭкспортПлатежныеДокументы.Количество() <> 0 И Не Объект.UnitТест Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть по платежным документам будет очищена. Продолжить?'; uk='Таблична частина з платіжними документами буде очищена. Продовжити?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЭкспортПлатежей", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе

		ЗаполнитьПлатежныеДокументыНаСервере();
		ОпределитьИУстановитьВидимостьКолонокСтруктНП()

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокСтруктНП(ВидимостьКолонокСтруктНП)

	Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.ЭкспортПлатежныеДокументыstruct_code.Видимость = ВидимостьКолонокСтруктНП;
	Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.ЭкспортПлатежныеДокументыstruct_type.Видимость = ВидимостьКолонокСтруктНП;
	Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.ЭкспортПлатежныеДокументыstruct_category.Видимость = ВидимостьКолонокСтруктНП
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокВерующих(ВидимостьКолонокВерующих)

	Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.ЭкспортПлатежныеДокументыГруппа1.ПодчиненныеЭлементы.СерияПаспорта.Видимость = ВидимостьКолонокВерующих;
	Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.ЭкспортПлатежныеДокументыГруппа1.ПодчиненныеЭлементы.НомерПаспорта.Видимость = ВидимостьКолонокВерующих;
	Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.IDКарты.Видимость = ВидимостьКолонокВерующих
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЭкспортПлатежей(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ЭкспортПлатежныеДокументы.Очистить();
		
		ЗаполнитьПлатежныеДокументыНаСервере();
		ОпределитьИУстановитьВидимостьКолонокСтруктНП()
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ОпределитьУсловиеВерующихНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	УсловиеВерующих = ОбработкаОбьект.ОпределитьУсловиеВерующих();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат УсловиеВерующих

КонецФункции

&НаСервере
Функция  ЭтоКонтрагентЮрЛицоСервер(ДокументПлатеж)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	КонтрагентЮрЛицо = ОбработкаОбьект.ЭтоКонтрагентЮрЛицо(ДокументПлатеж);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат КонтрагентЮрЛицо

КонецФункции

&НаКлиенте
Процедура ОпределитьИУстановитьВидимостьКолонокСтруктНП()

	ВидимостьКолонокВерующих = ОпределитьУсловиеВерующихНаСервере();

	ВидимостьКолонокСтруктНП = Ложь;
	Для каждого СтрокаППИ Из Объект.ЭкспортПлатежныеДокументы Цикл
		БанкКод = ПолучитьНомерСчетаИМФОКонтрагентаПоДокументуНаСервере(СтрокаППИ.СсылкаНаДокумент);
		Если СокрЛП(БанкКод) = "899998" И ЭтоКонтрагентЮрЛицоСервер(СтрокаППИ.СсылкаНаДокумент) Тогда
			ВидимостьКолонокСтруктНП = Истина
		КонецЕсли;
		Если ВидимостьКолонокСтруктНП И ВидимостьКолонокВерующих Тогда
			Прервать
		КонецЕсли
	КонецЦикла;

	Если Не Объект.УведомленоОСтруктурированномНазначенииПлатежа И Не Объект.ФлагАвтоИмпЭксп И ВидимостьКолонокСтруктНП Тогда
		ТекстСообщенияУСНП = НСтр("ru='Вы собираетесь отправить платеж по налогам. С 01.12.23 данные платежи должны иметь структурированное назначение платежа, обратите внимание на строку(и) №(указать через запятую номера строк, в которых обнаружены платежи в налоговую, с мфо 899998) в случае необходимости отредактируйте колонки: `Код вида оплаты`, `Тип бюджетной классификации`, `Информация про налоговое сообщение`.';uk='Ви збираетесь відправити платіж по податкам. З 01.12.23 такі платежі повинні мати структуроване призначення платежу, зверніть увагу на рядок(ки) №(вказати через кому номери рядків, в яких виявлені платежі в податкову, з мфо 899998) в разі необхідності відредагуйте колонки: `Код виду оплати`, `Тип бюджетної класифікації`, `Інформація про податкове повідомлення`.'");
		ТекстЗаголовка = "";
		СообщениеПользователю(ТекстСообщенияУСНП, Ложь);
		Объект.УведомленоОСтруктурированномНазначенииПлатежа = Истина
	КонецЕсли;

	УстановитьВидимостьКолонокСтруктНП(ВидимостьКолонокСтруктНП);
	УстановитьВидимостьКолонокВерующих(ВидимостьКолонокВерующих)

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортПлатежныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
		ОткрытьФормуВыбораПлатежногоДокумента(ТД);
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ЭкспортПлатежныеДокументыНомерСтроки" Тогда
		Если ЗначениеЗаполнено(Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные.ТекстОшибки) Тогда
			СообщениеПользователю(Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные.ТекстОшибки)
		КонецЕсли;	
	ИначеЕсли Поле.Имя <> "ЭкспортПлатежныеДокументыНазначениеПлатежа" И Поле.Имя <> "ЭкспортПлатежныеДокументыФлажок"
			И Поле.Имя <> "ЭкспортПлатежныеДокументыstruct_code" И Поле.Имя <> "ЭкспортПлатежныеДокументыstruct_type"
			И Поле.Имя <> "ЭкспортПлатежныеДокументыstruct_category" И Поле.Имя <> "СерияПаспорта"
			И Поле.Имя <> "НомерПаспорта" И Поле.Имя <> "IDКарты"
			Тогда
		ОткрытьДокумент(ТД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортПлатежныеДокументыПриАктивизацииСтроки(Элемент)
	
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
		Если Объект.ИдКонф = "UNF" ИЛИ Объект.ИдКонф = "OSMD" Или Объект.ИдКонф = "BSB" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Расх. со счета'; uk='Витр. з рахунку'"); 
			ТД.ИмяДокумента = "РасходСоСчета";
		ИначеЕсли Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Спис. со счета'; uk='Спис. з рахунку'");
			ТД.ИмяДокумента = "СписаниеСРасчетногоСчета";
		ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
			ТД.ВидДокумента = НСтр("ru = 'Платежное поручение'; uk='Платіжне доручення'");
			ТД.ИмяДокумента = "ПлатежноеПоручение";
		ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Спис. со счета'; uk='Спис. з рахунку'");
			ТД.ИмяДокумента = "СписаниеБезналичныхДенежныхСредств";
		ИначеЕсли Объект.ИдКонф = "AAA" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Банковская выписка'; uk='Банківська виписка'");
			ТД.ИмяДокумента = "Выписка"
		КонецЕсли;
		
		ТД.ИдентификаторКартинки = 5;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПлатежногоДокумента(ТекДанные)
	
	Попытка
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораПлатежногоДокументаЗавершение",ЭтаФорма);
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Организация", Объект.Организация);
		ОткрытьФорму("Документ." + ТекДанные.ИмяДокумента + ".ФормаВыбора",,,,,,Оповещение);
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при открытии платежного документа '; uk='Помилка при відкритті платіжного документа '") + ОписаниеОшибки())
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПлатежногоДокументаЗавершение(СтуркутраВыбора,Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;
	
	ТД.СсылкаНаДокумент = СтуркутраВыбора;
	
	ЗаполнитьСтрокуПлатежаПоДокументу(ТД.СсылкаНаДокумент, ТД.НомерСтроки - 1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПлатежаПоДокументу(Док, НомерСтроки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокПлатежей(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Док, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры // ЗаполнитьСтрокуПоДокументу()

&НаКлиенте
Процедура ПереключитьВидДокумента(ТД)
	
	Если Объект.ИдКонф = "UNF" ИЛИ Объект.ИдКонф = "OSMD" Или Объект.ИдКонф = "BSB" Тогда	
		Если ТД.ИмяДокумента = "РасходСоСчета" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Пост. на счет'; uk='Надх. на рахунок'");
			ТД.ИмяДокумента = "ПоступлениеНаСчет";
		Иначе	
			ТД.ВидДокумента = НСтр("ru = 'Расх. со счета'; uk='Витр. з рахунку'");
			ТД.ИмяДокумента = "РасходСоСчета";
		КонецЕсли;	
	ИначеЕсли Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда
		Если ТД.ИмяДокумента = "СписаниеСРасчетногоСчета" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Пост. на счет'; uk='Надх. на рахунок'");
			ТД.ИмяДокумента = "ПоступлениеНаРасчетныйСчет";
		Иначе	
			ТД.ВидДокумента = НСтр("ru = 'Спис. со счета'; uk='Спис. з рахунку'");
			ТД.ИмяДокумента = "СписаниеСРасчетногоСчета";
		КонецЕсли;	
	ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
		Если ТД.ИмяДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда
			ТД.ВидДокумента = НСтр("ru = 'Пост. на счет'; uk='Надх. на рахунок'");
			ТД.ИмяДокумента = "ПоступлениеБезналичныхДенежныхСредств";
		Иначе	
			ТД.ВидДокумента = НСтр("ru = 'Спис. со счета'; uk='Спис. з рахунку'");
			ТД.ИмяДокумента = "СписаниеБезналичныхДенежныхСредств";
		КонецЕсли;
	ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
		ТД.ВидДокумента = НСтр("ru = 'Платежное поручение'; uk='Платіжне доручення'");
		ТД.ИмяДокумента = "ПлатежноеПоручение"
	КонецЕсли;
	
КонецПроцедуры // ПереключитьВидДокумента()

&НаКлиенте
Процедура ЭкспортПлатежныеДокументыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.ЭкспортПлатежныеДокументы.ТекущийЭлемент = Элементы.ЭкспортПлатежныеДокументы.ПодчиненныеЭлементы.ЭкспортПДНомерВид.ПодчиненныеЭлементы.ЭкспортПлатежныеДокументыВидДокумента;
		ТД = Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			ОткрытьФормуВыбораПлатежногоДокумента(ТД);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортПлатежейНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЭкспортПлатежей(ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортПлатежей(Команда)

	ЭкспортПлатежейНаСервере();

	Если Не Объект.UnitТест И Объект.ФлажокВыводитьОстаткиПлатежи Тогда
		ОбновитьОстатки(Неопределено);
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли;

КонецПроцедуры // ЭкспортПлатежей()

&НаСервере
Процедура ПолучениеЗарплатногоПроектаНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПолучитьЗарплатныеПроекты();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры // ПолучениеЗарплатногоПроектаНаСервере()

&НаСервере
Процедура ПолучениеЗарплатногоПроектаРЛНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПолучитьЗарплатныеПроектыРЛ();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры // ПолучениеЗарплатногоПроектаНаСервере()

&НаКлиенте
Процедура ПолучениеЗарплатногоПроектаРЛ(Команда)

	ДействиеАналитики = "ПолучениеСпискаЗППроектовДляРЛ";

	ПолучениеЗарплатногоПроектаРЛНаСервере();
	ЗаполнитьСписокВыбораЗПРЛ();

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры // ПолучениеЗарплатногоПроекта()

&НаКлиенте
Процедура ЗаполнитьСписокВыбораЗПРЛ()

	Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора.Очистить();

	i = 0;
	Для Каждого СтрокаЗП Из Объект.СписокЗПРЛ Цикл
		Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора.Добавить(Строка(i) + "," + СтрокаЗП.Значение, СтрокаЗП.Представление);
		i = i + 1
	КонецЦикла;	

	Если Объект.СписокЗПРЛ.Количество() = 1 Тогда
		Объект.ТекущийЗПРЛ = Элементы.РасчетныеЛисткиСписокЗП.СписокВыбора[0]
	КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ПолучениеЗарплатногоПроекта(Команда)

	ПолучениеЗарплатногоПроектаНаСервере();
	ЗаполнитьСписокВыбораЗП();

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры // ПолучениеЗарплатногоПроекта()

&НаКлиенте
Процедура ЗаполнитьСписокВыбораЗП()
	
	Элементы.СписокЗП.СписокВыбора.Очистить();
	Элементы.СписокЗППечВед.СписокВыбора.Очистить();

	Для Каждого СтрокаЗП Из Объект.СписокЗП Цикл
		Элементы.СписокЗП.СписокВыбора.Добавить(СтрокаЗП.Значение, СтрокаЗП.Представление);
		Элементы.СписокЗППечВед.СписокВыбора.Добавить(СтрокаЗП.Значение, СтрокаЗП.Представление);
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗПНазад(Команда)

	СдвинутьСписокЗначНазад(Элементы.СписокЗП, Объект.ТекущийЗП);

КонецПроцедуры 

&НаКлиенте
Процедура ЗПВперед(Команда)

	СдвинутьСписокЗначВперед(Элементы.СписокЗП, Объект.ТекущийЗП);

КонецПроцедуры

&НаКлиенте
Процедура ЗПРЛНазад(Команда)

	СдвинутьСписокЗначНазад(Элементы.РасчетныеЛисткиСписокЗП, Объект.ТекущийЗПРЛ)

КонецПроцедуры 

&НаКлиенте
Процедура ЗПРЛВперед(Команда)

	СдвинутьСписокЗначВперед(Элементы.РасчетныеЛисткиСписокЗП, Объект.ТекущийЗПРЛ)

КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаКартНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПолучитьСписокКарт();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСпискаКарт(Команда)

	Элементы.ГруппаСтраницыЗП.ТекущаяСтраница = Элементы.ГруппаСтраницыЗП.ПодчиненныеЭлементы.СторінкаПросмотрПолучателей;

	ПолучениеСпискаКартНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеВедомости(Команда)
		
	Для Каждого СтрокаТЧ Из Объект.ЗарплатныеВедомости Цикл
		СтрокаТЧ.Флажок = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиВедомостей(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ЗарплатныеВедомости Цикл
		СтрокаТЧ.Флажок = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВедомостейНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокВедомостей(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВедомостей(Команда)
	
	Если Объект.ЗарплатныеВедомости.Количество() <> 0 И Не Объект.UnitТест Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть по ведомостям будет очищена. Продолжить?'; uk='Таблична частина за відомостями буде очищена. Продовжити?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСписокВедомостей", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе	
		
		ЗаполнитьСписокВедомостейНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСписокВедомостей(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ЗарплатныеВедомости.Очистить();
		
		ЗаполнитьСписокВедомостейНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗарплатныеВедомостиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ЗарплатныеВедомости.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьДокумент(ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныеВедомостиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элементы.ЗарплатныеВедомости.ТекущийЭлемент = Элементы.ЗарплатныеВедомости.ПодчиненныеЭлементы.ЗарплатныеВедомостиДата;
		
		ТД = Элементы.ЗарплатныеВедомости.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			
			Попытка
				Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораВедомостиЗавершение",ЭтаФорма);
				ОткрытьФорму("Документ." + ТД.ИмяДокумента + ".ФормаВыбора",,,,,,Оповещение);
			Исключение
				СообщениеПользователю(НСтр("ru = 'Ошибка при открытии ведомости '; uk='Помилка при відкритті відомості '") + ОписаниеОшибки())
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВедомостиЗавершение(СтуркутраВыбора,Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.ЗарплатныеВедомости.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;
	
	ТД.СсылкаНаДокумент = СтуркутраВыбора;
	
	ЗаполнитьСтрокуВедомостиПоДокументу(ТД.СсылкаНаДокумент, ТД.НомерСтроки - 1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуВедомостиПоДокументу(Док, НомерСтроки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокВедомостей(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Док, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныеВедомостиПриАктивизацииСтроки(Элемент)
	
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
		
		Если Объект.ИдКонф = "UNF" Или Объект.ИдКонф = "BSB" Тогда
			ТД.ИмяДокумента = "ПлатежнаяВедомость";
		ИначеЕсли Объект.ПолноеИмяКонфигурации = "БухгалтерияСельскохозяйственногоПредприятия"
				ИЛИ Объект.ПолноеИмяКонфигурации = "КомплексноеРешениеСельскохозяйственногоПредприятия"
				Или Объект.ПолноеИмяКонфигурации = "BASАгроБухгалтерия"
				Или Объект.ПолноеИмяКонфигурации = "BASБухгалтерияЭлеватораМельницыИКомбикормовогоЗавода" Тогда
			ТД.ИмяДокумента = "ИНАГРО_ЗарплатаКВыплатеОрганизаций";
		ИначеЕсли Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" ИЛИ Объект.ИдКонф = "ERP" Тогда
			ТД.ИмяДокумента = "ВедомостьНаВыплатуЗарплатыВБанк";
		ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
			ТД.ИмяДокумента = "ВедомостьНаВыплатуЗарплатыПеречислением";
		ИначеЕсли Объект.ИдКонф = "BASR" Тогда
			ТД.ИмяДокумента = "ЗарплатаКВыплатеОрганизаций"
		ИначеЕсли Объект.ИдКонф = "AAA" Тогда
			ТД.ИмяДокумента = "ВыплатаЗарплаты"
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВедомостиНаСервере(ВыгрузкаВФайл = Ложь)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьВедомости(ВыгрузкаВФайл, ?(Объект.ВидВыплаты = Элементы.ВидВыплаты.СписокВыбора[0].Значение, "true", "false"));
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВедомости(Команда)

	Элементы.ГруппаСтраницыЗП.ТекущаяСтраница = Элементы.ГруппаСтраницыЗП.ПодчиненныеЭлементы.СтраницаВедомости;

	ОтправитьВедомостиНаСервере();

	Если Объект.СоздаватьНовуюВедомостьПоКаждойСтроке Тогда
		вИДПакетаЗачислений = Объект.ИДПакетаЗачислений;
		ОбновитьСписокПакЗач("");
		Попытка
			Объект.ИДПакетаЗачислений = Элементы.ИДПакетаЗачислений.СписокВыбора.НайтиПоЗначению(вИДПакетаЗачислений).Значение
		Исключение КонецПопытки
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПакЗачНазад(Команда)

	СдвинутьСписокЗначНазад(Элементы.ИДПакетаЗачислений, Объект.ИДПакетаЗачислений);

КонецПроцедуры

&НаКлиенте
Процедура ПакЗачВперед(Команда)

	СдвинутьСписокЗначВперед(Элементы.ИДПакетаЗачислений, Объект.ИДПакетаЗачислений);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораПакЗач()
	
	Элементы.ИДПакетаЗачислений.СписокВыбора.Очистить();
	Элементы.ИДПакетаЗачисленийПечВед.СписокВыбора.Очистить();
	
	Для Каждого СтрокаЗП Из Объект.СпискоПакЗач Цикл
		Элементы.ИДПакетаЗачислений.СписокВыбора.Добавить(СтрокаЗП.Значение, СтрокаЗП.Представление);
		Элементы.ИДПакетаЗачисленийПечВед.СписокВыбора.Добавить(СтрокаЗП.Значение, СтрокаЗП.Представление);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПакЗачНаСервере(СтатусВедомостиЗПСписокВыбора)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПолучитьСписокПакетовЗачислений(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, СтатусВедомостиЗПСписокВыбора);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПакЗач(Команда)

	СтатусВедомостиЗПСписокВыбора = Элементы.СтатусВедомостиЗП.СписокВыбора;

	ОбновитьСписокПакЗачНаСервере(СтатусВедомостиЗПСписокВыбора);
	
	ЗаполнитьСписокВыбораПакЗач();

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТекстОтправкаВедомостиНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТекстПечатьЗачисленнойВедомостиНажатие(Элемент)

	Элементы.ГруппаСтраницыЗП.ТекущаяСтраница = Элементы.ГруппаСтраницыЗП.ПодчиненныеЭлементы.СторінкаВедомость;

	Если Не ЗначениеЗаполнено(Объект.ИДПакетаЗачислений) Тогда
		СообщениеПользователю(НСтр("ru='Не выбрана ведомость!';uk='Не обрана відомість!'") + Символы.ПС + ОписаниеОшибки(), Ложь);
		Возврат
	КонецЕсли;

	Попытка
		ПереключитьРабочуюОбласть(Элемент)
	Исключение
	КонецПопытки

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПФВедомостиНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбьект.СформироватьПФВедомостиЗП(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ТабДокВедомостьЗП.Очистить();
	ТабДокВедомостьЗП.Вывести(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПФВедомости(Команда)

	ЗаполнитьПФВедомостиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПроверитьВедомостьНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбьект.ПроверитьВедомость();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ТабДокВедомостьЗП.Очистить();
	ТабДокВедомостьЗП.Вывести(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВедомость(Команда)

	ПроверитьВедомостьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ТекстАвторизацияНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ТекстВыпискаПосчетамНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);

КонецПроцедуры

&НаСервере
Функция СформироватьВыпискуНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбьект.СформироватьВыписку(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	Если ТабДок = Неопределено Тогда //значит много данных, будем в цикле обрабатывать
		ЭтаФорма.Доступность = Ложь;
		Возврат Истина; //
	КонецЕсли;	
	
	ТабДокВыписка.Очистить();
	ТабДокВыписка.Вывести(ТабДок);
	ЭтаФорма.Доступность = Истина;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура НачалоРасчетВремениВыполнения(ИмяПроцедуры)

	КолСекВДне = 24*60*60;
	Если Не Объект.ОтключитьОптимизациюПоВремениОстатки
			И (КонецДня(ОтборПериод.ДатаОкончания) - НачалоДня(ОтборПериод.ДатаНачала) + 1 >= 365 * КолСекВДне
			И Не ЗначениеЗаполнено(Объект.БанковскийСчет)//установлены все счета и период год или более
			Или Объект.ПревышениеВремениОстаткиСекунд > 5)//запрос (с пагинацией) выполняется более 5 сек
			Тогда
		ТекстПревышениеВремени = НСтр("ru='Операция получения остатков может занять длительное время, получить остатки?';uk='Операція отримання залишків може зайняти великий час, отримати залишки?'");
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекстПревышениеВремени", ТекстПревышениеВремени);
		ДопПараметры.Вставить("ИмяПроцедуры", ИмяПроцедуры);
		ДопПараметры.Вставить("ОтключитьОптимизациюПоВремениОстатки", Объект.ОтключитьОптимизациюПоВремениОстатки);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПолучениеОстатков", ЭтаФорма, ДопПараметры);
		Попытка
			ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ОптимизацияВремени", ДопПараметры,,,,, ОписаниеОповещения)
		Исключение
			ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ОптимизацияВремени", ДопПараметры,,,,, ОписаниеОповещения)
		КонецПопытки;
	Иначе
		ПолучитьОстатки(ИмяПроцедуры)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеОстатков(стРезультат, ДопПараметры) Экспорт

	Объект.ОтключитьОптимизациюПоВремениОстатки = стРезультат.ОтключитьОптимизациюПоВремениОстатки;
	Если стРезультат.Результат <> "ОК" Тогда
		Возврат
	Иначе
		ПолучитьОстатки(стРезультат.ИмяПроцедуры)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстатки(ИмяПроцедуры)

	Если ИмяПроцедуры = "ОбновитьОстатки" Тогда
		ОбновитьОстатки(Новый Структура("Имя", "ОбновитьОстаткиПовторно"))
	ИначеЕсли ИмяПроцедуры = "СформироватьВыписку" Тогда
		СформироватьВыписку(Новый Структура("Имя", "СформироватьВыпискуПовторно"))
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыписку(Команда)

	Если Не ЗначениеЗаполнено(Объект.КодПоЕДРПОУ) И Не Объект.UnitТест Тогда
		ТекстСообщения = НСтр("ru='Не заполнен КодЕДРПОУ в настройках. Выписка будет сформирована с неточными остатками.';uk='Не заповнено КодЕДРПОУ у налаштуваннях. Виписку буде сформовано з неточними залишками.'");
		СообщениеПользователю(ТекстСообщения, Ложь)
	КонецЕсли;

	Если Не Объект.UnitТест И Команда.Имя = "СформироватьВыписку" Тогда
		НачалоРасчетВремениВыполнения("СформироватьВыписку");
		Возврат
	КонецЕсли;

	Объект.ВремяНачалаОперацииОстаткиВсего = ТекущаяДата();

	ВыпВЦикле = СформироватьВыпискуНаСервере();
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("СформироватьВыпискуВЦикле", 2);
	КонецЕсли;

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыпискуВЦикле()
	
	ВыпВЦикле = СформироватьВыпискуНаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("СформироватьВыпискуВЦикле");
		РасчетВремениВыполненияНаСервере();
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура АвтоматическийОбменПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность(); 	
	
	//Юра 25 11 2025
	Для Каждого СтрокаТЧ Из Объект.ТокеныКомпаний Цикл
		Если СтрокаТЧ.Флажок = Истина Тогда
			СтрокаТЧ.КолонкаОтметкаПлатежи = Истина;
		КонецЕсли;
	КонецЦикла;
	//Юра 25 11 2025
	
	Если НЕ Объект.АвтоматическийОбмен Тогда
		ОтключитьОбработчикОжидания("АвтоОбмен");
	Иначе
		ПериодОбменаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоИмпортПриИзменении(Элемент)

	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура АвтоЭкспортПриИзменении(Элемент)

	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура ФлажокМультиАккаунтныйИмпортПриИзменении(Элемент)

	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеКомпанииАвтообмен(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТокеныКомпаний Цикл
		СтрокаТЧ.КолонкаОтметкаПлатежи = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиКомпанииАвтообмен(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТокеныКомпаний Цикл
		СтрокаТЧ.КолонкаОтметкаПлатежи = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеБыстраяАвторизацияАвтообменПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина

КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеБыстраяАвторизацияАвтообменПередУдалением(Элемент, Отказ)

	Отказ = Истина

КонецПроцедуры

//Вызывается из ПриОткрытии(), АвтоматическийОбменПриИзменении() и процедур формы автообмена
&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	// АвтоОбмен
	Элементы.АвтоИмпорт.Доступность = Объект.АвтоматическийОбмен;
	Элементы.АвтоЭкспорт.Доступность = Объект.АвтоматическийОбмен;
	Элементы.ПериодОбмена.Доступность = Объект.АвтоматическийОбмен;

	ВидимостьФлагМультиАккПлатежи = Объект.АвтоматическийОбмен И (Объект.АвтоИмпорт Или Объект.АвтоЭкспорт);
	Элементы.ФлажокМультиАккаунтныйИмпорт.Доступность = ВидимостьФлагМультиАккПлатежи;
	ВидимостьМультиАккПлатежи = Объект.АвтоматическийОбмен И (Объект.АвтоИмпорт Или Объект.АвтоЭкспорт) И Объект.ФлажокМультиАккаунтныйИмпорт;
	Элементы.ТабличноеПолеБыстраяАвторизацияАвтообмен.Видимость = ВидимостьМультиАккПлатежи;
	Элементы.МультиАккПлатежиОтметитьВсе.Видимость = ВидимостьМультиАккПлатежи;
	Элементы.МультиАккПлатежиСнятьОтметки.Видимость = ВидимостьМультиАккПлатежи;

	// АвтоОбменДокументы
	Элементы.ФлажокАвтоИмпортДокументы.Доступность = Объект.ФлажокАвтоОбменДокументы;
	Элементы.ФлажокАвтоОтправкаДокументы.Доступность = Объект.ФлажокАвтоОбменДокументы;
	Элементы.ПериодАвтоОбменаДокументы.Доступность = Объект.ФлажокАвтоОбменДокументы;
	Элементы.ФлажокСоединятьсяПриСтартеДокументы.Доступность = Объект.ФлажокАвтоОбменДокументы;

	ВидимостьФлагМультиАккДокументы = Объект.ФлажокАвтоОбменДокументы И (Объект.ФлажокАвтоИмпортДокументы Или Объект.ФлажокАвтоОтправкаДокументы);
	Элементы.ФлажокМультиАккаунтныйИмпортДокументы.Видимость = ВидимостьФлагМультиАккДокументы;
	ВидимостьМультиАккДокументы = Объект.ФлажокАвтоОбменДокументы И (Объект.ФлажокАвтоИмпортДокументы Или Объект.ФлажокАвтоОтправкаДокументы)
		И Объект.ФлажокМультиАккаунтныйОбменДокументы;
	Элементы.ТабличноеПолеБыстраяАвторизацияАвтообменДокументы.Видимость = ВидимостьМультиАккДокументы;
	Элементы.МультиАккДокументыОтметитьВсе.Видимость = ВидимостьМультиАккДокументы;
	Элементы.МультиАккДокументыСнятьОтметки.Видимость = ВидимостьМультиАккДокументы;

	ДоступностьВидовДокументов = Объект.ФлажокАвтоОбменДокументы И (Объект.ФлажокАвтоИмпортДокументы Или Объект.ФлажокАвтоОтправкаДокументы);
	Элементы.ФлажокАОНН.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокАОП2кНН.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокЗапросКЕРНН.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокАОЗаказы.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокАОСчета.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокАОАкты.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокАОНакладные.Доступность = ДоступностьВидовДокументов;
	Элементы.ФлажокАОФинДокPDF.Доступность = Объект.ФлажокАвтоОбменДокументы И Объект.ФлажокАвтоОтправкаДокументы;//ДоступностьВидовДокументов;

	Если Найти("KUBU,UABY,BP,BASC", Объект.ИдКонф) > 0 Тогда
		Элементы.ФлажокАОЗаказы.Доступность = Ложь	
	КонецЕсли;	

	Если Найти("UABY", Объект.ИдКонф) > 0 Тогда
		Элементы.ФлажокЗапросКЕРНН.Доступность = Ложь	
	КонецЕсли;	

	Если Объект.ИдКонф = "BASR" Тогда
		Элементы.ФлажокАОНН.Доступность = Ложь;
		Элементы.ФлажокАОП2кНН.Доступность = Ложь;
		Элементы.ФлажокЗапросКЕРНН.Доступность = Ложь;
		//Элементы.ФлажокАОСчета.Доступность = Ложь;//доступен для отправки счетов из заказов
		Элементы.ФлажокАОАкты.Доступность = Ложь
	КонецЕсли;

	Если Объект.ИдКонф = "AAA" Тогда
		Элементы.ФлажокАОНН.Доступность = Ложь;
		Элементы.ФлажокАОП2кНН.Доступность = Ложь;
		Элементы.ФлажокЗапросКЕРНН.Доступность = Ложь;
		Элементы.ФлажокАОАкты.Доступность = Ложь
	КонецЕсли;

	// подпись
	Элементы.ТекстПодписьПлатежей.Видимость = Ложь;//Объект.РаботаВМоделиСервисаПБ;
	Элементы.ПодписыватьPDF.Видимость = Истина;//Объект.РаботаВМоделиСервисаПБ;
	Элементы.ТЧФинДокИсходящиеПодписатьФинДок.Видимость = Истина;//Объект.РаботаВМоделиСервисаПБ;
Элементы.ТЧФинДокИсходящиеПодписатьФинДокБезОтправки.Видимость = Ложь;//Истина;

	ВидимостьКнопокПодписиФинДок();

	Элементы.ПодписыватьФинансовыеДокументыПриОтравке.Видимость = Истина;//Объект.РаботаВМоделиСервисаПБ;
	Элементы.ОткрытьФормуНастройкиПоискаДокументов.Видимость = Объект.ПоискПлатежныхДокументовПоУказаннымПолям;
	
	Если Объект.ИдКонф = "UT_3" Тогда
		Элементы.ГрЗарплатныйПроект.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИдКонф = "OSMD" Тогда
		Элементы.ГрЗарплатныйПроект.Видимость = Ложь;
		Элементы.ГрДокументыОтчеты.Видимость = Ложь;
		Элементы.ГрКурсыВалют.Видимость = Ложь;
		Элементы.ГрДопВозможности.Видимость = Ложь;
		Элементы.ИмпортПлатежныеДокументыЛицевойСчет.Видимость = Истина;
		Элементы.ИмпортПлатежныеДокументыЛицевойСчет.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета");
		Элементы.ИмпортПлатежныеДокументыСчетКонтрагента.Видимость = Ложь;
		Элементы.ИмпортПлатежныеДокументыДокументРасчетов.Видимость = Ложь;
		
		Элементы.ИмпортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
		Элементы.ЭкспортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	КонецЕсли;
	
	Если Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда
		Элементы.ИмпортПлатежныеДокументыДокументРасчетов.Видимость = Ложь;	
		Элементы.СтатьяЗатратПоУмолчанию.Видимость = Истина;
		Элементы.ИмпортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
		Элементы.ЭкспортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
		Элементы.Соглашение.Видимость = Истина;
		Элементы.ИмпортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
		Элементы.ЭкспортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	ИначеЕсли Объект.ИдКонф = "KUBU" Тогда
		Элементы.ГрЗарплатныйПроект.Видимость = Истина;
		Элементы.ТекстРасчетныеЛистки.Видимость = Ложь;
		Элементы.ГрДокументыОтчеты.Видимость = Ложь;
		Элементы.ГрДопВозможности.Видимость = Ложь;
		Элементы.СтатьяДДСВходящий.Видимость = Ложь;
		Элементы.СтатьяДДСИсходящий.Видимость = Ложь;
		Элементы.СтатьяДДСПеремещениеДС.Видимость = Ложь;
		Элементы.ГруппаОстаткиНаСчетахИмпорт.Видимость = Ложь;
		Элементы.ИмпортПлатежныеДокументыДокументРасчетов.Видимость = Ложь;
		Элементы.ИмпортПДКонтрагент.Видимость = Ложь;
		Элементы.ИмпортПлатежныеДокументыСчетКонтрагента.Видимость = Ложь;
		Элементы.ТекстИмпортЭкспортКонтрагентов.Видимость = Ложь;
	ИначеЕсли Найти("AAA,OSMD", Объект.ИдКонф) > 0 Тогда
		Элементы.ЗППодразделение.Видимость = Ложь
	ИначеЕсли Объект.ИдКонф = "UABY" Тогда
		мТипыДогКонтПП = "ДокументСсылка.ПоступлениеТМЦ,ДокументСсылка.ПоступлениеНеоборотныхАктивов,ДокументСсылка.ПолучениеУслугОтПоставщика,ДокументСсылка.СчетВходящий";
		Элементы.ИмпортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов(мТипыДогКонтПП);
		Элементы.ЭкспортПлатежныеДокументыДоговорКонтрагента.ОграничениеТипа = Новый ОписаниеТипов(мТипыДогКонтПП);
		Элементы.СтатьяДДСВходящий.Видимость = Ложь;
		Элементы.СтатьяДДСИсходящий.Видимость = Ложь;
		Элементы.СтатьяДДСПеремещениеДС.Видимость = Ложь;
		//Элементы.СкладПоУмолчанию.Видимость = Ложь;
		//Элементы.Подразделение.Видимость = Ложь;
	КонецЕсли;	

	Если Объект.ИдКонф = "BASR" Тогда
		Элементы.ЗППодразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Магазины")
	ИначеЕсли Найти("BSB,UNF", Объект.ИдКонф) > 0 Тогда
		Элементы.ЗППодразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы")
	ИначеЕсли Найти("UABY", Объект.ИдКонф) > 0 Тогда
		Элементы.ЗППодразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Подразделения")
	ИначеЕсли Найти("AAA,OSMD,UT_3", Объект.ИдКонф) = 0 Тогда
		Элементы.ЗППодразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций")
	КонецЕсли;

	Элементы.ПротоколПрокси.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.НеИспользоватьПроксиДляЛокальныхАдресов.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.ГруппаАдресПорт.Видимость = Объект.ФлажокИспользоватьПрокси;
	Элементы.ГруппаПроксиПользовательПароль.Видимость = Объект.ФлажокИспользоватьПрокси;
	
	УстановитьВидимостьДоступностьПутьКурл();
	
	Элементы.ОтправлятьPDF.Доступность = Объект.ПодписыватьPDF;
	Элементы.ИспользоватьSmartIdВPaperLess.Доступность = Объект.ПодписыватьPDF;
	
	Элементы.ПерезаполнятьНайденныеПлатежи.Видимость = НЕ Объект.НеЗаполнятьЗагруженныеРанееПлатежи;
	
	УстановитьВидимостьПолейТокенАвторизации();
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьВидимостьДоступностьПутьКурл()

	Элементы.ПутьКурл.Видимость = Не Объект.ЭтоВебКлиент// И Объект.РежимОтладки И НЕ Объект.ПоддерживаетсяTLS12
		//И (НЕ Объект.ПоддерживаетсяTLS12 Или Объект.ФлажокИспользоватьКурлВсегда)

КонецПроцедуры

//----------- АвтоОбменПлатежи ------------------

&НаКлиенте
Процедура ПериодОбменаПриИзменении(Элемент)
	
	Если Объект.АвтоматическийОбмен Тогда
		
		ПодключитьОбработчикОжидания("АвтоОбмен", Объект.ПериодОбмена * 60);

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоОбмен()

	АвтоОбменНаСервере();

КонецПроцедуры

&НаСервере
Процедура АвтоОбменНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.АвтоОбмен(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстАвтоОбменНажатие(Элемент)
	
	ПереключитьРаздел(Элементы.ГрОбменПлатежами);
	ТекущийЭлемент = Элементы.ТекстПараметрыОбмена;
	ПереключитьРабочуюОбласть(Элементы.ТекстПараметрыОбмена);
	
КонецПроцедуры

//----------- АвтоОбменДокументы ------------------

&НаКлиенте
Процедура АвтоматическийОбменДокументыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
	Если НЕ Объект.ФлажокАвтоОбменДокументы Тогда
		ОтключитьОбработчикОжидания("АвтоОбменДокументы");
	Иначе
		ПериодОбменаДокументыПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоИмпортДокументыПриИзменении(Элемент)

	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура АвтоЭкспортДокументыПриИзменении(Элемент)

	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура ФлажокМультиАккаунтныйИмпортДокументыПриИзменении(Элемент)

	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеКомпанииАвтообменДокументы(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТокеныКомпаний Цикл
		СтрокаТЧ.КолонкаОтметкаДокументы = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиКомпанииАвтообменДокументы(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТокеныКомпаний Цикл
		СтрокаТЧ.КолонкаОтметкаДокументы = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбменаДокументыПриИзменении(Элемент)
	
	Если Объект.ФлажокАвтоОбменДокументы Тогда
		ПодключитьОбработчикОжидания("АвтоОбменДокументы", Объект.ПериодАвтоОбменаДокументы * 60)
	КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Функция ПодобратьИменаПечатныхормДляАвтообмена()

	спИмяПечатнойФормы = Новый СписокЗначений;

	Для каждого ВидДокPDFДокументы Из Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора Цикл
		ВидДокументаPDF = ВидДокPDFДокументы.Значение;
		ЗаполнитьСписокПечатныхФорм();
		Для каждого эспИмяПечатнойФормы Из Элементы.ИмяПечатнойФормыPDF.СписокВыбора Цикл
			ИмяПечатнойФормы = эспИмяПечатнойФормы.Значение;
			Если Найти(ИмяПечатнойФормы, "FREDO") = 0 И Найти(ИмяПечатнойФормы, "(") = 0 И Найти(ИмяПечатнойФормы, "1") = 0 Тогда
				спИмяПечатнойФормы.Добавить(ВидДокументаPDF, ИмяПечатнойФормы);
				Прервать
			КонецЕсли
		КонецЦикла
	КонецЦикла;

	Возврат спИмяПечатнойФормы

КонецФункции

&НаКлиенте
Процедура АвтоОбменДокументы()

	//ВидДокументаPDFСписокВыбора = Элементы.ВидДокументаPDF.СписокВыбора;//ПаперЛесс не используется в АО
	ВидДокументаPDFСписокВыбора = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора;
	спИмяПечатнойФормы = ПодобратьИменаПечатныхормДляАвтообмена();
	ЗаполнитьСписокСтатусДокумента();
	АвтоОбменДокументыНаСервере(спИмяПечатнойФормы, ВидДокументаPDFСписокВыбора);

КонецПроцедуры

&НаСервере
Процедура АвтоОбменДокументыНаСервере(ИмяПечатнойФормы, ВидДокументаPDFСписокВыбора)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.АвтоОбменДокументы(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, ИмяПечатнойФормы, ВидДокументаPDFСписокВыбора);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

//------------------------------------------------

&НаКлиенте
Процедура ТекстОсновныеНастройкиНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ТекстИмпортЭкспортКонтрагентовНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.Контрагенты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекЭл = Элементы.Контрагенты.ТекущийЭлемент.Имя;
	Если ТекЭл <> "КонтрагентыНаименование" И ТекЭл <> "КонтрагентыКонтрагент"  И ТекЭл <> "КонтрагентыЕГРПОУ" Тогда
		Возврат;
	КонецЕсли;	
	
	ТекКонтр = ТД.Контрагент;
	
	Если НЕ ЗначениеЗаполнено(ТекКонтр) Тогда
		Возврат;
	КонецЕсли;
	
	Спр = Новый Структура;
    Спр.Вставить("Ключ", ТекКонтр);
	
    Попытка
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",Спр);	
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при открытии контрагента '; uk='Помилка при відкритті контрагента '") + ОписаниеОшибки())
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТД = Элементы.Контрагенты.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Элементы.Контрагенты.ТекущийЭлемент = Элементы.Контрагенты.ПодчиненныеЭлементы.КонтрагентыНомерСтроки;
		
		Если НЕ ЗначениеЗаполнено(ТД.Контрагент) Тогда
			
			Попытка
				Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораКонтрагентаЗавершение",ЭтаФорма);
				ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,,,,,Оповещение);
			Исключение
				СообщениеПользователю(НСтр("ru = 'Ошибка при выборе контрагента '; uk='Помилка при обранні контрагента '") + ОписаниеОшибки())
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКонтрагентаЗавершение(СтуркутраВыбора,Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.Контрагенты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;
	
	Контрагент = СтуркутраВыбора;
	
	ЗаполнитьСтрокуПоКонтрагентуНаСервере(Контрагент,ТД.НомерСтроки);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтрокуПоКонтрагентуНаСервере(Контрагент,НомерСтроки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСтрокуПоКонтрагенту(Контрагент, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыБанковскийСчетВБазеПриИзменении(Элемент)
	
	ТД = Элементы.Контрагенты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;

	ТекКонтр = ТД.Контрагент;
	
	КонтрагентыБанковскийСчетВБазеПриИзмененииНаСервере(ТекКонтр, ТД.НомерСтроки, ТД.БанковскийСчетВБазе);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентыБанковскийСчетВБазеПриИзмененииНаСервере(Контрагент, НомерСтроки, БанковскийСчет)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСтрокуПоКонтрагенту(Контрагент, НомерСтроки, БанковскийСчет);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКонтрагентов(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.Контрагенты Цикл
		
		СтрокаТЧ.Флажок = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеКонтрагентов(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.Контрагенты Цикл
		
		СтрокаТЧ.Флажок = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИмпортКонтрагентовНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ИмпортКонтрагентов();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортКонтрагентов(Команда)

	ИмпортКонтрагентовНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВБазуНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.СохранитьСписокКонтрагентов();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеВБазу(Команда)
	
	ЗаписатьДанныеВБазуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортКонтрагентовНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЭкспортКонтрагентов();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортКонтрагентов(Команда)

	ЭкспортКонтрагентовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если Найти(ИсточникВыбора.ИмяФормы, "НастройкаАвтозаполнения") > 0 Тогда
		ЗагрузитьТаблицуПравил(ВыбранноеЗначение.ТаблицаПравил);
		ОбновитьНадписьФормыНастройкиАвтозаполнения();
	ИначеЕсли Найти(ИсточникВыбора.ИмяФормы, "НастройкаПолейПоискаПлатежей") > 0 Тогда
		ЗагрузитьТаблицуПолейПоискаПлатежей(ВыбранноеЗначение.ПоляДляПоискаПлатежей);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуПолейПоискаПлатежей(Таблица)

	Объект.ПоляДляПоискаПлатежей.Загрузить(Таблица.Выгрузить());

КонецПроцедуры	

&НаКлиенте
Процедура КартинкаНетАвторизацииНажатие(Элемент)

	ПереключитьПоказатьСообщениеНеАвторизовано();

КонецПроцедуры

&НаСервере
Функция ПроверитьСостояниеРегистрацииНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПроверитьСостояниеРегистрации(Объект.ТекВидОперации);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСостояниеРегистрации(Команда)

	ВыпВЦикле = ПроверитьСостояниеРегистрацииНаСервере(); 
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ПроверкаСостоянияРегистрацииВЦикле", 1.5);
	КонецЕсли;

	ЗапомнитьСписокДокументовСервер();

	ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСостоянияРегистрацииВЦикле()
	
	ВыпВЦикле = ПроверитьСостояниеРегистрацииНаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ПроверкаСостоянияРегистрацииВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КартинкаДопВозможностиНажатие(Элемент)

	ПереключитьРаздел(Элементы.ГрДопВозможности, Ложь, НСтр("ru='Раздел дополнительных возможностей';uk='Розділ додаткових можливостей'"));

КонецПроцедуры

&НаКлиенте
Процедура ТекстДопВозможностиНажатие(Элемент)

	ПереключитьРаздел(Элементы.ГрДопВозможности, Ложь, НСтр("ru='Раздел дополнительных возможностей';uk='Розділ додаткових можливостей'"));

КонецПроцедуры

&НаКлиенте
Процедура ТекстЗагрузкаДанныхНажатие(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИдКонф", Объект.ИдКонф);
	
	Попытка//Если Объект.ОбработкаВнешняя Тогда
		ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаЗагрузкиДанных", СтруктураПараметров);
	Исключение
		ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ФормаЗагрузкиДанных", СтруктураПараметров);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ТекстКурсыВалютДействиеНажатие(Элемент)

	// подраздел пока единственный, поэтому действие не предусмотрено

КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОбновитьОстаткиПоСчетам(ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	Элементы.ГруппаКартИТекстОжидания.Видимость = НЕ Объект.ОстаткиПоСчетам.Количество() = 0

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)

	Если Не Объект.UnitТест И (Команда = Неопределено Или Команда.Имя = "ОбновитьОстатки") Тогда
		НачалоРасчетВремениВыполнения("ОбновитьОстатки");
		Возврат
	КонецЕсли;

	ЗапаснойСчетчикНаВыходИзЦикла = 0; 

	Объект.ВремяНачалаОперацииОстаткиВсего = ТекущаяДата();

	ОбновитьОстаткиНаСервере();
	
	Если Объект.ОстаткиПоСчетам.Количество() <> 0 ИЛИ ЗначениеЗаполнено(Объект.FollowId) Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ЭтаФорма.Доступность = Ложь;
		ПодключитьОбработчикОжидания("ОбновитьОстаткиВЦикле", 2);
	КонецЕсли;

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиВЦикле()

	ОбновитьОстаткиНаСервере();
	ЗапаснойСчетчикНаВыходИзЦикла = ЗапаснойСчетчикНаВыходИзЦикла + 1;
	
	Если Объект.ОстаткиПоСчетам.Количество() = 0 ИЛИ ЗапаснойСчетчикНаВыходИзЦикла = 4000 Тогда
		
		Если ЗапаснойСчетчикНаВыходИзЦикла = 4000 Тогда
			СообщениеПользователю(НСтр("ru='Выполнение прервано принудительно (остатки)';uk='Виконання перервано примусово (залишки)'") + Символы.ПС + ОписаниеОшибки(), Ложь)
		КонецЕсли;
		
		ЗапаснойСчетчикНаВыходИзЦикла = 0;
		
		ОтключитьОбработчикОжидания("ОбновитьОстаткиВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		ЭтаФорма.Доступность = Истина;

		РасчетВремениВыполненияНаСервере()

	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РасчетВремениВыполненияНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.РасчетВремениВыполнения();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ТекстПереносИзБОНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ФлагНоменклатураПриИзменении(Элемент)

	Элементы.ГруппаДопУсловияЗагрузкиБО.Видимость = ФлагНоменклатура;
	Элементы.ГруппаЦеныБО.Видимость = ФлагНоменклатура;
	ФлагКонтрагенты = НЕ ФлагНоменклатура;

КонецПроцедуры

&НаКлиенте
Процедура ФлагЦеныПриИзменении(Элемент)

	Элементы.ЦенаПродажи.Видимость = ФлагЦены;

КонецПроцедуры

//не используется
&НаСервере
Функция ЗагрузитьДанныеИзБОНаСервере(СтруктураПараметров)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ЗагрузитьДанныеИзБО(СтруктураПараметров);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

//не используется
&НаКлиенте
Процедура ЗагрузитьДанныеИзБО(Команда)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФлагКонтрагенты", ФлагКонтрагенты);
	СтруктураПараметров.Вставить("ФлагНоменклатура", ФлагНоменклатура);
	СтруктураПараметров.Вставить("ФлагОстатки", ФлагОстатки);
	СтруктураПараметров.Вставить("ФлагЦены", ФлагЦены);

	ВыпВЦикле = ЗагрузитьДанныеИзБОНаСервере(СтруктураПараметров);
	
	ФлагКонтрагенты = СтруктураПараметров.ФлагКонтрагенты;
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ЗагрузитьДанныеИзБОВЦикле", 1);
	КонецЕсли;

КонецПроцедуры

//не используется
&НаКлиенте
Процедура ЗагрузитьДанныеИзБОВЦикле()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФлагКонтрагенты", ФлагКонтрагенты);
	СтруктураПараметров.Вставить("ФлагНоменклатура", ФлагНоменклатура);
	СтруктураПараметров.Вставить("ФлагОстатки", ФлагОстатки);
	СтруктураПараметров.Вставить("ФлагЦены", ФлагЦены);

	ВыпВЦикле = ЗагрузитьДанныеИзБОНаСервере(СтруктураПараметров);
	
	ФлагКонтрагенты = СтруктураПараметров.ФлагКонтрагенты;
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ЗагрузитьДанныеИзБОВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КодНалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.КодНал) Тогда
		Объект.КодАдмРайона = Прав(Объект.КодНал,2);
		Объект.КодОблНал = Лев(Объект.КодНал,2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСчетаНаОплатуНажатие(Элемент)

	Если Объект.ИдКонф = "BASR" Тогда
		//нет счетов, но есть заказы как счета при включенном соответствующем флаге
		ПереключитьИнтерфейсНаИсходящиеСчета();
		Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокВходящие.Видимость = Ложь
	ИначеЕсли Найти("UT_3,ERP", Объект.ИдКонф) > 0 Тогда
		ПереключитьИнтерфейсНаИсходящиеСчета()
	Иначе
		ПереключитьИнтерфейсНаИсходящиеСчета()
	КонецЕсли;

	ВидимостьКолонкаНазначениеПлатежа();
	ВидимостьФлагСчетИзЗаказа();
	ВидимостьТЧФинДокИсходящиеИмяДокумента();

	ОтметитьВсеДокументыЭДОНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВходящиеСчета()

	вОтборПериодДатаНачала = ОтборПериод.ДатаНачала;
	вОтборПериодДатаОкончания = ОтборПериод.ДатаОкончания;

	ОтборПериод.ДатаНачала = Макс(Объект.ДатаПоследнегоИмпортаВхСчетов, ДобавитьМесяц(ТекущаяДата(), -1));//НачПериода
	ОтборПериод.ДатаОкончания = ТекущаяДата();
	showOnlyUnread = Истина;

	ЗагрузитьФинДок("");

	showOnlyUnread = Ложь;

	Объект.ДатаПоследнегоИмпортаВхСчетов = ТекущаяДата();

	ОтборПериод.ДатаНачала = вОтборПериодДатаНачала;
	ОтборПериод.ДатаОкончания = вОтборПериодДатаОкончания

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекВидОперации(Раздел)
	
	//сейчас сделано для УНФ, для других конифигураций нужно будет анализировать название типов документов
	Если Раздел = "НН" Тогда	
		
		Если Элементы.ГруппаВходящиеИсходящиеНН.ТекущаяСтраница = Элементы.ННИсходящие Тогда
			Объект.ТекВидОперации = "Налоговые";
		Иначе
			Объект.ТекВидОперации = "ВходящиеНН";
		КонецЕсли;
		
		Элементы.СписокДокументов.ОтборСтрок = Новый ФиксированнаяСтруктура("КодВидаДокумента", 1); // это исходящие налоговые документы
		Элементы.ВходящиеНН.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидДокумента", "РегистрацияВходящегоНалоговогоДокумента");
		
		Элементы.ПоискПоДатеДокумента.Видимость = Элементы.ГруппаВходящиеИсходящиеНН.ТекущаяСтраница.Имя = "ННВходящие";
		
	Иначе
		
		Объект.ТекВидОперации = Раздел;
		
		ДанныеИмен = ИмяФТипаФинДокаПоРазделуНаСервере(Раздел);
		Элементы.ТЧФинДокИсходящие.ОтборСтрок = Новый ФиксированнаяСтруктура("ИмяДокумента", ДанныеИмен.ИмяИсходящего);
		Элементы.ТЧФинДокВходящие.ОтборСтрок = Новый ФиксированнаяСтруктура("ИмяДокумента", ДанныеИмен.ИмяВходящего);
		
		Элементы.ПоискПоДатеДокумента.Видимость = Элементы.ГруппаСписокФинДок.ТекущаяСтраница.Имя = "ФинДокВходящие";
		
	КонецЕсли;
	
	//доп. условие из-за того что в УТ3 нет входящих счетов...
	Если Раздел = "Счета" И (Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP") Тогда
		Элементы.ФинДокВходящие.Видимость = Ложь;
	ИначеЕсли Элементы.ФинДокВходящие.Видимость = Ложь Тогда	
		Элементы.ФинДокВходящие.Видимость = Истина;	
	КонецЕсли;

	ВидимостьТЧФинДокВходящиеДобавитьНаОсновании();

КонецПроцедуры

&НаСервере
Функция ИмяФТипаФинДокаПоРазделуНаСервере(Раздел, Входящий = Неопределено)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");

	ДанныеИмени = ОбработкаОбьект.ИмяТипаФинДокПоРазделу(Раздел, Входящий);
	
	Возврат ДанныеИмени;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокФинДокНаСервере(НачДата, КонДата)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокФинДок(НачДата, КонДата);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокФинДок(Команда)
	
	ЗаполнитьСписокФинДокНаСервере(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);

	ВидимостьКнопокФинДокИсходящие();

	ЗапомнитьСписокФинДокНаСервере()

КонецПроцедуры	

&НаСервере
Процедура ЗапомнитьСписокФинДокНаСервере()

	Объект.вФинансовыеДокументы.Загрузить(Объект.ФинансовыеДокументы.Выгрузить())

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокФинДокИсходящие(ДобавитьБезусловно = Ложь)

	ЕстьСписокДок = Объект.ФинансовыеДокументы.Количество() > 0 Или ДобавитьБезусловно;
	Элементы.ТЧФинДокИсходящиеОтправить.Доступность = ЕстьСписокДок;
	Элементы.ТЧФинДокИсходящиеПодписатьФинДок.Доступность = ЕстьСписокДок;
	Элементы.ТЧФинДокИсходящиеПроверитьСтатусы.Доступность = ЕстьСписокДок;
Элементы.ТЧФинДокИсходящиеПодписатьФинДокБезОтправки.Доступность = Ложь;//ЕстьСписокДок;
	Элементы.ТЧФинДокИсходящиеВыгрузитьВXML.Доступность = ЕстьСписокДок

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокФинДокВходящие()

	ЕстьСписокДок = Объект.ФинансовыеДокументы.Количество() > 0;
	Элементы.ТЧФинДокСчетаВходящиеЗаписатьСчета.Доступность = ЕстьСписокДок;
	Элементы.ТЧФинДокВходящиеДобавитьНаОсновании.Доступность = ЕстьСписокДок

КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокИсходящиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	ВидимостьКнопокФинДокИсходящие(Истина)

КонецПроцедуры

&НаКлиенте
Процедура ФинДокПослеУдаления(Элемент)

	ВидимостьКнопокФинДокИсходящие()

КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокИсходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ТЧФинДокИсходящие.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
		ОткрытьФормуВыбораДокумента(ТД, "ВыборФинДокЗавершение");
		Возврат;
	КонецЕсли;
		
	Если Поле.Имя = "ТЧФинДокИсходящиеНомерСтроки" ИЛИ Поле.Имя = "ТЧФинДокИсходящиеСтатусДокумента" Тогда
		Если ЗначениеЗаполнено(ТД.ТекстОшибки) Тогда
			СообщениеПользователю(ТД.ТекстОшибки)
		КонецЕсли;	
	ИначеЕсли Поле.Имя <> "ТЧФинДокИсходящиеФлажок" И Поле.Имя <> "КолонкаНазначениеПлатежа" Тогда
		ОткрытьДокумент(ТД, Элемент.Имя);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДокумента(ТекДанные, ИмяОповещения)
	
	Попытка
		Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ЭтаФорма);
		ОткрытьФорму("Документ." + СтрЗаменить(ТекДанные.ИмяДокумента, "%","") + ".ФормаВыбора",,,,,,Оповещение);
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при выборе документа '; uk='Помилка при обранні документа '") + ОписаниеОшибки())
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФинДокЗавершение(СтуркутраВыбора, Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.ТЧФинДокИсходящие.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;
	
	ТД.СсылкаНаДокумент = СтуркутраВыбора;
	
	ЗаполнитьСтрокуПоФинДок(ТД.СсылкаНаДокумент, ТД.НомерСтроки - 1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоФинДок(Док, НомерСтроки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокФинДок(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Док, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокИсходящиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.ТЧФинДокИсходящие.ТекущийЭлемент = Элементы.ТЧФинДокИсходящие.ПодчиненныеЭлементы.ТЧФинДокИсходящиеНомерСтрокиИКартинка.ПодчиненныеЭлементы.ТЧФинДокИсходящиеНомерСтроки;
		ТД = Элементы.ТЧФинДокИсходящие.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			ОткрытьФормуВыбораДокумента(ТД, "ВыборФинДокЗавершение");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокИсходящиеПриАктивизацииСтроки(Элемент)
	
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) И НЕ ЗначениеЗаполнено(ТД.ИмяДокумента) Тогда
		ТД.ИмяДокумента = ИмяФТипаФинДокаПоРазделуНаСервере(Объект.ТекВидОперации, Ложь);
		ТД.ИдентификаторКартинки = 5;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе_ФинДок(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ФинансовыеДокументы Цикл
		СтрокаТЧ.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки_ФинДок(Команда)

	Для Каждого СтрокаТЧ Из Объект.ФинансовыеДокументы Цикл
		СтрокаТЧ.Флажок = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ОтправитьФинДокНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.СформироватьXML_ФинДок(ОтборПериод.ДатаОкончания, Истина); //параметр Истина - говорит что передача на сервис Приват24
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	Возврат ВыпВЦикле;
	
КонецФункции

&НаСервере
Функция ОтправитьPDFДокНаСервере(ОтправкаНаСервис = Истина)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ВыгрузитьPDFДок(ВидДокументаPDF, ИмяПечатнойФормы, ОтправкаНаСервис); //параметр Истина - говорит что передача на сервис
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	Возврат ВыпВЦикле;
	
КонецФункции

&НаСервере
Функция ПроверитьНаличиеСтатусовПолучитьСтатусыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПроверитьНаличиеСтатусовПолучитьСтатусы(Объект.ТекВидОперации);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	Возврат ВыпВЦикле
	
КонецФункции

&НаКлиенте
Процедура ОтправитьФинДок(Команда)

	тСписокДокументов = "ФинансовыеДокументы";
	ВыгрузитьКолонкуНаСервере(тСписокДокументов, "Флажок");

	Если Не Объект.UnitТест И Не ПроверитьНаличиеСтатусовПолучитьСтатусыНаСервере() Тогда
		Возврат
	КонецЕсли;

	ВыпВЦикле = ОтправитьФинДокНаСервере();
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ОтправитьФинДокВЦикле", 1);
	Иначе
		
		Если Объект.ПодписыватьФинансовыеДокументыПриОтравке Тогда

			Объект.ФлагПодписатьБезОтправки = Ложь;
			ТипДок = Объект.ТекВидОперации;
			ПодписьSmartID(тСписокДокументов, ТипДок, , Ложь);

			//подпись криптоплагином
			//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
			//Если ЕстьДокументыДляПодписи Тогда
			//	ПодписьДокументов();
			//КонецЕсли;

			ПроверитьСтатусыФинДок("")

		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьPDFДок(Команда)

	Объект.ОтправлятьPDF = Истина;
	тСписокДокументов = "СписокЭкспортаPDF";
	ВыгрузитьКолонкуНаСервере(тСписокДокументов, "Флажок");

	ВыпВЦикле = ОтправитьPDFДокНаСервере();
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ОтправитьPDFДокВЦикле", 1);
	Иначе
		
		Если Объект.ПодписыватьФинансовыеДокументыПриОтравке И Объект.ОтправлятьPDF Тогда

			Объект.ФлагПодписатьБезОтправки = Ложь;
			ТипДок = Объект.ТекВидОперации;
			ПодписьSmartID(тСписокДокументов, ТипДок, , Ложь);

			//подпись криптоплагином
			//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере(Истина);
			//Если ЕстьДокументыДляПодписи Тогда
			//	ПодписьДокументов();
			//КонецЕсли;

			ПроверитьСтатусыФинДокPDF("")

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФинДокВЦикле()
	
	ВыпВЦикле = ОтправитьФинДокНаСервере(); 
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ОтправитьФинДокВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		
		Если Объект.ПодписыватьФинансовыеДокументыПриОтравке Тогда
			Объект.ФлагПодписатьБезОтправки = Ложь;
			тСписокДокументов = "ФинансовыеДокументы";
			ТипДок = Объект.ТекВидОперации;
			ПодписьSmartID(тСписокДокументов, ТипДок, , Ложь);

			//подпись криптоплагином
			//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
			//Если ЕстьДокументыДляПодписи Тогда
			//	ПодписьДокументов();
			//КонецЕсли;

			ПроверитьСтатусыФинДок("")

		КонецЕсли;

	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьPDFДокВЦикле()
	
	//ВыпВЦикле = ОтправитьPDFДокНаСервере();
	вДействиеАналитики = Объект.ДействиеАналитики;
	ВыпВЦикле = ОтправитьPDFДокНаСервере(Объект.ОтправлятьPDF);
	Объект.ДействиеАналитики = вДействиеАналитики;
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ОтправитьPDFДокВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		
		Если Объект.ПодписыватьФинансовыеДокументыПриОтравке И Объект.ОтправлятьPDF Тогда

			Объект.ФлагПодписатьБезОтправки = Ложь;
			тСписокДокументов = "СписокЭкспортаPDF";
			ТипДок = "PDFДокументы";//ТипДок = Объект.ТекВидОперации;
			ПодписьSmartID(тСписокДокументов, ТипДок, , Ложь);

			//подпись криптоплагином
			//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
			//Если ЕстьДокументыДляПодписи Тогда
			//	ПодписьДокументов();
			//КонецЕсли;

			ТипДок = "PDFДокументы";
			ПроверитьСтатусыФинДокPDF("")

		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФинДокВXML(Команда)
	
	Объект.ДействиеАналитики = "ФинДокВыгрузкаВФайл";
	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузки, "XML");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФинДокИзФайла(Команда)
	
	Объект.ДействиеАналитики = "ФинДокЗагрузкаИзФайла";

	Попытка
		СтруктураПараметров = Новый Структура;
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьXMLФинДокЗавершение", ЭтаФорма, СтруктураПараметров);
		НачатьПомещениеФайла(ОписаниеОповещения, , , , УникальныйИдентификатор) 
	Исключение
		СообщениеПользователю(НСтр("ru='Ошибка при загрузке файла';uk='Помилка при завантаженні файлу'") + Символы.ПС + ОписаниеОшибки(), Ложь)
	КонецПопытки;

	ВидимостьКнопокФинДокВходящие()

КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьXMLФинДокЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		
		ЗагрузитьXMLФинДокНаСервере(Адрес);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьXMLФинДокНаСервере(Адрес)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПрочитатьДанныеФинДокИзФайла(Адрес);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ТЧФинДокВходящие.ТекущиеДанные;
	
	Если Поле.Имя = "ТЧФинДокВходящиеНомерСтроки" Тогда
		Если ЗначениеЗаполнено(ТД.ТекстОшибки) Тогда
			СообщениеПользователю(ТД.ТекстОшибки)
		КонецЕсли
	ИначеЕсли Поле.Имя <> "Флажок" Тогда
		ОткрытьДокумент(ТД, Элемент.Имя)
	КонецЕсли	
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьВходящиеФинДокНаСервере(ТипДок)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ЗаписатьВходящиеФинДок(ТипДок);
	////ВыпВЦикле = ОбработкаОбьект.ЗаписатьДокументы(ТипДок);//ПросмотрДокЭДО
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	Возврат ВыпВЦикле;
	
КонецФункции

//ПросмотрДокЭДО
////&НаСервере
////Функция ЗаписатьВходящиеФинДокБезЗаписиНаСервере(ТипДок, ЗаписатьВсеДок = Ложь)
////	
////	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
////	ВыпВЦикле = ОбработкаОбьект.ЗаписатьВходящиеФинДок(ТипДок, ЗаписатьВсеДок);
////	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
////	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
////	Возврат ВыпВЦикле;
////	
////КонецФункции

&НаКлиенте
Процедура ЗаписатьВходящиеФинДок(Команда)
	
	ВыпВЦикле = ЗаписатьВходящиеФинДокНаСервере(Объект.ТекВидОперации);
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ЗаписатьВходящиеФинДокВЦикле", 1);
	КонецЕсли;

	ЗапомнитьСписокФинДокНаСервере()

	//ПросмотрДокЭДО
	////меняем документу статус на "просмотрено" путем отправки запроса на получение контента в процессе записи док. в ИБ
	//запрос на получение контента (и получение статуса "просмотрено") БУДЕТ (в случае реализации) отправляться при предварительном просмотре документа

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВходящиеФинДокВЦикле()
	
	ВыпВЦикле = ЗаписатьВходящиеФинДокНаСервере(Объект.ТекВидОперации);
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ЗаписатьВходящиеФинДокВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокВходящиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСписокФинДокПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Элементы.ПоискПоДатеДокумента.Видимость = ТекущаяСтраница.Имя = "ФинДокВходящие";

	ВидимостьТЧФинДокВходящиеДобавитьНаОсновании();
	ВидимостьКолонкаНазначениеПлатежа();
	ВидимостьФлагСчетИзЗаказа();
	ВидимостьТЧФинДокИсходящиеИмяДокумента();
	УстановитьВидимостьДоступность()

КонецПроцедуры

&НаКлиенте
Процедура ТекстАктыНажатие(Элемент)

	Если Найти("BASR,AAA", Объект.ИдКонф) > 0 Тогда
		СообщениеПользователю(НСтр("ru = 'Данный вид документа отсутствует в вашей конфигурации.'; 
		 |uk='Даний вид документа відсутній у вашій конфігурації.'"), Ложь);
		Возврат	
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент,, НСтр("ru='Акты выполненных работ';uk='Акти виконаних робіт'"));
	УстановитьТекВидОперации("Акты");
	ВидимостьКолонкаНазначениеПлатежа();
	ВидимостьФлагСчетИзЗаказа()
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьФинДокНаСервере(showOnlyUnread)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Если Объект.ТекВидОперации = "ВходящиеНН" Тогда
		ВыпВЦикле = ОбработкаОбьект.ЗагрузитьВходящиеНН(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, "РегистрацияВходящейНН"); 
	Иначе	
		ВыпВЦикле = ОбработкаОбьект.ЗагрузитьФинДок(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Объект.ТекВидОперации,
			showOnlyUnread); 
	КонецЕсли;	
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

//ПросмотрДокЭДО
////&НаСервере
////Функция тзНовыйДокФинОчиститьНаСервере()
////	
////	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
////	ОбработкаОбьект.тзНовыйДокФинОчистить(); 
////	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")

////КонецФункции

&НаКлиенте
Процедура ЗагрузитьФинДок(Команда)

	//ДействиеАналитики = "ННЧтениеСписка";

	//ПросмотрДокЭДО
	////Если Не Объект.ТекВидОперации = "ВходящиеНН" Тогда
	////	тзНовыйДокФинОчиститьНаСервере()
	////КонецЕсли;
	Если showOnlyUnread = Неопределено Тогда
		showOnlyUnread = Ложь
	КонецЕсли;

	ВыпВЦикле = ЗагрузитьФинДокНаСервере(showOnlyUnread);

	ВидимостьТЧФинДокВходящиеДобавитьНаОсновании();

	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ЗагрузитьФинДокВЦикле", 2);

		//ПросмотрДокЭДО
	////Иначе
	////	ТипДок = Объект.ТекВидОперации;
	////	ЗаписатьВсеДок = Истина;
	////	ЗаписатьВходящиеФинДокБезЗаписиНаСервере(ТипДок, ЗаписатьВсеДок);
	////	ЭтаФорма.Доступность = Истина

	КонецЕсли;

	//Если Объект.ФинансовыеДокументы.Количество() = 0 Тогда
	Если Не Объект.UnitТест И (Объект.ТекВидОперации <> "ВходящиеНН" И Объект.ФинансовыеДокументы.Количество() = 0
			Или Объект.ТекВидОперации = "ВходящиеНН" И Объект.СписокДокументов.Количество() = 0) Тогда
		СообщениеПользователю(НСтр("ru = 'Нет полученных документов!'; uk = 'Немає отриманих документів!'"), Ложь)
	КонецЕсли;

	ВидимостьКнопокНалоговыеВходящие();
	ВидимостьКнопокФинДокВходящие();

	Если Объект.ТекВидОперации = "ВходящиеНН" Тогда
		ЗапомнитьСписокДокументовСервер()
	Иначе
		ЗапомнитьСписокФинДокНаСервере()
	КонецЕсли;

	ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФинДокВЦикле()
	
	ВыпВЦикле = ЗагрузитьФинДокНаСервере(showOnlyUnread); 

	ВидимостьТЧФинДокВходящиеДобавитьНаОсновании();

	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ЗагрузитьФинДокВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		ЭтаФорма.Доступность = Истина;

		//ПросмотрДокЭДО
		////ТипДок = Объект.ТекВидОперации;
		////ЗаписатьВсеДок = Истина;
		////ЗаписатьВходящиеФинДокБезЗаписиНаСервере(ТипДок, ЗаписатьВсеДок)

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗаказыНажатие(Элемент)
	
	Если Найти("BP,BASC,UABY", Объект.ИдКонф) > 0 Тогда
		СообщениеПользователю(НСтр("ru = 'Данный вид документа отсутствует в вашей конфигурации.'; 
		 |uk='Даний вид документа відсутній у вашій конфігурації.'"), Ложь);
		Возврат;	
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Заказы';uk='Замовлення'"));
	УстановитьТекВидОперации("Заказы");
	ВидимостьКолонкаНазначениеПлатежа();
	ВидимостьФлагСчетИзЗаказа()
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриказыНаОтпускНажатие(Элемент)
	
	Если Найти("BP,UNF,BSB,UT_3,BASR,AAA,OSMD", Объект.ИдКонф) > 0 И МетаданныеИмяНаСервере() <> "BASPBCORP" Тогда
		//кроме ИНАГРО_НачислениеОтпускаРаботникамОрганизаций в BASАгроБухгалтерия, BASБухгалтерияЭлеватораМельницыИКомбикормовогоЗавода,
		// КомплексноеРешениеСельскохозяйственногоПредприятия
		СообщениеПользователю(НСтр("ru = 'Данный вид документа отсутствует в вашей конфигурации.'; 
		 |uk='Даний вид документа відсутній у вашій конфігурації.'"), Ложь);
		Возврат;	
	КонецЕсли;
	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элементы.ОблФинДок, , НСтр("ru='Приказы на отпуск';uk='Накази на відпустку'"));
	УстановитьТекВидОперации("ПриказыНаОтпуск");
	ВидимостьКолонкаНазначениеПлатежа();
	ВидимостьФлагСчетИзЗаказа()
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОтчетЕдиныйНалогНажатие(Элемент)

	СтруктураОтвета = ТекстОтчетЕдиныйНалогНажатиеНаСервере();
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	СтраницаОтчета = СтруктураОтвета.Адрес;
	Элементы.СтраницаОтчета.Документ.cookie = СтруктураОтвета.Куки;
	
КонецПроцедуры

&НаСервере
Функция ТекстОтчетЕдиныйНалогНажатиеНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ЗаполнитьИОтправитьОтчетНаБО("4", ОтборПериод.ДатаНачала); 
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Функция ПроверитьСтатусыФинДокНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПроверитьСтатусыФинДок(Объект.ТекВидОперации);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСтатусыФинДок(Команда)

	Объект.ДействиеАналитики = "ФинДокПроверкаСтатусов";	

	вДействиеАналитики = Объект.ДействиеАналитики;
	ВыпВЦикле = ПроверитьСтатусыФинДокНаСервере();
	Объект.ДействиеАналитики = вДействиеАналитики;
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ПроверитьСтатусыФинДокВЦикле", 1.5);
	КонецЕсли;

	ЗапомнитьСписокФинДокНаСервере();

	ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатусыФинДокВЦикле()

	вДействиеАналитики = Объект.ДействиеАналитики;
	ВыпВЦикле = ПроверитьСтатусыФинДокНаСервере();
	Объект.ДействиеАналитики = вДействиеАналитики;
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ПроверитьСтатусыФинДокВЦикле");
		ЗапомнитьСписокФинДокНаСервере();
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция ПроверитьСтатусыФинДокPDFНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПроверитьСтатусыФинДокPDF("PDFДокументы");
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСтатусыФинДокPDF(Команда)

	Объект.ДействиеАналитики = "ПДФДокПроверкаСтатусов";	

	вДействиеАналитики = Объект.ДействиеАналитики;
	ВыпВЦикле = ПроверитьСтатусыФинДокPDFНаСервере();
	Объект.ДействиеАналитики = вДействиеАналитики;
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ПроверитьСтатусыФинДокPDFВЦикле", 1.5);
	КонецЕсли;

	ЗапомнитьСписокЭкспортаPDFНаСервере();

	ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатусыФинДокPDFВЦикле()
	
	вДействиеАналитики = Объект.ДействиеАналитики;
	ВыпВЦикле = ПроверитьСтатусыФинДокPDFНаСервере();
	Объект.ДействиеАналитики = вДействиеАналитики;
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ПроверитьСтатусыФинДокPDFВЦикле");
		ЗапомнитьСписокЭкспортаPDFНаСервере();
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодДатаОкончанияПриИзменении(Элемент)

	ПроверитьПериоды();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПериоды()
	
	Если ОтборПериод.ДатаНачала > КонецДня(ТекущаяДата()) ИЛИ ОтборПериод.ДатаОкончания > КонецДня(ТекущаяДата()) Тогда
		
		СообщениеПользователю(НСтр("ru = 'Нельзя указывать дату больше текущей';uk='Не можна вказувати дату більше поточної'"), Ложь)
		
	КонецЕсли;
	
	ОтборПериод.ДатаНачала = Мин(ОтборПериод.ДатаНачала, ТекущаяДата());
	ОтборПериод.ДатаОкончания = Мин(ОтборПериод.ДатаОкончания, ТекущаяДата());
	
	ДатаОтбора = Мин(ДатаОтбора, ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодДатаНачалаПриИзменении(Элемент)

	ПроверитьПериоды();

КонецПроцедуры

&НаСервере
Функция ПрочитатьКурсВалютНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПрочитатьКурсВалют(Объект.ТипКурса, ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, Валюта, Кратность);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьКурсВалют(Команда)

	ВыпВЦикле = ПрочитатьКурсВалютНаСервере(); 
	
	Если ВыпВЦикле Тогда //пока курсы валют читаются быстро, и цикл наврядли пригодится, т.е. всегда будет Ложь
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ПрочитатьКурсВалютВЦикле", 1)
	Иначе
		СообщениеПользователю(НСтр("ru='Курсы валют прочитаны.';uk='Курси валют прочитані.'"), Ложь)
	КонецЕсли;

	ПоказатьГрафикКурсовВалют();

	ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГрафикКурсовВалют(Валюта = Неопределено)
	
	ГрафикКурсовВалют.Очистить(); 
	
	Если ОтборПериод.ДатаОкончания - ОтборПериод.ДатаНачала > 60*60*24 * 14 Тогда //если разность больше 14 дней тогда график и так будет красивый
		парНачПериода = ОтборПериод.ДатаНачала;
		парКонПериода = ОтборПериод.ДатаОкончания;

	Иначе //иначе чтобы показать динамику графика нужно отнять 14 назад	
		парНачПериода = ОтборПериод.ДатаНачала - 60*60*24 * 14;
		парКонПериода = ОтборПериод.ДатаОкончания;
	КонецЕсли;
	
	Элементы.ГрафикКурсовВалют.Заголовок = НСтр("ru = 'Курсы валют '; uk='Курси валют '") + Элементы.ТипКурса.СписокВыбора.НайтиПоЗначению(ТипКурса) + НСтр("ru = ', динамика'; uk=', динаміка'") + " за " + Формат(парНачПериода, "ДФ=dd.MM.yy") + " - " + Формат(парКонПериода, "ДФ=dd.MM.yy"); 
	Элементы.ГрафикКурсовВалют.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ГрафикКурсовВалют.ОтображатьЗаголовок = Истина;
	ГрафикКурсовВалют.ТипДиаграммы = ТипДиаграммы.График;
	ГрафикКурсовВалют.Анимация = АнимацияДиаграммы.Использовать;
	СписокСерий = Новый Структура;
	
	Для Каждого СтокаТЗ Из Объект.ДанныеГрафика Цикл
		
		Если ЗначениеЗаполнено(Валюта) И Строка(СтокаТЗ.Валюта) <> Валюта Тогда
			Продолжить;	
		КонецЕсли;	
		
		Если СписокСерий.Свойство(Строка(СтокаТЗ.Валюта)) = Ложь Тогда
			Серия = ГрафикКурсовВалют.УстановитьСерию(Строка(СтокаТЗ.Валюта));
			Серия.Текст = Строка(СтокаТЗ.Валюта);
			СписокСерий.Вставить(Строка(СтокаТЗ.Валюта),Серия);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтокаТЗ Из Объект.ДанныеГрафика Цикл
		
		Если ЗначениеЗаполнено(Валюта) И Строка(СтокаТЗ.Валюта) <> Валюта Тогда
			Продолжить;	
		КонецЕсли;
		
		Точка = ГрафикКурсовВалют.УстановитьТочку(Формат(СтокаТЗ.Дата, "ДФ=dd.MM.yy"));
		Точка.Текст = Формат(СтокаТЗ.Дата, "ДФ=dd.MM.yy");
		ГрафикКурсовВалют.УстановитьЗначение(Точка, СписокСерий[Строка(СтокаТЗ.Валюта)], Число(СтокаТЗ.Курс));
	КонецЦикла;	
	
	ГрафикКурсовВалют.ПолучитьКартинку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьКурсВалютВЦикле()
	
	ВыпВЦикле = ПрочитатьКурсВалютНаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ПрочитатьКурсВалютВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		СообщениеПользователю(НСтр("ru='Курсы валют прочитаны.';uk='Курси валют прочитані.'"), Ложь)
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКурсыВалютНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаписатьКурсыВалют();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКурсыВалют(Команда)

	ЗаписатьКурсыВалютНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВалюту(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.КурсыВалют Цикл
		СтрокаТЧ.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиВалюты(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.КурсыВалют Цикл
		СтрокаТЧ.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьВходящиеНННаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ЗаписатьВходящиеНН("РегистрацияВходящегоНалоговогоДокумента"); 
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьВходящиеНН(Команда)
	
	ВыпВЦикле = ЗаписатьВходящиеНННаСервере();
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ЗаписатьВходящиеННВЦикле", 1);
	КонецЕсли;

	ЗапомнитьСписокДокументовСервер()

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВходящиеННВЦикле()
	
	ВыпВЦикле = ЗаписатьВходящиеНННаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ЗаписатьВходящиеННВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьННИзФайла(Команда)
	
	Объект.ДействиеАналитики = "ННЗагрузкаИзФайла";

	Попытка
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьXMLННЗавершение", ЭтаФорма);
		НачатьПомещениеФайла(ОписаниеОповещения, , , , УникальныйИдентификатор) 
	Исключение
		СообщениеПользователю(НСтр("ru='Ошибка при загрузке файла';uk='Помилка при завантаженні файлу'") + Символы.ПС + ОписаниеОшибки(), Ложь)
	КонецПопытки;

	ВидимостьКнопокНалоговыеВходящие()

КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьXMLННЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		
		ЗагрузитьXMLНННаСервере(Адрес);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьXMLНННаСервере(Адрес)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПрочитатьДанныеННИзФайла(Адрес);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВходящиеИсходящиеННПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьТекВидОперации("НН");
	
	Элементы.ПоискПоДатеДокумента.Видимость = ТекущаяСтраница.Имя = "ННВходящие";
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеННВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ВходящиеНН.ТекущиеДанные;

	Если ТД.СтатусДок = "18" Тогда
		ТекстСообщения = НСтр("ru='Перед просмотром документ необходимо расшифровать!';uk='Перед переглядом документ необхідно розшифрувати!'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	Если Поле.Имя = "ВходящиеНННомерСтроки" Тогда
		Если ЗначениеЗаполнено(ТД.ТекстОшибки) Тогда
			СообщениеПользователю(ТД.ТекстОшибки)
		КонецЕсли;
	ИначеЕсли Поле.Имя <> "ВходящиеННФлажок" Тогда
		ОткрытьВходящуюНалоговую(ТД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВходящуюНалоговую(ТД) 
	
	ТекДок = ТД.СсылкаНаДокумент;
	
	Если НЕ ЗначениеЗаполнено(ТекДок) Тогда
		Возврат;
	КонецЕсли;
	
	Док = Новый Структура;
    Док.Вставить("Ключ", ТекДок);
	
    Попытка
		ОткрытьФорму("Документ." + ТД.ВидДокумента + ".ФормаОбъекта", Док);
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при открытии налогового документа '; uk='Помилка при відкритті податкового документа '") + ОписаниеОшибки())
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикКурсовВалютВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)

	Если ТипЗнч(ЗначениеДиаграммы) = Тип("СерияДиаграммы") Тогда
		Попытка
			ЗначениеЗаполнено(ЗначениеДиаграммы.Значение);
			ПоказатьГрафикКурсовВалют(ЗначениеДиаграммы.Значение);	
		Исключение
		КонецПопытки;
	ИначеЕсли ТипЗнч(ЗначениеДиаграммы) = Тип("ЗначениеДиаграммы") Тогда
		Попытка
			ЗначениеЗаполнено(ЗначениеДиаграммы.Серия.Значение);
			ПоказатьГрафикКурсовВалют(ЗначениеДиаграммы.Значение);	
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПечатьДокументовНаСервере(ИмяПечатнойФормы)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПечатьДокументов(ИмяПечатнойФормы);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокументов(Команда)
	
	Если Не ЗначениеЗаполнено(ИмяПечатнойФормы) Тогда
		
		СообщениеПользователю(НСтр("ru = 'Не выбрана печатная форма'; uk='Не вибрана печатна форма'"), Ложь);
		Возврат;
	КонецЕсли;	
	
	ПечатьДокументовНаСервере(ИмяПечатнойФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("РежимВыбора, ТекущаяСтрока, Отбор", Истина, Объект.СтавкаНДС, Новый Структура());
	
	Попытка
		Если Найти("BP,BASC,UT_3,KUBU,ERP,BASR,UABY", Объект.ИдКонф) > 0 Тогда 
			Элементы.СтавкаНДС.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС");
		Иначе
			//	BSB, AAA, ...
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("Справочник.СтавкиНДС.ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("СтавкаНДСНачалоВыбораЗавершение", ЭтаФорма));
		КонецЕсли;	
	Исключение
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.СтавкиНДС.ФормаВыбора", ПараметрыФормы);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.СтавкаНДС = Результат;
		
	КонецЕсли;
	
КонецПроцедуры // СтавкаНДСНачалоВыбораЗавершение()

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда 
		Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");	
	ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
		Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
		Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ИначеЕсли Объект.ИдКонф = "BASR" Тогда
		Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Магазины")
	Иначе
		//	BSB, ...
		Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" ИЛИ Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Или Объект.ИдКонф = "BASR" Тогда 
		Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Склады");
		Элементы.СкладПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда 
		Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МестаХранения");
		Элементы.СкладПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МестаХранения");
	ИначеЕсли Объект.ИдКонф = "AAA" Тогда
		Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании");
	Иначе
		//	BSB, ...
		Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");	
		Элементы.СкладПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПродажиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда 
		Элементы.ЦенаПродажи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры");
	ИначеЕсли Объект.ИдКонф = "AAA" Тогда
		Элементы.ЦенаПродажи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыЦен");
	ИначеЕсли Объект.ИдКонф = "UABY" И ВРег(МетаданныеИмяНаСервере()) = ВРег("УчетБюджетногоУчреждения") Тогда
		Элементы.ЦенаПродажи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦенУслугТМЦ")
	Иначе
		//	BSB, BASR, UABY/UAБюджет, ...
		Элементы.ЦенаПродажи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагКонтрагентыПриИзменении(Элемент)
	
	ФлагНоменклатура = НЕ ФлагКонтрагенты;
	ФлагНоменклатураПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстРасходныеНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент,, НСтр("ru='Расходные накладные';uk='Видаткові накладні'"));
	УстановитьТекВидОперации("Расходные");
	ВидимостьКолонкаНазначениеПлатежа();
	ВидимостьФлагСчетИзЗаказа()

КонецПроцедуры

&НаКлиенте
Процедура ТекстОтчетыНажатие(Элемент)

	Если Объект.ИдКонф = "BASR" Или Объект.ИдКонф = "AAA" Тогда
		СообщениеПользователю(НСтр("ru = 'Данный вид документа отсутствует в вашей конфигурации.'; 
		 |uk='Даний вид документа відсутній у вашій конфігурації.'"), Ложь);
		Возврат	
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);
    УстановитьТекВидОперации("Отчеты");
	ВидимостьФлагСчетИзЗаказа()

КонецПроцедуры

&НаКлиенте
Процедура ТекстPDFДокументыНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Истина);
	ВидимостьФлагСчетИзЗаказа()

КонецПроцедуры

&НаКлиенте
Процедура СтатьяЗатратПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.СтатьяЗатратПоУмолчанию.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат");
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияПапка24(Команда)

	Если Команда = Истина Тогда
		ФлагЗакрытьСессию = Истина
	Иначе
		ФлагЗакрытьСессию = Ложь
	КонецЕсли;
	АвторизацияПапка24НаСервере(ФлагЗакрытьСессию);

	ОбновитьОтображениеСтатуса(Объект.Авторизовано, Объект.EmailПапка24);
	
КонецПроцедуры

&НаСервере
Процедура АвторизацияПапка24НаСервере(ФлагЗакрытьСессию = Ложь)
	
	РезультатАвторизации = Неопределено;
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.АвторизацияПапка24(ФлагЗакрытьСессию);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстВыгрузкаPDFНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ВидимостьКомандПапка24(Истина);
	ПереключитьРабочуюОбласть(Элемент, Истина);
	ВидимостьФлагСчетИзЗаказа()

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКомандПапка24(Видимость)
	
	Элементы.СписокЭкспортаPDFЭмайлКонтрагента.Видимость = Объект.ОтправлятьPDF;
	Элементы.ВыгрузитьPDF.Видимость = Видимость;
	Элементы.СписокЭкспортаPDFСохранитьВPDF.Видимость = Видимость;
	Элементы.ГруппаАвторизационныеДанные.Видимость = Видимость;
	Элементы.СписокЭкспортаPDFИмяДокумента.Видимость = Видимость;
	
	Элементы.ПечатьДокументовСQR.Видимость = НЕ Видимость;
	Элементы.СписокЭкспортаPDFОткрытьФормуНастройкиПечати.Видимость = НЕ Видимость;

	УстановитьДоступностьСписокЭкспортаPDFНастройкаПодписи()

КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьPDF(Команда)

	//ПаперЛесс

	Если Не Объект.UnitТест И НЕ ЗначениеЗаполнено(Объект.СессияДок) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо авторизоваться на сервисе Paperless.';uk='Необхідно авторизуватися на сервісі Paperless.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
		Возврат;
	КонецЕсли;

	Если Объект.ИспользоватьSmartIdВPaperLess Тогда
		тСписокДокументов = "СписокЭкспортаPDF";
		ВыгрузитьКолонкуНаСервере(тСписокДокументов, "Флажок")
	КонецЕсли;

	ВыпВЦикле = ВыгрузитьPDFНаСервере(Истина); 
	
	Если ВыпВЦикле Тогда
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ВыгрузитьPDFВЦикле", 1);
	КонецЕсли;
	
	ОбновитьОтображениеСтатуса(Объект.Авторизовано, Объект.EmailПапка24);

	//подпись криптоплагином
	//Если ЗначениеЗаполнено(Объект.XML) И Найти(Объект.XML, "]") > 0 Тогда
	//	ПодписьДокументов();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьPDFНаСервере(ОтправкаНаСервис = Истина)

	//ПаперЛесс
	Если ЗначениеЗаполнено(Объект.XML) Тогда
		ВыгрузкаИПодпись = Истина;
	КонецЕсли;
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ВыгрузитьPDF(ВидДокументаPDF, ИмяПечатнойФормы, ОтправкаНаСервис);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьPDFВЦикле()

	//ПаперЛесс
	ВыпВЦикле = ВыгрузитьPDFНаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ВыгрузитьPDFВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;

		Если Объект.ПодписыватьPDF И Не Объект.UnitТест Тогда
			Если Объект.ИспользоватьSmartIdВPaperLess Тогда
				тСписокДокументов = "СписокЭкспортаPDF";
				ТипДок = "PDFPaperless";
				ПодписыватьДокумент = Ложь;
				ПодписьSmartID(тСписокДокументов, ТипДок, ПодписыватьДокумент, Ложь)
			Иначе
				Если ЗначениеЗаполнено(Объект.XML) Тогда
					ПодписьДокументов();
				КонецЕсли
			КонецЕсли
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеPDF(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.СписокЭкспортаPDF Цикл
		СтрокаТЧ.Флажок = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиPDF(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.СписокЭкспортаPDF Цикл
		СтрокаТЧ.Флажок = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВидовДокументов_PDF(Команда)
	
	//ПАПКА24
	Элементы.ВидДокументаPDF.СписокВыбора.Очистить();
	
	Если Объект.ИдКонф = "UNF" Или Объект.ИдКонф = "BSB" Тогда
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("СчетНаОплату", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("АктВыполненныхРабот", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("РасходнаяНакладная", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("СчетНаОплатуПокупателю", НСтр("ru='Счет на оплату покупателю';uk='Рахунок на оплату покупцю'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("РеализацияТоваровУслуг", НСтр("ru='Реализация товаров и услуг';uk='Реалізація товарів і послуг'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF.СписокВыбора[0].Значение
		
	ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("СчетНаОплатуКлиенту", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("АктВыполненныхРабот", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("РеализацияТоваровУслуг", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "BASR" Тогда
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("РеализацияТоваров", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "AAA" Тогда
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("СчетНаОплату", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("РеализацияТоваров", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "UABY" Тогда
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("СчетИсходящий", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("РеализацияУслуг", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));
		//т.к. есть док. РеализацияУслуг
		//Элементы.ВидДокументаPDF.СписокВыбора.Добавить("АктВыполненныхРаботПоДоговору", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));
		Элементы.ВидДокументаPDF.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF.СписокВыбора[0].Значение

	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидДокументаPDF) И Элементы.ВидДокументаPDF.СписокВыбора.НайтиПоЗначению(ВидДокументаPDF) = Неопределено Тогда
		
		СписокВыбора = ЗаполнитьПолныйСписокВидовДокументов();
		
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			
			Элементы.ВидДокументаPDF.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	//ЭДО pdf
	Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Очистить();
	
	Если Объект.ИдКонф = "UNF" Или Объект.ИдКонф = "BSB" Тогда
		
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("СчетНаОплату", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("АктВыполненныхРабот", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("РасходнаяНакладная", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора[1].Значение
		
	ИначеЕсли Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" Тогда

		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("СчетНаОплатуПокупателю", НСтр("ru='Счет на оплату покупателю';uk='Рахунок на оплату покупцю'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("РеализацияТоваровУслуг", НСтр("ru='Реализация товаров и услуг';uk='Реалізація товарів і послуг'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора[0].Значение
		
	ИначеЕсли Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Тогда
		
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("СчетНаОплатуКлиенту", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("АктВыполненныхРабот", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("РеализацияТоваровУслуг", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "BASR" Тогда
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("РеализацияТоваров", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "AAA" Тогда
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ЗаказПоставщику", НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("СчетНаОплату", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("РеализацияТоваров", НСтр("ru='Расходная накладная';uk='Видаткова накладна'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора[1].Значение

	ИначеЕсли Объект.ИдКонф = "UABY" Тогда
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("СчетИсходящий", НСтр("ru='Счет на оплату';uk='Рахунок на оплату'"));	
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("РеализацияУслуг", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));	
		//т.к. есть док. РеализацияУслуг
		//Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("АктВыполненныхРаботПоДоговору", НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'"));
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить("ВсеВиды", НСтр("ru='Еще...';uk='Ще...'"));
		ВидДокументаPDF = Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора[0].Значение

	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидДокументаPDF) И Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.НайтиПоЗначению(ВидДокументаPDF) = Неопределено Тогда
		
		СписокВыбора = ЗаполнитьПолныйСписокВидовДокументов();
		
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			
			Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьСписокПечатныхФорм();
			
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаPDFПриИзменении(Элемент)
	
	Объект.СписокЭкспортаPDF.Очистить();
	
	Если ВидДокументаPDF = "ВсеВиды" Тогда
		
		ВидДокументаPDF = "...";
		
		Элементы.ВидДокументаPDF.СписокВыбора.Очистить();
		Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Очистить();
		
		СписокВыбора = ЗаполнитьПолныйСписокВидовДокументов();
		
		Для Каждого СтрокаСписка Из СписокВыбора Цикл
			
			Элементы.ВидДокументаPDF.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
			Элементы.ВидДокументаPDF_PDFДокументы.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
			
		КонецЦикла;
		
	Иначе	
		
		ЗаполнитьСписокПечатныхФорм();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПечатныхФорм()
	
	//ПАПКА24
	Элементы.ИмяПечатнойФормы.СписокВыбора.Очистить();
	
	ИмяПечатнойФормы = "";
	
	Если ЗначениеЗаполнено(ВидДокументаPDF) Тогда//одинаковый реквизит поля выпадающего списка в ПаперЛесс и ПДФ-док
		
		Попытка
			СписокИменПечатныхФорм = ИменаПечатныхФормНаСервере();	
			
			Для Каждого СтрокаСписка Из СписокИменПечатныхФорм Цикл
				
				Если СтрокаСписка.Значение = "Реестр" Тогда //ресстр документов нам не нужен
					Продолжить;	
				КонецЕсли;
				
				Элементы.ИмяПечатнойФормы.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);	
				
				Если НЕ ЗначениеЗаполнено(ИмяПечатнойФормы) Тогда
					ИмяПечатнойФормы = СтрокаСписка.Значение;	
				КонецЕсли;	
				
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		Если Элементы.ИмяПечатнойФормы.СписокВыбора.Количество() = 0 Тогда	
			
			Попытка
				ЗаполнитьПечатныеФормыПоМетаданным(ВидДокументаPDF);
				Возврат;
				ДоступныеКоманды = Новый СписокЗначений;
				
				Выполнить("ДоступныеКоманды = ДополнительныеОтчетыИОбработки.ПолучитьДоступныеКоманды(Истина, ""Документ."" + ВидДокументаPDF, Ложь,	"""",	ПредопределенноеЗначение(""Перечисление.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма""))");
				
				Для Каждого СтрокаКоманд Из ДоступныеКоманды Цикл
					Элементы.ИмяПечатнойФормы.СписокВыбора.Добавить(СтрокаКоманд.Ссылка, СтрокаКоманд.Представление);		
				КонецЦикла;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//ЭДО
	Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Очистить();
	
	ИмяПечатнойФормы = "";
	
	Если ЗначениеЗаполнено(ВидДокументаPDF) Тогда//одинаковый реквизит поля выпадающего списка в ПаперЛесс и ПДФ-док
		
		Попытка
			СписокИменПечатныхФорм = ИменаПечатныхФормНаСервере();	
			
			Для Каждого СтрокаСписка Из СписокИменПечатныхФорм Цикл
				
				Если СтрокаСписка.Значение = "Реестр" Тогда //ресстр документов нам не нужен
					Продолжить;	
				КонецЕсли;
				
				Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);	
				
				Если НЕ ЗначениеЗаполнено(ИмяПечатнойФормы) Тогда
					ИмяПечатнойФормы = СтрокаСписка.Значение;
				КонецЕсли;	
				
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		Если Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Количество() = 0 Тогда	
			
			Попытка
				ЗаполнитьПечатныеФормыПоМетаданным(ВидДокументаPDF);
				Возврат;
				ДоступныеКоманды = Новый СписокЗначений;
				
				Выполнить("ДоступныеКоманды = ДополнительныеОтчетыИОбработки.ПолучитьДоступныеКоманды(Истина, ""Документ."" + ВидДокументаPDF, Ложь,	"""",	ПредопределенноеЗначение(""Перечисление.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма""))");
				
				Для Каждого СтрокаКоманд Из ДоступныеКоманды Цикл
					Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Добавить(СтрокаКоманд.Ссылка, СтрокаКоманд.Представление);		
				КонецЦикла;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли
	КонецЕсли;

	Если ВидДокументаPDF = "СчетНаОплатуПокупателю" Тогда
		Для каждого ЭлементСписка Из Элементы.ИмяПечатнойФормы.СписокВыбора Цикл
			Если Найти(ЭлементСписка.Представление, НСтр("ru='Счет на оплату';uk='Рахунок на оплату'")) > 0 Тогда
				ИмяПечатнойФормы = ЭлементСписка.Значение;
				Прервать
			КонецЕсли
		КонецЦикла
	КонецЕсли

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПечатныеФормыПоМетаданным(ВидДокумента)
	
	Для Каждого СтрокаКоманды Из Метаданные.Документы[ВидДокумента].Команды Цикл
		Если Найти(Строка(СтрокаКоманды.Группа), "Печать") > 0 Тогда
			
			Если СтрокаКоманды.Имя = "РасходнаяНакладная" Тогда 
				Элементы.ИмяПечатнойФормы.СписокВыбора.Добавить("Накладная", СтрокаКоманды.Синоним);
				Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Добавить("Накладная", СтрокаКоманды.Синоним);
			Иначе	
				Элементы.ИмяПечатнойФормы.СписокВыбора.Добавить(СтрокаКоманды.Имя, СтрокаКоманды.Синоним);
				Элементы.ИмяПечатнойФормыPDF.СписокВыбора.Добавить(СтрокаКоманды.Имя, СтрокаКоманды.Синоним);
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ИменаПечатныхФормНаСервере()
	
	КоллекцияКомандПечати = УправлениеПечатью.КомандыПечатиФормы("Документ." + ВидДокументаPDF + ".Форма.ФормаСписка");
	
	СписокИменПечатныхФорм = Новый СписокЗначений;
	
	Для Каждого СтрокаТЗ Из КоллекцияКомандПечати Цикл
		СписокИменПечатныхФорм.Добавить(СтрокаТЗ.Идентификатор, СтрокаТЗ.Представление);
	КонецЦикла;
	
	Возврат СписокИменПечатныхФорм;
	
КонецФункции	

&НаСервере
Функция ЗаполнитьПолныйСписокВидовДокументов(ВидДокумента = Неопределено)
	
	СписокВыбора = Новый СписокЗначений;	
	
	Для Каждого СтрокаДок Из Метаданные.Документы Цикл
		
		Если Найти(НРег(СтрокаДок.Имя), "удалить") > 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ВидДокумента <> Неопределено И СтрокаДок.Имя <> ВидДокумента Тогда
			Продолжить;	
		КонецЕсли;
		
		СписокВыбора.Добавить(СтрокаДок.Имя, СтрокаДок.Синоним);
		
	КонецЦикла;	
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокPDF(Команда)
	
	Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьСписокPDFНаСервере(ВидДокументаPDF);

	ВидимостьКнопокPDFДокИсходящие();

	ЗапомнитьСписокЭкспортаPDFНаСервере()

КонецПроцедуры

&НаСервере
Процедура ЗапомнитьСписокЭкспортаPDFНаСервере()

	Объект.вСписокЭкспортаPDF.Загрузить(Объект.СписокЭкспортаPDF.Выгрузить())

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокPDFДокИсходящие(ДобавитьБезусловно = Ложь)

	ЕстьСписокДок = Объект.СписокЭкспортаPDF.Количество() > 0 Или ДобавитьБезусловно;
	Элементы.ВыгрузитьPDFДокументы.Доступность = ЕстьСписокДок;
	Элементы.ПроверитьСтатусыPDFДокументов.Доступность = ЕстьСписокДок;
	Элементы.СписокPDFДокументыСохранитьВPDF.Доступность = ЕстьСписокДок;
	Элементы.СписокPDFДокументыПодписать.Доступность = ЕстьСписокДок;
	Элементы.СписокPDFДокументыПодписатьФинДокБезОтправки.Доступность = ЕстьСписокДок;

	Элементы.ВыгрузитьPDF.Доступность = ЕстьСписокДок;
	Элементы.СписокЭкспортаPDFСохранитьВPDF.Доступность = ЕстьСписокДок;
	Элементы.ПечатьДокументовСQR.Доступность = ЕстьСписокДок

КонецПроцедуры

&НаКлиенте
Процедура PDFДокПослеУдаления(Элемент)

	ВидимостьКнопокPDFДокИсходящие()

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокPDFНаСервере(ВидДокумента, СсылкаНаДок = Неопределено, НомерСтроки = Неопределено)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокPDF(ВидДокумента, ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания, СсылкаНаДок, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура СписокЭкспортаPDFПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элементы.СписокЭкспортаPDF.ТекущийЭлемент = Элементы.СписокЭкспортаPDF.ПодчиненныеЭлементы.СписокЭкспортаPDFомерСтрокиИКартинка.ПодчиненныеЭлементы.СписокЭкспортаPDFНомерСтроки;
		
		ТД = Элементы.СписокЭкспортаPDF.ТекущиеДанные;
		
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			ОткрытьФормуВыбораДокумента(ТД, "ВыборДокДляPDF");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокPDFДокументыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элементы.СписокPDFДокументы.ТекущийЭлемент = Элементы.СписокPDFДокументы.ПодчиненныеЭлементы.СписокPDFДокументыНомерСтрокиИКартинка.ПодчиненныеЭлементы.СписокPDFДокументыНомерСтроки;
		
		ТД = Элементы.СписокPDFДокументы.ТекущиеДанные;
		
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			ОткрытьФормуВыбораДокумента(ТД, "ВыборДокДляPDF");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДокДляPDF(СтуркутраВыбора, Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.СписокЭкспортаPDF.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		ТД = Элементы.СписокPDFДокументы.ТекущиеДанные;	
	КонецЕсли;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;
	
	ТД.СсылкаНаДокумент = СтуркутраВыбора;
	
	Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокPDFНаСервере(ВидДокументаPDF, ТД.СсылкаНаДокумент, ТД.НомерСтроки - 1);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненоПолеВидаДокументаPDF()
	
	Если НЕ ЗначениеЗаполнено(ВидДокументаPDF) Тогда
		
		СообщениеПользователю(НСтр("ru = 'Не выбран вид документа';uk='Не вказано вид документу'"), Ложь);
		Возврат Ложь;
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СписокЭкспортаPDFВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.СписокЭкспортаPDF.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		ТД = Элементы.СписокPDFДокументы.ТекущиеДанные;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
		ОткрытьФормуВыбораДокумента(ТД, "ВыборДокДляPDF");
		Возврат;
	КонецЕсли;
		
	Если Поле.Имя = "СписокЭкспортаPDFНомерСтроки" Тогда
		Если ЗначениеЗаполнено(ТД.ТекстОшибки) Тогда
			СообщениеПользователю(ТД.ТекстОшибки, Ложь)
		КонецЕсли;	
	ИначеЕсли Поле.Имя <> "СписокЭкспортаPDFФлажок" И Поле.Имя <> "СписокЭкспортаPDFЭмайлКонтрагента" И Поле.Имя <> "СписокPDFДокументыТекущийДокИзДублей" Тогда
		ОткрытьДокумент(ТД, Элемент.Имя);
	ИначеЕсли Поле.Имя = "СписокPDFДокументыТекущийДокИзДублей" Тогда
		//приннудительно вызываем это событие, т.к. непосредственно не вызывается
		СписокPDFДокументыТекущийДокИзДублейНачалоВыбораИзСписка(Элемент, Неопределено)
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЭкспортаPDFПриАктивизацииСтроки(Элемент)
		
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) И НЕ ЗначениеЗаполнено(ТД.ИмяДокумента) Тогда
		ТД.ИмяДокумента = ВидДокументаPDF;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭкспортаPDFПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если НЕ ЗаполненоПолеВидаДокументаPDF() Тогда
		Отказ = Истина;
	КонецЕсли;

	ВидимостьКнопокPDFДокИсходящие(Истина)

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВPDF(Команда)

	Объект.ДействиеАналитики = "Папка24Сохранение";

	// PaperLess pdf
	Объект.ОтправлятьPDF = Ложь;
	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузкиPaperLess, "PDF");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВPDFДок(Команда)

	Объект.ДействиеАналитики = "PDFДокВыгрузкаВФайл";

	// финдок pdf
	Объект.ОтправлятьPDF = Ложь;
	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузки, "PDF");	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьPDFВЦикле()
	
	ВыпВЦикле = ВыгрузитьPDFНаСервере(Ложь);
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("СохранитьPDFВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВидовОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Найти("BP,BASC,UNF,KUBU,BSB,UABY", Объект.ИдКонф) > 0 Тогда
		Элементы.СписокВидовОтчета.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.РегламентированныеОтчеты");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОтчетовНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокОтчетов(РеглОтч, ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокОтчетов(Команда)

	ДействиеАналитики = "ЗаполнениеСпискаРеглОтчетов";

	Если Объект.ИдКонф = "" Тогда
		ТекстСообщения = НСтр("ru = 'Заполнение и отправка отчетов не поддерживаются в вашей конфигурации.';uk='Заповнення та відправка звітів не підтримуються у вашій конфігурації.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	ЗаполнитьСписокОтчетовНаСервере();

	ВидимостьКнопокОтчетыИсходящие()

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопокОтчетыИсходящие()//ДобавитьБезусловно = Ложь)

	ЕстьСписокДок = Объект.РеглОтчеты.Количество() > 0;// Или ДобавитьБезусловно;
	Элементы.РеглОтчетыОтправитьОтчеты.Доступность = ЕстьСписокДок

КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПослеУдаления(Элемент)

	ВидимостьКнопокPDFДокИсходящие()

КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетыНаСервере(МассивВыгрузки)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьОтчеты(МассивВыгрузки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");	

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчеты(Команда)

	Объект.ДействиеАналитики = "РОВыгрузка";

	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		СообщениеПользователю(НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами. Операция займет несколько секунд...';uk='Для цієї операції необхідно встановити розширення роботи з файлами. Операція займе кілька секунд...'"), Ложь);
		НачатьУстановкуРасширенияРаботыСФайлами();
		Возврат;
	КонецЕсли;
	
	МассивВыгрузки = Новый Массив;
	ЕстьОтчетыДляОтправки = Ложь;
	
	Для Каждого СтрокаТЧ Из Объект.РеглОтчеты Цикл
		
		Если НЕ СтрокаТЧ.Флажок Тогда
			Продолжить;	
		КонецЕсли;
		ЕстьОтчетыДляОтправки = Истина;
		
		ПолучитьXMLФайлВыгрузкиРеглОтчета(МассивВыгрузки, СтрокаТЧ.СсылкаНаОтчет, СтрокаТЧ);
	КонецЦикла;	

	Если Не ЕстьОтчетыДляОтправки Тогда
		СообщениеПользователю(НСтр("ru = 'Не выбраны отчеты для отправки.';uk='Немає обраних звітів для відправки.'"), Ложь);
	КонецЕсли;

	ОтправитьОтчетыНаСервере(МассивВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстыВыгрузкиОтчета(СпДокОсн)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьТекстыВыгрузкиОтчета(СпДокОсн);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецФункции

&НаКлиенте
Процедура ПолучитьXMLФайлВыгрузкиРеглОтчета(МассивВыгрузки, СсылкаНаОтчет, СтрокаТЧ)
	
	Попытка
		
		ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента");
		СпДокОсн = Новый СписокЗначений;
		СпДокОсн.Добавить(СсылкаНаОтчет);

		ПолучитьТекстыВыгрузкиОтчета(СпДокОсн);

		ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн, Объект.КаталогВыгрузки);
		//ФормаВыгрузкиРеглОтчета.СохранитьТексты();
		
		ТЧВыгрузки = ФормаВыгрузкиРеглОтчета.Объект.Выгрузки;
		
		Для Каждого СтрокаТЧВыгрузки Из ТЧВыгрузки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТЧВыгрузки.Текст) Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураВыгрузки = Новый Структура;
			СтруктураВыгрузки.Вставить("ИмяФайла", СтрокаТЧВыгрузки.ИмяФайла);
			СтруктураВыгрузки.Вставить("Текст", СтрокаТЧВыгрузки.Текст);
			СтруктураВыгрузки.Вставить("СсылкаНаОтчет", СсылкаНаОтчет);
			МассивВыгрузки.Добавить(СтруктураВыгрузки);
			
		КонецЦикла;	
		
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при получении файла выгрузки регламентированного отчета '; uk='Помилка при отриманні файла вивантаження регламентованого звіту '") + ОписаниеОшибки())
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура РеглОтчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле.Имя <> "РеглОтчетыФлажок" Тогда
		
		ТД = Элементы.РеглОтчеты.ТекущиеДанные;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("СсылкаНаДокумент", ТД.СсылкаНаОтчет);
		ДанныеСтроки.Вставить("ИмяДокумента", "РегламентированныйОтчет");
		ОткрытьДокумент(ДанныеСтроки, Элемент.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьДокументов(ФлагПодписатьДокументы = Истина)

	Объект.ФлагПодписатьДокументы = ФлагПодписатьДокументы;
	Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ОблПодпись;
	
	ТекстВыборВидаКлючейНажатие(Неопределено);
	
	Если НЕ Объект.РаботаВМоделиСервисаПБ Тогда//ИЛИ ИСТИНА Тогда
		
		Элементы.ПодписьЛокально.Видимость = Истина;//Ложь
		ВидимостьДействийПодписи(Истина);
		
	//Иначе
	//	АдресБазы = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	//	АдресБазы = СтрЗаменить(АдресБазы, "https://", "");
	//	АдресБазы = Лев(АдресБазы, Найти(АдресБазы, "/") - 1);
	//	СайтПодписьPDF = "https://" + АдресБазы + "/sign2/index.html?" + ТекущаяДата();
	//	Элементы.ПодписьЧерезСайт.Видимость = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура СайтПодписьPDFДокументСформирован(Элемент)
	
	//Если ЗначениеЗаполнено(Объект.XML) И Найти(Объект.XML, "]") > 0 Тогда
	//	Элементы.СайтПодписьPDF.document.defaultView.objFrom1C(Объект.XML);
	//	Объект.XML = "";
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СайтПодписьPDFПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Попытка
		
		ОбъектСПодписями = ДанныеСобытия.Document.body.signObject;
		
		Если (СтрЧислоВхождений(ОбъектСПодписями,"[{""")>0) Тогда
			Элементы.ПодписьЧерезСайт.Видимость = Ложь;
			ТекущийЭлемент = Элементы[мИмяТекЭлемента];
			
			Если мИмяТекЭлемента = "ТекстВыгрузкаPDF" Тогда
				СайтПодписьPDFПриНажатииНаСервере(ОбъектСПодписями);
			ИначеЕсли мИмяТекЭлемента = "ТекстПодписьПлатежей" Тогда
				ОтправитьПодписиПлатежейНаСервере(ОбъектСПодписями);
				ПрочитатьПодготовленныеПлатежи(Неопределено);
			КонецЕсли;	
			
			Если мИмяТекЭлемента = "ТекстАкты" ИЛИ мИмяТекЭлемента = "ТекстЗаказы" ИЛИ мИмяТекЭлемента = "ТекстСчетаНаОплату" ИЛИ мИмяТекЭлемента = "ТекстРасходные" ИЛИ мИмяТекЭлемента = "ТекстСписокНалоговыхДокументов" ИЛИ мИмяТекЭлемента = "ТекстPDFДокументы" Тогда
				ОтправитьПодписанныеФинДокиНаСервер(ОбъектСПодписями);
				
				Если мИмяТекЭлемента = "ТекстСписокНалоговыхДокументов" ИЛИ мИмяТекЭлемента = "ТекстPDFДокументы" Тогда
					ПереключитьРабочуюОбласть(Элементы[мИмяТекЭлемента]);	
				Иначе
					ПереключитьРабочуюОбласть(Элементы.ОблФинДок);
				КонецЕсли;
				
			Иначе
				ПереключитьРабочуюОбласть(Элементы[мИмяТекЭлемента]);	
			КонецЕсли;	
		
		КонецЕсли; 
		
		Если (СтрЧислоВхождений(ОбъектСПодписями,"{{CLOSE}}")>0) Тогда 
			Элементы.ПодписьЧерезСайт.Видимость = Ложь;
			ТекущийЭлемент = Элементы[мИмяТекЭлемента];
			Если мИмяТекЭлемента = "ТекстАкты" ИЛИ мИмяТекЭлемента = "ТекстЗаказы" ИЛИ мИмяТекЭлемента = "ТекстСчетаНаОплату" ИЛИ мИмяТекЭлемента = "ТекстРасходные" Тогда
				ПереключитьРабочуюОбласть(Элементы.ОблФинДок);	
			Иначе	
				ПереключитьРабочуюОбласть(Элементы[мИмяТекЭлемента]);
			КонецЕсли;	
		КонецЕсли; 
		
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при подписи PDF-документа на сайте '; uk='Помилка при підпису PDF-документа на сайті '") + ОписаниеОшибки())
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СайтПодписьPDFПриНажатииНаСервере(ОбъектСПодписями)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьПодписанныеPDF(ОбъектСПодписями);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");		
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПодписиПлатежейНаСервере(ОбъектСПодписями)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьПодписиПлатежейНаСервер(ОбъектСПодписями);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");		
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПодписанныеФинДокиНаСервер(ОбъектСПодписями)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьПодписанныеФинДокиНаСервер(ОбъектСПодписями);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");		
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПечати(Команда)

	Попытка//Если Объект.ОбработкаВнешняя Тогда
		ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаПараметровПечати",,,,,,Новый ОписаниеОповещения("ВыборНастроекЗакрытие", ЭтаФорма));
	Исключение
		ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ФормаПараметровПечати",,,,,,Новый ОписаниеОповещения("ВыборНастроекЗакрытие", ЭтаФорма));
	КонецПопытки
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНастроекЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.QRВерх = Результат.QRВерх;
		Объект.QRЛево = Результат.QRЛево;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПечатьСQRНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ВидимостьКомандПапка24(Ложь);
	ПереключитьРабочуюОбласть(Элементы.ТекстВыгрузкаPDF, Истина);	

КонецПроцедуры

&НаКлиенте
Процедура БанкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP" Или Объект.ИдКонф = "BASR" Или Объект.ИдКонф = "AAA" Тогда
		Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков");		
	Иначе
		//	BSB, BASC, UABY, ...
		Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Банки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстРасчетныеЛисткиНажатие(Элемент)

	Если Объект.ИдКонф = "BASR" Тогда
		СообщениеПользователю(НСтр("ru = 'Ваша конфигурация не поддерживает расчет заработной платы.';uk='Ваша конфігурація не підтримує розрахунок заробітної платні.'"), Ложь);
		Возврат
	КонецЕсли;

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент);

	Если НЕ ЗначениеЗаполнено(Объект.ТекущийЗПРЛ) Тогда
		ПолучениеЗарплатногоПроектаРЛ(Неопределено);
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиРасченыеЛистки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.РасчетныеЛистки Цикл
		СтрокаТЧ.Флажок = Ложь;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеРасчетныеЛистки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.РасчетныеЛистки Цикл
		СтрокаТЧ.Флажок = Истина;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьРасчетныеЛисктиНаСервере(ТолькоСохранитьВDBF = Ложь)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьРасчетныеЛискти(ТолькоСохранитьВDBF, УникальныйИдентификатор);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРасчетныеЛискти(Команда)

	Если Не ЗначениеЗаполнено(Объект.ТекущийЗПРЛ) Тогда
		Если Не Объект.UnitТест Тогда
			ТекстСообщенияОшибка = НСтр("ru='Не выбран текущий зарплатный проект.';uk='Не обраний поточний зарплатний проект.'");
			СообщениеПользователю(ТекстСообщенияОшибка, Ложь)
		КонецЕсли;
		Возврат
	КонецЕсли;

	Если Объект.РасчетныеЛистки.Количество() = 0 Тогда
		Если Не Объект.UnitТест Тогда
			ТекстСообщенияОшибка = НСтр("ru='Список расчетных листов пуст. Заполните список.';uk='Список розрахункових листів порожній. Заповніть список.'");
			СообщениеПользователю(ТекстСообщенияОшибка, Ложь)
		КонецЕсли;
		Возврат
	КонецЕсли;

	ОтправитьРасчетныеЛисктиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыРасчетныхЛистков(Команда)

	Объект.ДействиеАналитики = "РасчетныйЛистВыгрузкаВФайл";
	вДействиеАналитики = Объект.ДействиеАналитики;
	ОтправитьРасчетныеЛисктиНаСервере(Истина);
	Объект.ДействиеАналитики = вДействиеАналитики;
	Если Не Объект.UnitТест Тогда
		СохранитьФайлВыгрузкиНаКлиенте(Объект.КаталогВыгрузкиЗП)
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРасчетныхЛистковНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокРасчетныхЛистков(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокРасчетныхЛистков(Команда)
	
	ЗаполнитьСписокРасчетныхЛистковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеЛисткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.РасчетныеЛистки.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьДокумент(ТД);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСтатистку(Категория, Действие,  ТекстОшибки, СразуОтправлять = Ложь) //Параметр СразуОтправлять - говорит о том что нужно сразу отправить статистику
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОбновитьСтатистикуРаботы(Категория, Действие, Истина); //Параметр Истина - говорит о том что сразу отправлять
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ВыполнитьДлительнуюОперацию(СтруктураКоманды)

	Перем ТипИБ;

	ИдентификаторКоманды = СтруктураКоманды.Имя; 
    ПараметрыКоманды = Новый Структура;
    ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ОбъектСсылка);
    ПараметрыКоманды.Вставить("СопровождающийТекст", СтруктураКоманды.Представление);

	Попытка
		Выполнить("ТипИБ = СтандартныеПодсистемыВызовСервера.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая");
	    Если ТипИБ Тогда
    	    РезультатВыполнения = ВыполнитьКомандуНапрямую(ИдентификаторКоманды, ПараметрыКоманды);
        	// Добавить код приемки результата
	        ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
    	Иначе
        	ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьКомандуВФоне(ИдентификаторКоманды, ПараметрыКоманды, ЭтаФорма);
		КонецЕсли;
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при выполнении длительной операции '; uk='Помилка при виконанні довготривалої операції '") + ОписаниеОшибки())
	КонецПопытки
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКурлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьКаталог(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СоглашенияСКлиентами"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СоглашенияСПоставщиками"));
	
	Элементы.Соглашение.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьНадписьНазадНажатие(Элемент)
	
	Элементы.ПодписьЧерезСайт.Видимость = Ложь;
	Элементы.ПодписьЛокально.Видимость = Ложь;
	ТекущийЭлемент = Элементы[мИмяТекЭлемента];
	
	Если мИмяТекЭлемента = "ТекстАкты" ИЛИ мИмяТекЭлемента = "ТекстЗаказы" ИЛИ мИмяТекЭлемента = "ТекстСчетаНаОплату" ИЛИ мИмяТекЭлемента = "ТекстРасходные" Тогда
		ПереключитьРабочуюОбласть(Элементы.ОблФинДок);	
	Иначе	
		ПереключитьРабочуюОбласть(Элементы[мИмяТекЭлемента]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьPDFПриИзменении(Элемент)

	Элементы.СписокЭкспортаPDFЭмайлКонтрагента.Видимость = НЕ Элементы.СписокЭкспортаPDFЭмайлКонтрагента.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ПодписыватьPDFПриИзменении(Элемент)
	
	Элементы.ОтправлятьPDF.Доступность = Объект.ПодписыватьPDF;
	Элементы.ИспользоватьSmartIdВPaperLess.Доступность = Объект.ПодписыватьPDF;
	
	Если НЕ Объект.ПодписыватьPDF Тогда
		Объект.ОтправлятьPDF = Ложь;
		Элементы.СписокЭкспортаPDFЭмайлКонтрагента.Видимость = Ложь;
	КонецЕсли;

	УстановитьДоступностьСписокЭкспортаPDFНастройкаПодписи()

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьSmartIdВPaperLessПриИзменении(Элемент)

	УстановитьДоступностьСписокЭкспортаPDFНастройкаПодписи()

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСписокЭкспортаPDFНастройкаПодписи()

	Элементы.СписокЭкспортаPDFНастройкаПодписи.Доступность = Объект.ПодписыватьPDF И Не Объект.ИспользоватьSmartIdВPaperLess;
	Элементы.СписокЭкспортаPDFНастройкаПодписиВНастройках.Доступность = Объект.ПодписыватьPDF И Не Объект.ИспользоватьSmartIdВPaperLess

КонецПроцедуры

&НаКлиенте
Процедура ТекстВыборВидаКлючейНажатие(Элемент)
	
	Если Элемент <> Неопределено Тогда
		Объект.КлючиОтНалоговой = НЕ Объект.КлючиОтНалоговой;
		Объект.ТаблицаКлючей.Очистить();
	КонецЕсли;
	
	Если Объект.КлючиОтНалоговой Тогда
		
		Элементы.ТекстЗаголовокВыбораКлючей.Заголовок = НСтр("ru = 'Укажите путь к ключу ЭЦП выданный АЦСК ФСУ (имя файла ключа: Key-6.dat):';uk='Вкажіть шлях до ключа ЕЦП виданий АЦСК ФСУ (ім`я файлу ключа: Key-6.dat):'");
		
		Элементы.ТекстВыборВидаКлючей.Заголовок = НСтр("ru = 'Использовать ключи АЦСК ПриватБанка';uk='Використовувати ключі АЦСК ПриватБанку'");
		
	Иначе
		
		Элементы.ТекстЗаголовокВыбораКлючей.Заголовок = НСтр("ru = 'Укажите путь к ключу ЭЦП выданный АЦСК ПриватБанка (файл ключа имеет расширение *.jks):';uk='Вкажіть шлях до ключа ЕЦП виданий АЦСК ПриватБанку (файл ключа має розширення *.jks):'");
		
		Элементы.ТекстВыборВидаКлючей.Заголовок = НСтр("ru = 'Использовать ключи АЦСК ИДД Миндоходов';uk='Використовувати ключі АЦСК ІДД Міндоходов'"); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКлючейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Элементы.ТаблицаКлючей.ТекущиеДанные.Пометка = Истина;

КонецПроцедуры

&НаСервере
Функция ПодписьДалееСервер()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Успешно = ОбработкаОбьект.ПолучитьАлиасы();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	Возврат Успешно;
	
КонецФункции
	
&НаКлиенте
Процедура ПодписьДалее(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТаблицаКлючей Цикл
		Если СтрокаТЧ.Пометка Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.АдресКлюча) Тогда	
				
				СообщениеПользователю(НСтр("ru = 'Не выбран ключ';uk='Не вибрано ключ'"), Ложь);
				Возврат;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Пароль) Тогда	
				
				СообщениеПользователю(НСтр("ru = 'Не задан пароль для ключа';uk='Не заданий пароль для ключа'"), Ложь);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;		
	КонецЦикла;
	
	Успешно = ПодписьДалееСервер();
	
	Если Успешно Тогда
		ВидимостьДействийПодписи(Ложь);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДействийПодписи(Видимость)
	
	Элементы.ТекстВыборВидаКлючей.Видимость = Видимость;
	Элементы.ТекстЗаголовокВыбораКлючей.Видимость = Видимость;
	Элементы.ТаблицаКлючей.Видимость = Видимость;
	Элементы.ПодписьДалее.Видимость = Видимость;
	Элементы.ОдинаковыйПарольДляВсехКлючей.Видимость = Видимость;	
	
	Элементы.ТаблицаПодписей.Видимость = НЕ Видимость;
	Элементы.ГруппаКнопокПодписи.Видимость = НЕ Видимость;

	Если Не Объект.ФлагПодписатьДокументы Тогда
		Элементы.ПодписатьДокументы.Видимость = Не Видимость;//Ложь;//10.08.2023
		Элементы.ТекстВернутьсяИзПодписи.Видимость = Истина
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ПодписатьДокументыСервер(ИмяРаздела)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПодписатьДокументы(ИмяРаздела);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДокументы(Команда)
	
	ЕстьОтмеченные = Ложь;
	
	Для Каждого СтрокаТЧПодписей Из Объект.ТаблицаПодписей Цикл	
		Если НЕ СтрокаТЧПодписей.Пометка Тогда
			Продолжить;
		КонецЕсли;
		ЕстьОтмеченные = Истина;
	КонецЦикла;
	
	Если НЕ ЕстьОтмеченные Тогда
		ТекстСообщения = НСтр("ru='Не выбраны ключи';uk='Не вибрані ключі'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат;	
	КонецЕсли;
	
	ПодписатьДокументыСервер(мИмяТекЭлемента);	
	
	Если мИмяТекЭлемента = "ТекстПодписьПлатежей" Тогда
		ПрочитатьПодготовленныеПлатежи(Неопределено);
	КонецЕсли;	
				
	ПодписьНадписьНазадНажатие(Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьНазад(Команда)
	
	ВидимостьДействийПодписи(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиКлючей(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТаблицаПодписей Цикл
		
		СтрокаТЧ.Пометка = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиКлючей(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ТаблицаПодписей Цикл
		
		СтрокаТЧ.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКлючейАдресКлючаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяТЧ", "ТаблицаКлючей");
	СтруктураПараметров.Вставить("Имя", "АдресКлюча");
	СтруктураПараметров.Вставить("ТекстРедактирования", Элемент.ТекстРедактирования);
	СтруктураПараметров.Вставить("РасширениеФайла", ?(Объект.КлючиОтНалоговой, "dat", "jks"));
	ВыбратьФайл(СтруктураПараметров, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКлючейПарольПриИзменении(Элемент)
	
	Если Объект.ОдинаковыйПарольДляВсехКлючей Тогда
			
		ПарольОбщий = Элемент.ТекстРедактирования;
		
		Для Каждого СтрокаТЧ Из Объект.ТаблицаКлючей Цикл
			СтрокаТЧ.Пароль = ПарольОбщий;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)

	Элементы.ОткатДоПредыдущейВерсии.Видимость = Объект.РежимОтладки;
	Элементы.ЗаписьЛогаВФайл.Видимость = Объект.РежимОтладки;// И НЕ Объект.ЭтоВебКлиент; //И НЕ Объект.РаботаВМоделиСервисаПБ;
	УстановитьВидимостьФлажокИспользоватьКурлВсегда();//Ложь);
	Элементы.ФлажокЗаменитьОтветСервера.Видимость = Объект.РежимОтладки;
	УстановитьВидимостьЗаменитьОтветСервера();
	УстановитьВидимостьДоступностьПутьКурл();
	ВидимостьФлажокНеВыводитьГорячиеСообщения();

	ГруппаДопПараметыАвторизацииИнтернетАдресДляСоединенияУСтановкаВидимости();
	ДобавитьАдресаСерверов()//Объект.РежимОтладки);//на случай динамической зависимости от РежимОтладки

	//Если Не Объект.ПроверенСертификатCURL И Не Объект.ЭтоВебКлиент И (НЕ Объект.ПоддерживаетсяTLS12 Или Объект.ФлажокИспользоватьКурлВсегда) Тогда//на всяк.случ.
	//	ПроверкаСертификатаCURLНаСервере()
	//КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьФлажокНеВыводитьГорячиеСообщения()

	Элементы.ФлажокНеВыводитьГорячиеСообщения.Видимость = Объект.РежимОтладки

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЭто1cnik()

	АдресБазы = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	Объект.Это1cnik = Найти(АдресБазы, "1cnik.net") > 0;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаДопПараметыАвторизацииИнтернетАдресДляСоединенияУстановкаВидимости()

	ВидимостьРежимОтладкиИДоСервера = Объект.РежимОтладки И Элементы.ИнтернетАдресДляСоединения.СписокВыбора.Количество() > 1;
	ВидимостьРежимОтладкиИ1cnik = Объект.РежимОтладки И Объект.Это1cnik;
	Если Объект.Это1cnik Тогда
		Элементы.ИнтернетАдресДляСоединения.Видимость = ВидимостьРежимОтладкиИ1cnik;
		Элементы.КнопкаUnitТест.Видимость = ВидимостьРежимОтладкиИ1cnik
	Иначе
		Элементы.ИнтернетАдресДляСоединения.Видимость = ВидимостьРежимОтладкиИДоСервера;
		Элементы.КнопкаUnitТест.Видимость = ВидимостьРежимОтладкиИДоСервера
	КонецЕсли;
	Элементы.ГруппаДопПараметыАвторизации.Видимость = ВидимостьРежимОтладкиИДоСервера Или ВидимостьРежимОтладкиИ1cnik

КонецПроцедуры

&НаСервере
Процедура ПроверкаСертификатаCURLНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Попытка
		ОбработкаОбьект.ПроверкаСертификатаCURL();
	Исключение
		СообщениеПользователю(НСтр("ru = 'Ошибка при проверке сертификата CURL '; uk='Помилка при перевірці сертифіката CURL '") + ОписаниеОшибки(), Ложь)
	КонецПопытки;
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")

КонецПроцедуры

&НаКлиенте
Процедура ФлажокЗаменитьОтветСервераПриИзменении(Элемент)

	УстановитьВидимостьЗаменитьОтветСервера()

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЗаменитьОтветСервера()

	Элементы.ПолеВводаТест1.Видимость = Объект.РежимОтладки И Объект.ФлажокЗаменитьОтветСервера;
	Элементы.ПолеВводаТест2.Видимость = Объект.РежимОтладки И Объект.ФлажокЗаменитьОтветСервера

КонецПроцедуры

&НаКлиенте
#Если ВебКлиент Тогда
Процедура УстановитьВидимостьФлажокИспользоватьКурлВсегда()

	ФлажокИспользоватьКурлВсегда = Ложь;
	Элементы.ФлажокИспользоватьКурлВсегда.Видимость = Ложь;
	Элементы.БезПроверкиСертификатаСайта.Видимость = Ложь;
	Элементы.ПутьКурл.Видимость = Ложь

КонецПроцедуры
#Иначе
Процедура УстановитьВидимостьФлажокИспользоватьКурлВсегда()

	Если Объект.РаботаВМоделиСервисаПБ = Истина Или Объект.ЭтоВебКлиент Тогда
		Элементы.БезПроверкиСертификатаСайта.Видимость = Ложь; 
		Элементы.ФлажокИспользоватьКурлВсегда.Видимость = Ложь;
		Элементы.ПутьКурл.Видимость = Ложь
	Иначе
		Элементы.БезПроверкиСертификатаСайта.Видимость = Объект.РежимОтладки
			И (НЕ Объект.ПоддерживаетсяTLS12 Или Объект.ФлажокИспользоватьКурлВсегда);
		Элементы.ФлажокИспользоватьКурлВсегда.Видимость = Объект.РежимОтладки;
		Элементы.ПутьКурл.Видимость = Истина//Объект.РежимОтладки И (НЕ Объект.ПоддерживаетсяTLS12 Или Объект.ФлажокИспользоватьКурлВсегда)
	КонецЕсли;

	Если Не Объект.РаботаВМоделиСервисаПБ = Истина И Не Объект.ПроверенСертификатCURL И Не Объект.ЭтоВебКлиент И Объект.ЭтоWindows
			И (НЕ Объект.ПоддерживаетсяTLS12 Или Объект.ФлажокИспользоватьКурлВсегда) Тогда
		ПроверкаСертификатаCURLНаСервере()
	КонецЕсли

КонецПроцедуры
#КонецЕсли

&НаКлиенте
Процедура ФлажокИспользоватьКурлВсегдаПриИзменении(Элемент)

	УстановитьВидимостьФлажокИспользоватьКурлВсегда()

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиЗаполненияДокументовНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдКонф", Объект.ИдКонф);
	ПараметрыФормы.Вставить("ТаблицаПравил", Объект.ТаблицаПравил);
	
	Попытка//Если Объект.ОбработкаВнешняя Тогда
		ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.НастройкаАвтозаполнения", ПараметрыФормы, ЭтаФорма);
	Исключение
		ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.НастройкаАвтозаполнения", ПараметрыФормы, ЭтаФорма);
	КонецПопытки
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПоискаДокументовНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоляДляПоискаПлатежей", Объект.ПоляДляПоискаПлатежей);
	
	Попытка//Если Объект.ОбработкаВнешняя Тогда
		ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.НастройкаПолейПоискаПлатежей", ПараметрыФормы, ЭтаФорма);
	Исключение
		ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.НастройкаПолейПоискаПлатежей", ПараметрыФормы, ЭтаФорма);
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуПравил(Таблица)

	Объект.ТаблицаПравил.Загрузить(Таблица.Выгрузить());

КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьНадписьФормыНастройкиАвтозаполнения()
	
	Элементы.ОткрытьФормуНастройкиЗаполненияДокументов.Заголовок = НСтр("ru = 'Открыть форму настройки автозаполнения реквизитов документов (кол-во действующих правил: ';uk='Відкрити форму налаштування автозаповнення реквізитів документів (кіл-ть діючих правил: '") + Объект.ТаблицаПравил.Количество() + ")";
	
КонецПроцедуры

//---------Обновление-------------------------------------------

&НаКлиенте
Процедура ОткрытьФормуОбновления()

	Если Объект.ОбработкаВнешняя Тогда
		Объект.ЭтоОбновление = Истина;
		Если ПроверитьВерсиюВbadversions(Объект.АктуальнаяВерсия) Тогда
			Объект.ЭтоОбновление = Ложь;
			Возврат
		КонецЕсли;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПутьКурл", Объект.ПутьКурл);
		ПараметрыФормы.Вставить("ПоддерживаетсяTLS12", Объект.ПоддерживаетсяTLS12);
		ПараметрыФормы.Вставить("ИнтернетАдресДляСоединения", Объект.ИнтернетАдресДляСоединения);
		ПараметрыФормы.Вставить("ЭтоВебКлиент", Объект.ЭтоВебКлиент);
		ПараметрыФормы.Вставить("ЭтоWindows", Объект.ЭтоWindows);
		ПараметрыФормы.Вставить("БазовоеИмяФайла", Объект.БазовоеИмяФайла);
		ПараметрыФормы.Вставить("РасширениеФайла", Объект.РасширениеФайла);
		ПараметрыФормы.Вставить("ТекВерсия", Объект.ТекВерсия);
		ПараметрыФормы.Вставить("АктуальнаяВерсияОбработки", Объект.АктуальнаяВерсия);
		ПараметрыФормы.Вставить("Путьmop24versions", Объект.Путьmop24versions);
		ФормаОбновления = ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаОбновления", ПараметрыФормы);
		Отказ = Истина;
		Закрыть();
	Иначе
		ТекстСообщения = НСтр("ru='Доступна новая версия модуля обмена. Автоматическое обновление невозможно. Скачайте новую версию по адресу https://client-bank.privatbank.ua/client_bank_jur/Privat24Managedupdate.exe и обновите ее в своей информационной базе.
		|Для автоматического обновления открывайте обработку через меню Файл-Открыть';
		|uk='Доступна нова версія модуля обміну. Автоматичне оновлення неможливо. Скачайте нову версію за адресою https://client-bank.privatbank.ua/client_bank_jur/Privat24Managedupdate.exe і обновіть її в своїй інформаційній базі.
		|Для автоматичного оновлення відкривайте обробку через меню Файл-Відкрити'");
		Отказ = Истина;
		Закрыть();
	КонецЕсли;
	Возврат
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеОбработчикомОжидания(ПервыйЗапускФункцииАвтоОбновленияВФорме = Ложь)

	Попытка
		//Если ФлажокПроверятьОбновленияАвтоматически Тогда//на случай введения флага
			Если ПервыйЗапускФункцииАвтоОбновленияВФорме Тогда
				//не используется
				ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 60);
				ПервыйЗапускФункцииАвтоОбновленияВФорме = Ложь
			Иначе
				ОтключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления");
				ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400)
			КонецЕсли
		//Иначе
		//	ОтключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления")
		//КонецЕсли
	Исключение
	КонецПопытки

КонецПроцедуры	//	УправлениеОбработчикомОжидания(ПервыйЗапускФункцииАвтоОбновленияВФорме = Ложь)

&НаКлиенте
Процедура ПриОжиданииПроверкиОбновления()

	Если Не ОбновлениеЗапущено = Истина Тогда
		ОтключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления");
		ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400);
		стТребуетсяОбновление = ПроверитьОбновленияНаСервере();//проверяем актуальную версию
		Объект.АктуальнаяВерсия = стТребуетсяОбновление.АктуальнаяВерсия;
		Если УдалитьСимволl(Объект.ТекВерсия) <> Объект.АктуальнаяВерсия Тогда
			ОбновлениеЗапущено = Истина;
			ОткрытьФормуОбновления();
			ОбновлениеЗапущено = Ложь
		КонецЕсли
	КонецЕсли

КонецПроцедуры	//	ПриОжиданииПроверкиОбновления()

//удаление символа "l"
&НаКлиенте
Функция УдалитьСимволl(ПутьИИмяОбработки)

	ПозицияСимволаl = Найти(ПутьИИмяОбработки, "l");
	Если ПозицияСимволаl > 0 Тогда
		ПутьИИмяОбработки = СтрЗаменить(ПутьИИмяОбработки, "l", "")
	КонецЕсли;
	Возврат ПутьИИмяОбработки

КонецФункции

&НаСервере
Функция ПроверитьОбновленияНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	Возврат ОбработкаОбьект.ПроверкаОбновления(Ложь); //проверяем самую последнюю версию
	
КонецФункции

&НаКлиенте
Функция ПроверитьВерсиюВbadversions(ВерсияДляПроверки)

	//проверка версии обновления в файле badversions.txt
	Файлbadversions = Новый Файл(Объект.Путьmop24versions + "badversions.txt");
	Если Файлbadversions.Существует() Тогда
		ТекстДокументbadversions = Новый ТекстовыйДокумент;
		ТекстДокументbadversions.Прочитать(Файлbadversions.ПолноеИмя);
		ТекстДокументbadversionsПолученныйТекст = ТекстДокументbadversions.ПолучитьТекст();
		Если Найти(ТекстДокументbadversionsПолученныйТекст, ВерсияДляПроверки) <> 0 Тогда
			Возврат Истина
		КонецЕсли
	КонецЕсли;
	Возврат Ложь

КонецФункции

&НаКлиенте
Процедура ПроверитьОбновления(Команда)

	ОтключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления");

	стРезультатПроверкиОбновления = ПроверитьОбновленияНаСервере();
	РезультатПроверкиОбновления = стРезультатПроверкиОбновления.ТребуетсяОбновление;
	Объект.АктуальнаяВерсия = стРезультатПроверкиОбновления.АктуальнаяВерсия;
	
	Если РезультатПроверкиОбновления Тогда//возвращается ТребуетсяОбновление
		Если Объект.ОбработкаВнешняя Тогда
			Если ПроверитьВерсиюВbadversions(АктуальнаяВерсия) Тогда
				ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400);
				Возврат
			КонецЕсли;
			Объект.ЭтоОбновление = Истина;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ПутьКурл", Объект.ПутьКурл);
			ПараметрыФормы.Вставить("ПоддерживаетсяTLS12", Объект.ПоддерживаетсяTLS12 И Не Объект.ФлажокИспользоватьКурлВсегда);
			ПараметрыФормы.Вставить("ИнтернетАдресДляСоединения", Объект.ИнтернетАдресДляСоединения);
			ПараметрыФормы.Вставить("ЭтоВебКлиент", Объект.ЭтоВебКлиент);
			ПараметрыФормы.Вставить("ЭтоWindows", Объект.ЭтоWindows);
			ПараметрыФормы.Вставить("БазовоеИмяФайла", Объект.БазовоеИмяФайла);
			ПараметрыФормы.Вставить("РасширениеФайла", Объект.РасширениеФайла);
			ПараметрыФормы.Вставить("ТекВерсия", Объект.ТекВерсия);
			ПараметрыФормы.Вставить("АктуальнаяВерсияОбработки", Объект.АктуальнаяВерсия);
			ПараметрыФормы.Вставить("Путьmop24versions", Объект.Путьmop24versions);
			ФормаОбновления = ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаОбновления", ПараметрыФормы);
			Отказ = Истина;
			ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400);
			Закрыть();
		Иначе
			ТекстСообщения = НСтр("ru='Доступна новая версия модуля обмена. Автоматическое обновление невозможно. Скачайте новую версию по адресу %АдресМодуляДляСкачивания% и обновите ее в своей информационной базе.
				|или в меню ""Каталог услуг"" - ""Интеграция (Автоклиент)"" - Приложение ""Модуль обмена"" - ""Загрузить версию 8.2-8.3 на управляемых формах"".
				|Для автоматического обновления открывайте обработку через меню Файл-Открыть';
				|uk='Доступна нова версія модуля обміну. Автоматичне оновлення неможливо. Скачайте нову версію за адресою %АдресМодуляДляСкачивания% і обновіть її в своїй інформаційній базі.
				|або у меню ""Каталог послуг"" - ""Інтеграція (Автоклієнт)"" - Додаток ""Модуль обміну"" - ""Завантажити версію 8.2-8.3 на керованих формах""
				|Для автоматичного оновлення відкривайте обробку через меню Файл-Відкрити'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%АдресМодуляДляСкачивания%", Объект.АдресАК + "/api/mop24/download/epf/8283managed");
			СообщениеПользователю(ТекстСообщения, Ложь);
			Отказ = Истина;
			Закрыть();
		КонецЕсли	
	Иначе
		ТекстСообщенияОшибки = НСтр("ru = 'У Вас установлена актуальная версия модуля обмена';uk='У Вас встановлена актуальна версія модуля обміну'");
		СообщениеПользователю(ТекстСообщенияОшибки, Ложь);
		ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОткатДоПредыдущейВерсии(Команда)

	ОтключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления");

	ПоказатьВопрос(Новый ОписаниеОповещения("ОткатДоПредыдущейВерсииЗавершение", ЭтаФорма), НСтр("ru='Откатить обработку до предыдущей версии?';uk='Відкотити обробку до попередньої версії?'"), РежимДиалогаВопрос.ДаНет)

КонецПроцедуры

&НаКлиенте
Процедура ОткатДоПредыдущейВерсииЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400);
		Возврат
	КонецЕсли;
	Если Объект.ОбработкаВнешняя Тогда
		Объект.ЭтоОткат = Истина;
		стПараметрыОтката = ПолучитьФайлОткатаКПредыдущейВерсии(УдалитьСимволl(Объект.ТекВерсия));
		Если стПараметрыОтката = Ложь Тогда
			Объект.ЭтоОткат = Ложь;
			Возврат
		КонецЕслИ;
		ФайлОтката = стПараметрыОтката.ФайлОтката;
		Объект.ВерсияОтката = стПараметрыОтката.ВерсияОтката;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПутьКурл", Объект.ПутьКурл);
		ПараметрыФормы.Вставить("ПоддерживаетсяTLS12", Объект.ПоддерживаетсяTLS12 И Не Объект.ФлажокИспользоватьКурлВсегда);
		ПараметрыФормы.Вставить("ИнтернетАдресДляСоединения", Объект.ИнтернетАдресДляСоединения);
		ПараметрыФормы.Вставить("ЭтоВебКлиент", Объект.ЭтоВебКлиент);
		ПараметрыФормы.Вставить("ЭтоWindows", Объект.ЭтоWindows);
		ПараметрыФормы.Вставить("БазовоеИмяФайла", Объект.БазовоеИмяФайла);
		ПараметрыФормы.Вставить("РасширениеФайла", Объект.РасширениеФайла);
		ПараметрыФормы.Вставить("ТекВерсия", Объект.ТекВерсия);
		ПараметрыФормы.Вставить("Путьmop24versions", Объект.Путьmop24versions);
		ПараметрыФормы.Вставить("АктуальнаяВерсияОбработки", Объект.ВерсияОтката);
		ПараметрыФормы.Вставить("ЭтоОткат", Объект.ЭтоОткат);
		ПараметрыФормы.Вставить("ФайлОтката", ФайлОтката.ПолноеИмя);
		ФормаОбновления = ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормаОбновления", ПараметрыФормы);
		Отказ = Истина;
		ПодключитьОбработчикОжидания("ПриОжиданииПроверкиОбновления", 14400);
		Закрыть();
	Иначе
		ТекстСообщения = НСтр("ru='Автоматический откат до предыдущей версии невозможен. Скачайте предыдущую версию по адресу https://client-bank.privatbank.ua/client_bank_jur/Privat24Managedupdateold.exe и замените ее в своей информационной базе.
			|Для автоматического обновления/отката открывайте обработку через меню Файл-Открыть';
			|uk='Автоматичний відкат до попередньої версії неможливий. Скачайте попередню версію за адресою https://client-bank.privatbank.ua/client_bank_jur/Privat24Managedupdateold.exe і заменіть її в своїй інформаційній базі.
			|Для автоматичного оновлення/відкату відкривайте обробку через меню Файл-Відкрити'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Отказ = Истина;
		Закрыть();
	КонецЕсли	

КонецПроцедуры

&НаКлиенте
Функция ПолучитьФайлОткатаКПредыдущейВерсии(ТекПредыдущаяВерсия)

	ТекущаяПредыдущаяВерсия = ТекПредыдущаяВерсия;

	КаталогПутьmop24versions = Новый Файл(Объект.Путьmop24versions);
	Если Не КаталогПутьmop24versions.Существует() Тогда
		ТекстСообщения = НСтр("ru='Откат к предыдущей версии не выполнен. Отсутствуют каталог и файлы предыдущих версий.';uk='Відкат до попередньої версії не виконаний. Відсутні каталог і файли попередніх версій.'");
		СообщениеПользователю(ТекстСообщения);
		Возврат Ложь
	КонецЕсли;

	Файлbadversions = Новый Файл(Объект.Путьmop24versions + "badversions.txt");
	Если Файлbadversions.Существует() Тогда
		ТекстДокументbadversions = Новый ТекстовыйДокумент;
		ТекстДокументbadversions.Прочитать(Файлbadversions.ПолноеИмя);
		ТекстДокументbadversionsПолученныйТекст = ТекстДокументbadversions.ПолучитьТекст()
	КонецЕсли;
	
	Файлversions = Новый Файл(Объект.Путьmop24versions + "versions.txt");
	Если Файлversions.Существует() Тогда
		ТекстДокументversions = Новый ТекстовыйДокумент;
		ТекстДокументversions.Прочитать(Файлversions.ПолноеИмя)
	Иначе
		ТекстСообщения = НСтр("ru='Откат к предыдущей версии не выполнен. Отсутствуют файлы предыдущих версий.';uk='Відкат до попередньої версії не виконаний. Відсутні файли попередніх версій.'");
		СообщениеПользователю(ТекстСообщения);
		Возврат Ложь
	КонецЕсли;

	//МинВерсия раскомментить// парсинг минимальной версии
	//Попытка
	//	структВерсия = РазложитьВерсию(МинВерсияОбработки, ".");
	//	НомерМинВерсии1 = структВерсия.НомерВерсии1;
	//	НомерМинВерсии2 = структВерсия.НомерВерсии2;
	//	НомерМинВерсии3 = структВерсия.НомерВерсии3;
	//	НомерМинВерсии4 = структВерсия.НомерВерсии4
	//Исключение КонецПопытки;

	// парсинг текущей версии
	структВерсия = РазложитьВерсию(ТекПредыдущаяВерсия, ".");
	НомерТекВерсии1 = структВерсия.НомерВерсии1;
	НомерТекВерсии2 = структВерсия.НомерВерсии2;
	НомерТекВерсии3 = структВерсия.НомерВерсии3;
	НомерТекВерсии4 = структВерсия.НомерВерсии4;

	ВерсияПредыдущаяИзФайла = "";
	Для НомерСТроки = 0 По ТекстДокументversions.КоличествоСтрок() Цикл

		//перебор с начала до конца от старшей версии к младшей при условии записи наоборот
		ФайлВерсииПредыдущейИзФайла = ТекстДокументversions.ПолучитьСтроку(НомерСТроки);
		ПозицияВерсииСтарт = СтрДлина(Объект.БазовоеИмяФайла) + 1;
		ПозицияВерсииФиниш = Найти(ФайлВерсииПредыдущейИзФайла, Объект.РасширениеФайла) - 1;
		ВерсияПредыдущаяИзФайла = Сред(ФайлВерсииПредыдущейИзФайла, ПозицияВерсииСтарт, ПозицияВерсииФиниш - ПозицияВерсииСтарт + 1);
		Если ЗначениеЗаполнено(ВерсияПредыдущаяИзФайла) Тогда

			Попытка
				структВерсия = РазложитьВерсию(ВерсияПредыдущаяИзФайла, ".");
				НомерВерсииПредИзФайла1 = структВерсия.НомерВерсии1;
				НомерВерсииПредИзФайла2 = структВерсия.НомерВерсии2;
				НомерВерсииПредИзФайла3 = структВерсия.НомерВерсии3;
				НомерВерсииПредИзФайла4 = структВерсия.НомерВерсии4
			Исключение
				Продолжить
			КонецПопытки;

			Если //МинВерсия раскомментить//НомерВерсииПредИзФайла1 <= НомерМинВерсии1 И НомерВерсииПредИзФайла2 <= НомерМинВерсии2
					//И НомерВерсииПредИзФайла3 <= НомерМинВерсии3 И НомерВерсииПредИзФайла4 <= НомерМинВерсии4 И
					(НомерВерсииПредИзФайла1 < НомерТекВерсии1 
						Или НомерВерсииПредИзФайла1 = НомерТекВерсии1 И НомерВерсииПредИзФайла2 < НомерТекВерсии2
						Или НомерВерсииПредИзФайла1 = НомерТекВерсии1 И НомерВерсииПредИзФайла2 = НомерТекВерсии2
						И НомерВерсииПредИзФайла3 < НомерТекВерсии3
						Или НомерВерсииПредИзФайла1 = НомерТекВерсии1 И НомерВерсииПредИзФайла2 = НомерТекВерсии2
						И НомерВерсииПредИзФайла3 = НомерТекВерсии3 И НомерВерсииПредИзФайла4 < НомерТекВерсии4)
					И Найти(ТекстДокументbadversionsПолученныйТекст, ВерсияПредыдущаяИзФайла) = 0 Тогда//проверка в badversions
				//работоспособная версия / использовать ВерсияПредыдущаяИзФайла
				ФайлОтката = Новый Файл(Объект.Путьmop24versions + Объект.БазовоеИмяФайла + СокрЛП(ВерсияПредыдущаяИзФайла) + Объект.РасширениеФайла);
				Если ФайлОтката.Существует() Тогда
					стПараметрыОтката = Новый Структура;
					стПараметрыОтката.Вставить("ФайлОтката", ФайлОтката);
					стПараметрыОтката.Вставить("ВерсияОтката", ВерсияПредыдущаяИзФайла);
					Возврат стПараметрыОтката
				Иначе
					ТекстСообщения = НСтр("ru='Отсутствует файл обработки для версии ';uk='Відсутній файл обробки для версії '")
						+ ВерсияПредыдущаяИзФайла + НСтр("ru=' Откат невозможен.';uk=' Відкат неможливий.'");
					СообщениеПользователю(ТекстСообщения, Ложь)
				КонецЕсли
			Иначе
				ВерсияПредыдущаяИзФайла = ""
			КонецЕсли
		КонецЕсли
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ВерсияПредыдущаяИзФайла) Тогда
		ТекстСообщения = НСтр("ru='Отсутствует предыдущая версия (отката) для версии ';uk='Відсутня попередня версія (відкату) для версії '")
			+ ТекПредыдущаяВерсия + НСтр("ru=' или имеющаяся версия отката неработоспособна. Откат невозможен.';uk=' або наявна версія відкату непрацездатна. Відкат неможливий.'");
		СообщениеПользователю(ТекстСообщения, Ложь)
	КонецЕсли;

	Возврат Ложь

КонецФункции

&НаКлиенте
Функция РазложитьВерсию(ТекстВерсия, Разделитель)

	ПозицияРазделителя1 = Найти(ТекстВерсия, Разделитель);
	Если ПозицияРазделителя1 > 0 Тогда
		Попытка
			НомерВерсии1 = Число(Сред(ТекстВерсия, 1, ПозицияРазделителя1))
		Исключение
			НомерВерсии1 = 0
		КонецПопытки
	КонецЕсли;
	ОстатокВерсии = Сред(ТекстВерсия, ПозицияРазделителя1 + 1);
	ПозицияРазделителя2 = Найти(ОстатокВерсии, Разделитель);
	Если ПозицияРазделителя2 > 0 Тогда
		Попытка
			НомерВерсии2 = Число(Сред(ОстатокВерсии, 1, ПозицияРазделителя2))
		Исключение
			НомерВерсии2 = 0
		КонецПопытки
	КонецЕсли;
	ОстатокВерсии = Сред(ОстатокВерсии, ПозицияРазделителя2 + 1);
	ПозицияРазделителя3 = Найти(ОстатокВерсии, Разделитель);
	ПозицияОкончания = Найти(ОстатокВерсии, " ");
	Если ПозицияРазделителя3 > 0 Тогда
		Попытка
			НомерВерсии3 = Число(Сред(ОстатокВерсии, 1, ПозицияРазделителя3))
		Исключение
			НомерВерсии3 = 0
		КонецПопытки;
		ОстатокВерсии = Сред(ОстатокВерсии, ПозицияРазделителя3 + 1);
		Попытка
			Если ПозицияОкончания > 0 Тогда
				НомерВерсии4 = Число(Сред(ОстатокВерсии, 1, ПозицияОкончания))
			Иначе
				НомерВерсии4 = Число(Сред(ОстатокВерсии, 1))
			КонецЕсли
		Исключение
			НомерВерсии4 = 0
		КонецПопытки;
	КонецЕсли;

	стВерсия = Новый Структура;
	стВерсия.Вставить("НомерВерсии1", НомерВерсии1);
	стВерсия.Вставить("НомерВерсии2", НомерВерсии2);
	стВерсия.Вставить("НомерВерсии3", НомерВерсии3);
	стВерсия.Вставить("НомерВерсии4", НомерВерсии4);

	Возврат стВерсия

КонецФункции

//---------     -------------------------------------------

&НаКлиенте
Процедура СтатьяДДСИсходящийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьТипСтатьиДДС(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипСтатьиДДС(ИмяЭлементаФормы)
		
	Если Объект.ИдКонф = "BP" Или Объект.ИдКонф = "BASC" ИЛИ Объект.ИдКонф = "UT_3" ИЛИ Объект.ИдКонф = "ERP"
			Или Объект.ИдКонф = "BSB" Или Объект.ИдКонф = "BASR" Тогда 
		Элементы[ИмяЭлементаФормы].ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	ИначеЕсли Объект.ИдКонф = "AAA" Тогда
		Элементы[ИмяЭлементаФормы].ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиДДС");
	//ИначеЕсли Объект.ИдКонф = "KUBU,UABY" Тогда//нет подходящих реквизитов 
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СтатьяДДСВходящийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьТипСтатьиДДС(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДДСПеремещениеДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьТипСтатьиДДС(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПодписьПлатежейНажатие(Элемент)
	
	ТекущийЭлемент = Элемент;	
	ПереключитьРабочуюОбласть(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиПодготовленных(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ПодготовленныеПлатежи Цикл
		
		СтрокаТЧ.Флажок = Ложь;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеПодготовленные(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.ПодготовленныеПлатежи Цикл
		
		СтрокаТЧ.Флажок = Истина;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПодготовленныеПлатежи(Команда)

	ПрочитатьПодготовленныеПлатежиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПодготовленныеПлатежиНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПрочитатьПодготовленныеПлатежи(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

//не используется
&НаКлиенте
Процедура ПодписатьПлатежныеДокументы(Команда)
	
	//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();

	//Если ЕстьДокументыДляПодписи Тогда
	//	ПодписьДокументов();
	//КонецЕсли;	
	
КонецПроцедуры

//не используется
&НаСервере
Функция ПодготовитьДокументыДляПодписиНаСервере(ЭтоPDF = Ложь)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ЕстьДокументыДляПодписи = ОбработкаОбьект.ПодготовитьДокументыДляПодписи(мИмяТекЭлемента, ЭтоPDF);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	Возврат ЕстьДокументыДляПодписи;
	
КонецФункции

//не используется
&НаКлиенте
Процедура ОтправитьПлатежныеДокументы(Команда)
	
	ОтправитьПлатежныеДокументыНаСервере();
	
КонецПроцедуры

//не используется
&НаСервере
Процедура ОтправитьПлатежныеДокументыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ОтправитьПлатежныеДокументы(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

//не используется
&НаКлиенте
Процедура ПрочитатьОтправленныеПлатежи(Команда)

	ПрочитатьОтправленныеПлатежиНаСервере();

КонецПроцедуры

//не используется
&НаСервере
Процедура ПрочитатьОтправленныеПлатежиНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПрочитатьОтправленныеПлатежи(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

// не используется
&НаСервере
Функция ПодписатьФинДокументыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПодписатьФинДокументы(Объект.ТекВидОперации);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	
	Возврат ВыпВЦикле;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьКолонкуНаСервере(тСписДок, ИмяКолонки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ВыгрузитьКолонку(тСписДок, ИмяКолонки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьPDFДокументы(Команда)

	Если Команда.Имя = "ПодписатьPDFДокументы" Тогда
		Объект.ФлагПодписатьБезОтправки = Ложь;
	Иначе//Если Команда.Имя = "ПодписатьPDFДокументыБезОтправки" Тогда
		Объект.ФлагПодписатьБезОтправки = Истина;
	КонецЕсли;

	тСписокДокументов = "СписокЭкспортаPDF";
	ВыгрузитьКолонкуНаСервере(тСписокДокументов, "Флажок");
	ТипДок = "PDFДокументы";//ТипДок = Объект.ТекВидОперации;

	КолДокДляОбработки = 0;
	ЕстьДублиДляИнтВыбора = Ложь;
	КолСтрокСДублями = 0;

	Для каждого СтрокаТЧ Из Объект[тСписокДокументов] Цикл

		Если НЕ СтрокаТЧ.Флажок Тогда
			Продолжить;
		КонецЕсли;	

		// проверки есть также далее при подписи
		//Основной документ должен быть в работе со статусом “Сохранен” или во входящих со статусом “Подписан контрагентом”
		ТекстДопустимыхДляПодписиСтатусов = НСтр("ru = ' должен быть `Сохранен` или `Подписан контрагентом`.';uk=' повинен бути `Збережений` або `Підписаний контрагентом`.'");
		СписДопустДляПодписиСтатусов = Объект.СписокДопустимыхДляПодписиСтатусов
			+ ?(ТипДок = "PDFдокументы", "," + Объект.СписокДопустимыхДляПодписиСтатусовPDFДок, "");
		Если Найти(СписДопустДляПодписиСтатусов, СтрокаТЧ.СтатусДокумента) = 0 Или ЗначениеЗаполнено(СтрокаТЧ.ТекстОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'Для подписи статус документа в строке ';uk='Для підпису статус документа в рядку '")
				+ СтрокаТЧ.НомерСтроки + ". " + ТекстДопустимыхДляПодписиСтатусов
				+ Символы.ПС + НСтр("ru = ' , а сейчас есть ';uk=' , зараз є '") + СтрокаТЧ.СтатусДокумента
				+ НСтр("ru = ' Документ пропущен.';uk=' Документ пропущений.'");
			СообщениеПользователю(ТекстСообщения, Ложь);
			СтрокаТЧ.Флажок = Ложь;
			Продолжить
		КонецЕсли;

		КолДокДляОбработки = КолДокДляОбработки + 1

	КонецЦикла;

	Если КолДокДляОбработки = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет документов для подписи.';uk='Немає документів для підпису.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	Если ЕстьДублиДляИнтВыбора Тогда
		ТекстСообщения = НСтр("ru = 'Существует ';uk='Існує '") + КолСтрокСДублями
			+ НСтр("ru = ' строк с дублями. Выберите в каждой строке в колонке `Список дублей`, где есть дубли, из списка отмеченных документов для подписи.';uk=' рядків з дублями. Оберіть в кожному рядку в колонці `Список дублів`, деє дублі, з списку позначених документ для підпису.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	ТекстСообщения = НСтр("ru = 'Подписываем ';uk='Підписуємо '") + КолДокДляОбработки + НСтр("ru = ' документов.';uk=' документів.'");
	СообщениеПользователю(ТекстСообщения, Ложь);

	ПодписьSmartID(тСписокДокументов, ТипДок)

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьФинДокументы(Команда)

	тСписокДокументов = "ФинансовыеДокументы";
	ВыгрузитьКолонкуНаСервере(тСписокДокументов, "Флажок");
	ТипДок = Объект.ТекВидОперации;
	КолДокДляОбработки = 0;
	ЕстьДублиДляИнтВыбора = Ложь;
	КолСтрокСДублями = 0;

	Если Команда.Имя = "ПодписатьФинДок" Тогда
		Объект.ФлагПодписатьБезОтправки = Ложь;
	Иначе//Если Команда.Имя = "ПодписатьФинДокБезОтправки" Тогда
		Объект.ФлагПодписатьБезОтправки = Истина;
	КонецЕсли;

	Для каждого СтрокаТЧ Из Объект[тСписокДокументов] Цикл

		Если НЕ СтрокаТЧ.Флажок Тогда
			Продолжить;
		КонецЕсли;	

		КодЕДРПОУКонтрагента = ПолучитьКодПоЕДРПОУКонтрагентаНаСервере(СтрокаТЧ.Контрагент);
		Если Не ЗначениеЗаполнено(КодЕДРПОУКонтрагента) Тогда
			ТекстСообщения = НСтр("ru = 'ЕДРПОУ контрагента не заполнено. Документ в строке ';uk='ЕГРПОУ контрагента не заповнений. Документ в рядку '")
				+ СтрокаТЧ.НомерСтроки + НСтр("ru = ' пропущен.';uk=' пропущений.'");
			СообщениеПользователю(ТекстСообщения, Ложь);
			СтрокаТЧ.Флажок = Ложь;
			Продолжить
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокумента) Тогда
			ИндексСтроки = Объект.ФинансовыеДокументы.Индекс(СтрокаТЧ);
			ПроверитьСтатусДокументаПоСтрокеНаСервере(ИндексСтроки, ТипДок)
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокумента) Тогда
			Если СтрокаТЧ.КартинкаСтатуса = 3 И ЗначениеЗаполнено(СтрокаТЧ.ТекстОшибки) Тогда
				//Есть дубли//для выбора документа из списка дублей для подписи SmartId
				ТекстСообщения = НСтр("ru = 'В строке ';uk='В рядку '") + СтрокаТЧ.НомерСтроки + НСтр("ru = ' есть дубли.';uk=' є дублі.'");
				СообщениеПользователю(ТекстСообщения, Ложь);
				ЕстьДублиДляИнтВыбора = Истина;
				КолСтрокСДублями = КолСтрокСДублями + 1
			Иначе
				ТекстСообщения = НСтр("ru = 'id документа не заполнено. Документ в строке ';uk='id документа не заповнений. Документ в рядку '")
					+ СтрокаТЧ.НомерСтроки
					+ НСтр("ru = ' пропущен. Прочитайте статус документа или отправьте документ.';uk=' пропущений. Прочитайте статус документа або відправте документ.'");
				СообщениеПользователю(ТекстСообщения, Ложь);
				Продолжить
			КонецЕсли
		КонецЕсли;

		//Основной документ должен быть в работе со статусом “Сохранен” или во входящих со статусом “Подписан контрагентом”
		ТекстДопустимыхДляПодписиСтатусов = НСтр("ru = ' должен быть `Сохранен` или `Подписан контрагентом`.';uk=' повинен бути `Збережений` або `Підписаний контрагентом`.'");
		СписДопустДляПодписиСтатусов = Объект.СписокДопустимыхДляПодписиСтатусов
			+ ?(ТипДок = "PDFдокументы", "," + Объект.СписокДопустимыхДляПодписиСтатусовPDFДок, "");
		Если Найти(СписДопустДляПодписиСтатусов, СтрокаТЧ.СтатусДокумента) = 0 Или ЗначениеЗаполнено(СтрокаТЧ.ТекстОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'Для подписи статус документа в строке ';uk='Для підпису статус документа в рядку '")
				+ СтрокаТЧ.НомерСтроки + ". " + ТекстДопустимыхДляПодписиСтатусов
				+ Символы.ПС + НСтр("ru = ' , а сейчас есть ';uk=' , зараз є '") + СтрокаТЧ.СтатусДокумента
				+ НСтр("ru = ' Документ пропущен.';uk=' Документ пропущений.'");
			СообщениеПользователю(ТекстСообщения, Ложь);
			СтрокаТЧ.Флажок = Ложь;
			Продолжить
		КонецЕсли;

		КолДокДляОбработки = КолДокДляОбработки + 1

	КонецЦикла;

	Если КолДокДляОбработки = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет документов для подписи.';uk='Немає документів для підпису.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	Если ЕстьДублиДляИнтВыбора Тогда
		ТекстСообщения = НСтр("ru = 'Существует ';uk='Існує '") + КолСтрокСДублями
			+ НСтр("ru = ' строк с дублями. Выберите в каждой строке в колонке `Список дублей`, где есть дубли, из списка отмеченных документов для подписи.';uk=' рядків з дублями. Оберіть в кожному рядку в колонці `Список дублів`, деє дублі, з списку позначених документ для підпису.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	ТекстСообщения = НСтр("ru = 'Подписываем ';uk='Підписуємо '") + КолДокДляОбработки + НСтр("ru = ' документов.';uk=' документів.'");
	СообщениеПользователю(ТекстСообщения, Ложь);

	ПодписьSmartID(тСписокДокументов, ТипДок)

	//подпись криптоплагином
	//ВыпВЦикле = ПодписатьФинДокументыНаСервере();
	//Если ВыпВЦикле = Истина Тогда
	//	Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
	//	//ЭтаФорма.Доступность = Ложь;
	//	ПодключитьОбработчикОжидания("ПодписатьФинДокументыВЦикле", 1);
	//Иначе
	//	//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
	//	//Если ЕстьДокументыДляПодписи Тогда
	//	//	ПодписьДокументов();
	//	//КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

// не используется
&НаКлиенте
Процедура ПодписатьФинДокументыВЦикле()

	ВыпВЦикле = ПодписатьФинДокументыНаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ПодписатьФинДокументыВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
		
		//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
		//Если ЕстьДокументыДляПодписи Тогда
		//	ПодписьДокументов();
		//КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция jsonПрочитатьИнициализацияНаСервере(ТекстОтветаДжСон)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтветаДжСон = ОбработкаОбьект.jsonПрочитатьИнициализация(ТекстОтветаДжСон);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтветаДжСон

КонецФункции

&НаСервере
Функция ПреобразоватьДатуНаСервере(ТекстДаты)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ПреобрДата = ОбработкаОбьект.ПреобразоватьДату(ТекстДаты);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат ПреобрДата

КонецФункции

&НаСервере
Функция ПолучитьКодПоЕДРПОУКонтрагентаНаСервере(Контрагент)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	КодПоЕДРПОУКонтрагента = ОбработкаОбьект.ПолучитьКодПоЕДРПОУКонтрагента(Контрагент);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат КодПоЕДРПОУКонтрагента

КонецФункции

//принудительно вызывается из СписокЭкспортаPDFВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка), т.к. непосредственно не вызывается
&НаКлиенте
Процедура СписокPDFДокументыТекущийДокИзДублейНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

	Попытка
		//при непосредственном вызове
		Элемент.СписокВыбора.Очистить()
	Исключение
		//при вызове из СписокЭкспортаPDFВыбор(...
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить()
	КонецПопытки;
	ТекущаяСтрока = Элементы.СписокЭкспортаPDF.ТекущаяСтрока;
	Попытка
		//при непосредственном вызове
		КартинкаСтатуса = ТекущаяСтрока.КартинкаСтатуса;
		ТекстОшибки = ТекущаяСтрока.ТекстОшибки
	Исключение
		//при вызове из СписокЭкспортаPDFВыбор(...
		КартинкаСтатуса = Элемент.ТекущиеДанные.КартинкаСтатуса;
		ТекстОшибки = Элемент.ТекущиеДанные.ТекстОшибки
	КонецПопытки;
	Если КартинкаСтатуса = 3 И ЗначениеЗаполнено(ТекстОшибки) Тогда
		//Есть дубли//для выбора документа из списка дублей для подписи SmartId
		СтруктураОтвета = jsonПрочитатьИнициализацияНаСервере(ТекстОшибки);
		Для каждого ДокДубль Из СтруктураОтвета.documents Цикл
			Попытка
				//при непосредственном вызове
				тДата = ТекущаяСтрока.Дата;
				КодЕДРПОУКонтрагента = ТекущаяСтрока.Контрагент.КодПоЕДРПОУ;//ОпределитьКодПоЕДРПОУКонтрагента(ТекущаяСтрока.Контрагент);
				СуммаДокумента = ТекущаяСтрока.СуммаДокумента
			Исключение
				//при вызове из СписокЭкспортаPDFВыбор(...
				тДата = Элемент.ТекущиеДанные.Дата;
				КодЕДРПОУКонтрагента = ПолучитьКодПоЕДРПОУКонтрагентаНаСервере(Элемент.ТекущиеДанные.Контрагент);
				СуммаДокумента = Элемент.ТекущиеДанные.СуммаДокумента
			КонецПопытки;
			ДокДубльДата = ПреобразоватьДатуНаСервере(СтрЗаменить(ДокДубль.CREATE_DATE, "-", ""));
			Если Лев(ДокДубльДата, 10) <> Лев(тДата, 10)//DOC_DATE//Строка(ТекущаяСтрока.Дата)
					Или Число(ДокДубль.AMOUNT) <> СуммаДокумента
					Или ДокДубль.OKPO_RECIPIENT <> КодЕДРПОУКонтрагента
					Тогда
				Продолжить
			КонецЕсли;
			ПредставлениеДокДубль = ДокДубль.ORIGINAL_DOC_NAME + " " + ДокДубль.CREATE_DATE + " " + ДокДубль.OKPO_SENDER + " " + ДокДубль.AMOUNT;
			Попытка
				//при непосредственном вызове
				Элемент.СписокВыбора.Добавить(ДокДубль.ID, ПредставлениеДокДубль)
			Исключение
				//при вызове из СписокЭкспортаPDFВыбор(...
				Элемент.ТекущийЭлемент.СписокВыбора.Добавить(ДокДубль.ID, ПредставлениеДокДубль)
			КонецПопытки
		КонецЦикла;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СписокPDFДокументыТекущийДокИзДублейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ТекущиеДанные.ИдДокумента = ВыбранноеЗначение;

	ПодписатьPDFДокументы("")

КонецПроцедуры

&НаСервере
Процедура ПроверитьСостояниеРегистрацииНалоговыхПоСтрокеНаСервере(ИндексСтроки, ТипДок)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтрокаТЧ = Объект.СписокДокументов[ИндексСтроки];
	ОбработкаОбьект.ПроверитьСостояниеРегистрацииНалоговыхПоСтроке(СтрокаТЧ, ТипДок);
	
КонецПроцедуры

&НаСервере
Функция ПодписатьНалоговыеДокументыНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ВыпВЦикле = ОбработкаОбьект.ПодписатьНалоговыеДокументы(Объект.ТекВидОперации);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
	ЭтаФорма.Доступность = НЕ ВыпВЦикле;
	 
	Возврат ВыпВЦикле;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьНалоговыеДокументы(Команда)

	тСписокДокументов = "СписокДокументов";
	ВыгрузитьКолонкуНаСервере(тСписокДокументов, "Флажок");
	ТипДок = Объект.ТекВидОперации;
	КолДокДляОбработки = 0;

	Для каждого СтрокаТЧ Из Объект[тСписокДокументов] Цикл

		Если НЕ СтрокаТЧ.Флажок Тогда
			Продолжить;
		КонецЕсли;	

		КодЕДРПОУКонтрагента = ПолучитьКодПоЕДРПОУКонтрагентаНаСервере(СтрокаТЧ.Контрагент);
		Если Не ЗначениеЗаполнено(КодЕДРПОУКонтрагента) И СтрокаТЧ.ВидДокумента <> НСтр("ru='Запрос к ЕРНН';uk='Запит до ЄРПН'") Тогда
			ТекстСообщения = НСтр("ru = 'ЕДРПОУ контрагента не заполнено. Документ в строке ';uk='ЕГРПОУ контрагента не заповнений. Документ в рядку '")
				+ СтрокаТЧ.НомерСтроки + НСтр("ru = ' пропущен.';uk=' пропущений.'");
			СообщениеПользователю(ТекстСообщения, Ложь);
			СтрокаТЧ.Флажок = Ложь;
			Продолжить
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокумента) Тогда// И ТипДок <> "Налоговые"
			ИндексСтроки = Объект[тСписокДокументов].Индекс(СтрокаТЧ);
			ПроверитьСостояниеРегистрацииНалоговыхПоСтрокеНаСервере(ИндексСтроки, ТипДок)
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокумента) Тогда
			Если СтрокаТЧ.КартинкаСтатуса = 3 И ЗначениеЗаполнено(СтрокаТЧ.ТекстОшибки) Тогда
				//Есть дубли//для выбора документа из списка дублей для подписи SmartId
				ТекстСообщения = НСтр("ru = 'В строке ';uk='В рядку '") + СтрокаТЧ.НомерСтроки + НСтр("ru = ' есть дубли.';uk=' є дублі.'");
				СообщениеПользователю(ТекстСообщения, Ложь);
				ЕстьДублиДляИнтВыбора = Истина;
				КолСтрокСДублями = КолСтрокСДублями + 1
			Иначе
				ТекстСообщения = НСтр("ru = 'id документа не заполнено. Документ в строке ';uk='id документа не заповнений. Документ в рядку '")
					+ СтрокаТЧ.НомерСтроки
					+ НСтр("ru = ' пропущен. Прочитайте статус документа или отправьте документ.';uk=' пропущений. Прочитайте статус документа або відправте документ.'");
				СообщениеПользователю(ТекстСообщения, Ложь);
				Продолжить
			КонецЕсли
		КонецЕсли;

		// для налоговых не реализовано разделение подписи на ПодписатьФинДок и ПодписатьФинДокБезОтправки
		//Если Команда.Имя = "ПодписатьФинДок" Тогда
		//	Объект.ФлагПодписатьБезОтправки = Ложь;
		//Иначе//Если Команда.Имя = "ПодписатьФинДокБезОтправки" Тогда
		//	Объект.ФлагПодписатьБезОтправки = Истина;
		//КонецЕсли;

		//Основной документ должен быть в работе со статусом “Сохранен” или во входящих со статусом “Подписан контрагентом”
		ТекстДопустимыхДляПодписиСтатусов = НСтр("ru = ' должен быть `Сохранен` или `Подписан контрагентом`.';uk=' повинен бути `Збережений` або `Підписаний контрагентом`.'");
		СписДопустДляПодписиСтатусов = Объект.СписокДопустимыхДляПодписиСтатусов
			+ ?(ТипДок = "PDFдокументы", "," + Объект.СписокДопустимыхДляПодписиСтатусовPDFДок, "");
		Если Найти(СписДопустДляПодписиСтатусов, СтрокаТЧ.СтатусДокумента) = 0 Или ЗначениеЗаполнено(СтрокаТЧ.ТекстОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'Для подписи статус документа в строке ';uk='Для підпису статус документа в рядку '")
				+ СтрокаТЧ.НомерСтроки + ". " + ТекстДопустимыхДляПодписиСтатусов
				+ Символы.ПС + НСтр("ru = ' , а сейчас есть ';uk=' , зараз є '") + СтрокаТЧ.СтатусДокумента
				+ НСтр("ru = ' Документ пропущен.';uk=' Документ пропущений.'");
			СообщениеПользователю(ТекстСообщения, Ложь);
			СтрокаТЧ.Флажок = Ложь;
			Продолжить
		КонецЕсли;

		КолДокДляОбработки = КолДокДляОбработки + 1

	КонецЦикла;

	ВыпВЦикле = ПодписатьНалоговыеДокументыНаСервере();

	Если ВыпВЦикле = Истина Тогда
		
		Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
		ПодключитьОбработчикОжидания("ПодписатьНалоговыеДокументыВЦикле", 1);
		
	Иначе

		//подпись криптоплагином
		//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
		//Если ЕстьДокументыДляПодписи Тогда
		//	ПодписьДокументов();
		//КонецЕсли;
	
	КонецЕсли;

	Если КолДокДляОбработки = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет документов для подписи.';uk='Немає документів для підпису.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	ТекстСообщения = НСтр("ru = 'Подписываем ';uk='Підписуємо '") + КолДокДляОбработки + НСтр("ru = ' документов.';uk=' документів.'");
	СообщениеПользователю(ТекстСообщения, Ложь);

	ПодписьSmartID(тСписокДокументов, ТипДок)

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьНалоговыеДокументыВЦикле()
	
	ВыпВЦикле = ПодписатьНалоговыеДокументыНаСервере();
	
	Если НЕ ВыпВЦикле Тогда
		ОтключитьОбработчикОжидания("ПодписатьНалоговыеДокументыВЦикле");
		Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;

		//подпись криптоплагином
		//ЕстьДокументыДляПодписи = ПодготовитьДокументыДляПодписиНаСервере();
		//Если ЕстьДокументыДляПодписи Тогда
		//	ПодписьДокументов();
		//КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте                                        
Процедура ПодписыватьФинансовыеДокументыПриОтравкеПриИзменении(Элемент)
	
	ВидимостьКнопокПодписиФинДок();
	
КонецПроцедуры

//Вызывается из ПриОткрытии() и ПодписыватьФинансовыеДокументыПриОтравкеПриИзменении(Элемент)
&НаКлиенте
Процедура ВидимостьКнопокПодписиФинДок()
	
	Если Объект.ПодписыватьФинансовыеДокументыПриОтравке Тогда//подписывать финансовые и налоговые документы при отправке

		Элементы.ТЧФинДокИсходящиеПодписатьФинДок.Видимость = Истина;
		Элементы.ТЧФинДокИсходящиеПодписатьФинДокБезОтправки.Видимость = Ложь;//Истина;

		//Подсказка отсутствует у кнопки
		ЗаголовокИПодсказка = НСтр("ru = 'Экспортировать, подписать и отправить документы';uk='Экспортувати, підписати і відправити документи'");
		Элементы.ТЧФинДокИсходящиеОтправить.Заголовок = ЗаголовокИПодсказка;

		Элементы.СписокДокументовЗарегистрироватьДокументы.Заголовок = НСтр("ru = 'Зарегистрировать, подписать и отправить документы';uk='Зареєструвати, підписати і відправити документи'");

		Элементы.ВыгрузитьPDFДокументы.Заголовок = НСтр("ru = 'Экспортировать, подписать и отправить PDF документы';uk='Экспортувати, підписати і відправити PDF документи'");

	Иначе	
		
		Элементы.ТЧФинДокИсходящиеПодписатьФинДок.Видимость = Истина;//Ложь;
		Элементы.ТЧФинДокИсходящиеПодписатьФинДокБезОтправки.Видимость = Ложь;//Истина;
		Элементы.ТЧФинДокИсходящиеОтправить.Заголовок = НСтр("ru = 'Экспортировать документы';uk='Экспортувати документи'");

		Элементы.СписокДокументовЗарегистрироватьДокументы.Заголовок = НСтр("ru = 'Зарегистрировать документы';uk='Зареєструвати документи'");
		
		Элементы.ВыгрузитьPDFДокументы.Заголовок = НСтр("ru = 'Экспортировать PDF документы';uk='Экспортувати PDF документи'");
		
	КонецЕсли;

	Элементы.СписокДокументовПодписатьНалоговые.Видимость = Истина

КонецПроцедуры	

// не используется
&НаКлиенте
Процедура НовостиБООбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	Попытка
		СтандартнаяОбработка = Ложь;
		////ЗапуститьПриложение(Расшифровка + "?lang=UK&v=" + Объект.ТекВерсия);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьЛогаВФайлПриИзмененииНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ТекстОтладки = "";
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьЛогаВФайлПриИзменении(Элемент)

	Элементы.ПоказатьФайлЛога.Видимость = Объект.ЗаписьЛогаВФайл;
	ЗаписьЛогаВФайлПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Функция ПоказатьФайлЛогаНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбьект.ТекстОтладки;

КонецФункции

&НаКлиенте
Процедура ПоказатьФайлЛога(Команда)

	ТекстЛогов = ПоказатьФайлЛогаНаСервере();
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(ТекстЛогов);
	ТД.Показать();

КонецПроцедуры

&НаКлиенте
Процедура ТекстРасшКредитовНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КаталогВыгрузки", Объект.КаталогВыгрузки);
	ПараметрыФормы.Вставить("ПутьКурл", Объект.ПутьКурл);
	ПараметрыФормы.Вставить("ПоддерживаетсяTLS12", Объект.ПоддерживаетсяTLS12 И Не Объект.ФлажокИспользоватьКурлВсегда);
	ПараметрыФормы.Вставить("АдресДокументооборота", Объект.АдресДокументооборота);
	ПараметрыФормы.Вставить("КодПоЕДРПОУ", Объект.КодПоЕДРПОУ);

	ПараметрыФормы.Вставить("ИспользоватьТокены", Объект.ИспользоватьТокены);
	ПараметрыФормы.Вставить("ТокеныКомпаний", Объект.ТокеныКомпаний);

	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("РежимОтладки", Объект.РежимОтладки);
	ПараметрыФормы.Вставить("ФлажокПоказыватьПароль", Объект.ФлажокПоказыватьПароль);
	ВидимостьФлагСчетИзЗаказа();

	Попытка//Если Объект.ОбработкаВнешняя Тогда
		ОткрытьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ФормированиеОтчетовДляКредитования", ПараметрыФормы);
	Исключение
		ОткрытьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ФормированиеОтчетовДляКредитования", ПараметрыФормы);
	КонецПопытки;
	
	ОтправитьСтатистку("ДокументыОтчеты", "РасшифровкаКредитОткрытие", , Истина);
	
КонецПроцедуры

&НаСервере
Процедура НеЗаполнятьЗагруженныеРанееПлатежиПриИзмененииНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");	
	
	Если ОбработкаОбьект.НеЗаполнятьЗагруженныеРанееПлатежи Тогда
		ОбработкаОбьект.ПерезаполнятьНайденныеПлатежи	= Ложь;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполнятьЗагруженныеРанееПлатежиПриИзменении(Элемент)
	
	Элементы.ПерезаполнятьНайденныеПлатежи.Видимость = НЕ Объект.НеЗаполнятьЗагруженныеРанееПлатежи;

	НеЗаполнятьЗагруженныеРанееПлатежиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Попытка
			Если ФормаОбновления.Открыта() Тогда
				ФормаОбновления.Закрыть()
			КонецЕсли
		Исключение КонецПопытки;
		Возврат
	КонецЕсли;

	СтруктураНастроек = ПодготовитьНастройкиФормыДляСохранения();

	СохранитьНастройкиФормы(СтруктураНастроек);

	ОтправитьСтатистку("Закрытие", "Закрытие", , Истина);

    Если ПараметрыЗаписи = Неопределено Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть()
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СохранениеНесохраненныхДанных() Экспорт

	ПередЗакрытиемЗавершение(КодВозвратаДиалога.Да, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	

	Если Не ВыполняетсяЗакрытие Тогда
		Если Не ЗавершениеРаботы = Истина Тогда
			ТекстПрефикса = "";
			Если Объект.ЭтоОткат Тогда
				ТекстПрефикса = НСтр("ru='Доступна версия для отката ';uk='Доступна версія для відкату '") + Объект.ВерсияОтката + "." + Символы.ПС;
				ТекстПрефикса = ТекстПрефикса + НСтр("ru='Текущая версия модуля (обработки) ';uk='Поточна версія модуля (обробки) '") + Объект.ТекВерсия
					+ "." + Символы.ПС;
				ТекстПрефикса = ТекстПрефикса + НСтр("ru='Для отката необходимо закрыть модуль (обработку). ';uk='Для відкату необхідно закрити модуль (обробку). '")	+ Символы.ПС
			ИначеЕсли Объект.ЭтоОбновление Тогда
				ТекстПрефикса = НСтр("ru='Доступна версия для обновления ';uk='Доступна версія для оновлення '") + Объект.АктуальнаяВерсия + "." + Символы.ПС;
				ТекстПрефикса = ТекстПрефикса + НСтр("ru='Текущая версия модуля (обработки) ';uk='Поточна версія модуля (обробки) '") + Объект.ТекВерсия
					+ "." + Символы.ПС;
				ТекстПрефикса = ТекстПрефикса + НСтр("ru='Для обновления необходимо закрыть модуль (обработку). ';uk='Для оновлення необхідно закрити модуль (обробку). '") + Символы.ПС
			КонецЕсли;
			//ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстПрефикса + ("ru='Закрыть обработку?';uk='Закрити обробку?'"), РежимДиалогаВопрос.ДаНет);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтаФорма), ТекстПрефикса + НСтр("ru='Закрыть обработку?';uk='Закрити обробку?'"), РежимДиалогаВопрос.ДаНет);
			Объект.ЭтоОткат = Ложь;
			Объект.ЭтоОбновление = Ложь;
			СтандартнаяОбработка = Ложь;
			Отказ = Истина
		Иначе
        	Отказ = Истина;
        	ТекстПредупреждения = "Закрытие формы приведёт к потере несохранённых данных!";
        	ПодключитьОбработчикОжидания("СохранениеНесохраненныхДанных", 0.1, Истина);//1
		КонецЕсли
	КонецЕсли;
	Объект.ЭтоОткат = Ложь;
	Объект.ЭтоОбновление = Ложь

КонецПроцедуры

&НаКлиенте
Процедура ПоискПлатежныхДокументовПоУказаннымПолямПриИзменении(Элемент)

	Элементы.ОткрытьФормуНастройкиПоискаДокументов.Видимость = Объект.ПоискПлатежныхДокументовПоУказаннымПолям;
	ПоискПлатежныхДокументовПоУказаннымПолямПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ПоискПлатежныхДокументовПоУказаннымПолямПриИзмененииСервер()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьПоляПоиска();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТокеныПриИзменении(Элемент)
	
	Элементы.ГруппаКартИТекстОжидания.Видимость = Истина;
	ЗаполнитьСписокТокеновПоКомпаниям();
	УстановитьВидимостьПолейТокенАвторизации();
	Элементы.ГруппаКартИТекстОжидания.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолейТокенАвторизации()
	
	Элементы.ГруппаТокеныКонманий.Видимость = Истина;
	Элементы.ДекорОтступГруппыАвторизации.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТокеновПоКомпаниям()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокТокеновПоКомпаниям();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)

	ПерейтиПоНавигационнойСсылке("https://docs.google.com/document/d/19n3GIp8RuoNimgmHwoSE-u0paCR-nI89iU4p33WWIBc/edit#bookmark=id.fbyfvdilrh0");
	//НачатьЗапускПриложения(Новый ОписаниеОповещения("ВложениеВыборЗавершение", ЭтаФорма), "https://docs.google.com/document/d/19n3GIp8RuoNimgmHwoSE-u0paCR-nI89iU4p33WWIBc/edit#bookmark=id.fbyfvdilrh0");	 

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВедомостьВФайлНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ВыгрузитьВедомостьВФайл();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВедомостьВФайл(Команда)

	Объект.ДействиеАналитики = "ЗПВедомостьВыгрузкаВФайл";

	ПроверитьНаличиеКаталогаИВыгрузить(Объект.КаталогВыгрузкиЗП, "XLS");

КонецПроцедуры

&НаКлиенте
Процедура ТокеныКомпанийПриИзменении(Элемент)

	Если Элементы.ТокеныКомпаний.ТекущиеДанные <> Неопределено Тогда
		ОбновитьОтображениеСтатуса(ЗначениеЗаполнено(Элементы.ТокеныКомпаний.ТекущиеДанные.ТокенАвтоклиента));
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ИДПакетаЗачисленийОчистка(Элемент, СтандартнаяОбработка)

	ИДПакетаЗачислений = "";
	Элементы.ИДПакетаЗачислений.СписокВыбора.Очистить()

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудникаВГруппу(Команда)

	ДействиеАналитики = "ДобавлениеСотрудникаВГруппу";
	Объект.ДействиеАналитики = ДействиеАналитики;

	Если Найти(Объект.ВидВыплаты, НСтр("ru='Зарплатная выплата';uk='Зарплатна виплата'")) = 0 И Не Объект.UnitТест Тогда
		Если Не Объект.UnitТест Тогда
			ТекстСообщения = НСтр("ru='Сотрудники не могут быть добавлены в проект массовых виплат.';uk='Співробітники не можуть бути додані в проект масових виплат.'");
			СообщениеПользователю(ТекстСообщения, Ложь)
		КонецЕсли;
		Возврат
	КонецЕсли;

	Элементы.ГруппаСтраницыЗП.ТекущаяСтраница = Элементы.ГруппаСтраницыЗП.ПодчиненныеЭлементы.СторінкаДобавлениеСотрудников;

	Если Объект.ТабличноеПолеПолучателиЗП = Неопределено Или Объект.ТабличноеПолеПолучателиЗП.Количество() = 0 Тогда
		//	таблица с добавляемыми сотрудниками пусты
		ТекстСообщения = НСтр("ru='Выберите сотрудника(ов)!';uk='Оберіть співробітника(ів)!'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	ОбъектТабличноеПолеПолучателиЗП = Объект.ТабличноеПолеПолучателиЗП;
	ОбъектТекущийЗП = Объект.ТекущийЗП;
	СтруктураОтвета = ДобавитьСотрудникаВГруппуСпискомНаСервере(ОбъектТабличноеПолеПолучателиЗП, ОбъектТекущийЗП);
	Успешно = СтруктураОтвета.Успешно;
	ТекстСообщения = СтруктураОтвета.ТекстСообщения;
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Если Не Объект.UnitТест Тогда
			СообщениеПользователю(ТекстСообщения, Ложь)
		КонецЕсли;
		Возврат
	КонецЕсли;

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция ДобавитьСотрудникаВГруппуСпискомНаСервере(ТабличноеПолеПолучателиЗП, ТекущийЗП)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ДобавитьСотрудникаВГруппуСписком(ТабличноеПолеПолучателиЗП, ТекущийЗП);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаКлиенте
Процедура ТабличноеПолеПолучателиЗПКолонкаСотрудникПриИзменении(Элемент)

	ЗаполнитьТНИННСотрудника(Элемент.Родитель.ТекущиеДанные.КолонкаСотрудник, Элемент.Родитель.ТекущиеДанные.НомерСтроки)

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТНИННСотрудника(Сотрудник, НомерСтроки)

	ТекСтрока = Объект.ТабличноеПолеПолучателиЗП[НомерСтроки - 1];
	Попытка
		//	БУ2, BASC, BASКУП, BASSM, UNF
		ТекСтрока.КолонкаТабельныйНомер = СокрЛП(Сотрудник.Код)
	Исключение
		//	УТ3
	КонецПопытки;

	Попытка
		//	БУ2, BASC, BASКУП
		ТекСтрока.КолонкаИНН = СокрЛП(Сотрудник.ФизическоеЛицо.КодПоДРФО)
	Исключение
		Попытка
			//	BASSM, UNF
			ТекСтрока.КолонкаИНН = СокрЛП(Сотрудник.ФизЛицо.КодПоДРФО)
		Исключение
			Попытка
				//	УТ3
				ТекСтрока.КолонкаИНН = СокрЛП(Сотрудник.КодПоДРФО)
			Исключение
			КонецПопытки
		КонецПопытки
	КонецПопытки

КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокЭкспортаPDFНастройкаПодписи(Команда)

	Объект.ФлагПодписатьДокументы = Ложь;
	//Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ОблПодпись
	ПодписьДокументов(Объект.ФлагПодписатьДокументы)

КонецПроцедуры

//------------- Подпись SmartID ----------------------

&НаСервере
Функция ОтправкаПодписьSmartIDНаСервере(тСписокДокументов, ТипДок, ПодписыватьДокумент, ПроверятьСтатусыПередПодписью)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ОтправкаПодписьSmartID(тСписокДокументов, ТипДок, ПодписыватьДокумент, ПроверятьСтатусыПередПодписью);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаКлиенте
Функция ПодписьSmartID(тСписокДокументов, ТипДок, ПодписыватьДокумент = Истина, ПроверятьСтатусыПередПодписью = Истина)

	Объект.сзСопоставленнаяСтрокаПодписи.Очистить();
	ЕстьДокументыДляПодписиSmartId = Ложь;
	мИндекс = 0;
	Для каждого мСтрокаТЧ Из Объект.мФлажкиПодписи Цикл//Для каждого СтрокаТЧ Из Объект.тзФлажкиПодписи Цикл//Объект[тСписокДокументов] Цикл
		Если мСтрокаТЧ Тогда//Если СтрокаТЧ.Флажок Тогда
			ЕстьДокументыДляПодписиSmartId = Истина;
			Объект.сзСопоставленнаяСтрокаПодписи.Добавить(мИндекс + 1)//СтрокаТЧ.НомерСтроки
		КонецЕсли;
		мИндекс = мИндекс + 1
	КонецЦикла;
	Если Не ЕстьДокументыДляПодписиSmartId Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствуют документы для подписи.';uk='Відсутні документи для підпису.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат Ложь
	КонецЕсли;

	Если Объект.СчетчикПодписиSmartID = Неопределено Тогда
		Объект.СчетчикПодписиSmartID = 0
	КонецЕсли;

	Объект.ПараметрыПроверкиСтатусаПодписи = ОтправкаПодписьSmartIDНаСервере(тСписокДокументов, ТипДок, ПодписыватьДокумент, ПроверятьСтатусыПередПодписью);

	Если Объект.ПараметрыПроверкиСтатусаПодписи = Ложь Тогда
		Возврат Ложь
	ИначеЕсли Объект.ПараметрыПроверкиСтатусаПодписи = Истина Тогда
		//пока не используется
		////ЗаполнитьСписокВыбораДублейФинДок();
		//выбрать интерактивно документ-дубль для пдфдок
		////Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблВыбратьДубльДок;
		Возврат Ложь
	КонецЕсли;

	Если ТипДок = "Налоговые" И (//Объект.ПараметрыПроверкиСтатусаПодписи.status <> "0" Или
				Не ЗначениеЗаполнено(Объект.ПараметрыПроверкиСтатусаПодписи.clientId)
				Или Не ЗначениеЗаполнено(Объект.ПараметрыПроверкиСтатусаПодписи.operationId))
			Или ТипДок <> "Налоговые" И Объект.ПараметрыПроверкиСтатусаПодписи.status <> "1" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка начала подписи.';uk='Помилка початку підпису.'");
		СообщениеПользователю(ТекстСообщения);
		Возврат Ложь
	КонецЕсли;

	Объект.СчетчикПодписиSmartID = 0;
	QRКодВыведен = Ложь;
	ПодключитьОбработчикОжидания("ОжиданиеПодписиSmartID", 1)

КонецФункции	//	ПодписьSmartID(тСписокДокументов, ТипДок)

&НаСервере
Функция ПроверкаСтатусаПодписиSmartIDНаСервере(SmartIDv2)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ПроверкаСтатусаПодписиSmartID(SmartIDv2);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаСервере
Функция ОтправитьПодписанныйДокументSmartIDНаСервере(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ОтправитьПодписанныйДокументSmartID(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаСервере
Функция ОтправитьПодписанныйДокументSmartIDвPaperLessНаСервере(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ОтправитьПодписанныйДокументSmartIDвPaperLess(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаСервере
Процедура ПроверитьСтатусДокументаПоСтрокеНаСервере(ИндексСтроки, ТипДок)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтрокаТЧ = Объект.ФинансовыеДокументы[ИндексСтроки];
	ОбработкаОбьект.ПроверитьСтатусДокументаПоСтроке(СтрокаТЧ, ТипДок);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытию, ДействАналитики)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Если Не Объект.UnitТест Тогда
		ОбработкаОбьект.ОбновитьСтатистикуРаботы(КатегорияПоСобытию, ДействАналитики)
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция КатегорияПоСобытиюНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	Категория = ОбработкаОбьект.КатегорияПоСобытию();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат Категория

КонецФункции

&НаКлиенте
Процедура ОжиданиеПодписиSmartID()

	ОтключитьОбработчикОжидания("ОжиданиеПодписиSmartID");

	Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблСписокНалоговыхДокументов" Тогда
		SmartIDv2 = Истина
	Иначе
		SmartIDv2 = Ложь
	КонецЕсли;
	СтруктураОтветаСтатусаПодписиSmartID = ПроверкаСтатусаПодписиSmartIDНаСервере(SmartIDv2);
	Объект.СчетчикПодписиSmartID = Объект.СчетчикПодписиSmartID + 1;

	Если Объект.СчетчикПодписиSmartID >= 300 Тогда//5 минут
		ТекстСообщения = НСтр("ru = 'Истек интервал ожидания. Документ не подписан.';uk='Закінчився інтервал очікування. Документ не підписаний.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		ФормаПодпись.Закрыть();
		Возврат
	КонецЕсли;

	Попытка
		status = СтруктураОтветаСтатусаПодписиSmartID.status
	Исключение
		Если QRКодВыведен Тогда
			ФормаПодпись.Закрыть()
		КонецЕсли;
		ТекстСообщения = НСтр("ru = 'Ошибка получения статуса отправки документа(ов) на подпись.';uk='Помилка отримання статуса відправки документа(ів) на підпис.'");
		СообщениеПользователю(ТекстСообщения);
		Возврат
	КонецПопытки;

	Если status = "1" Или status = "0" И Не QRКодВыведен И SmartIDv2 Тогда
		// В ожидании подтверждения, показать QR-код
		Если Не QRКодВыведен Тогда
			СформироватьИВывестиQRКод(Объект.ПараметрыПроверкиСтатусаПодписи)
		КонецЕсли;
		QRКодВыведен = Истина;
		ПодключитьОбработчикОжидания("ОжиданиеПодписиSmartID", 1)
	ИначеЕсли status = "0" Тогда
		//	Операция зарегистрирована
		ПодключитьОбработчикОжидания("ОжиданиеПодписиSmartID", 1)
	ИначеЕсли status = "2" Тогда
		//	Успешный результативный статус, закрыть QR-код, прочитать статус документа(ов)
		Если Не Объект.UnitТест Тогда
			ФормаПодпись.Закрыть()
		КонецЕсли;
		ТекстСообщения = НСтр("ru = 'Полученный(е) подписанный(е) документ(ы) отправляе(ю)тся на подпись.';uk='Отриманий(і) підписаний(і) документ(и) відправляє(ю)ться на підпис.'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		ОшибкаПодписи = Ложь;
		Если Объект.UnitТест Тогда
			Если Объект.СписокЭкспортаPDF.Количество() > 0 Тогда
				вСписокДокументов = "СписокЭкспортаPDF";
				ТипДок = "PDFPaperless";
				РезультатОтправки = ОтправитьПодписанныйДокументSmartIDвPaperLessНаСервере(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок);
			КонецЕсли;
			Если Объект.СписокДокументов.Количество() > 0 Тогда
				вСписокДокументов = "ФинансовыеДокументы";
				ТипДок = Объект.ТекВидОперации;
				РезультатОтправки = ОтправитьПодписанныйДокументSmartIDНаСервере(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок)
			КонецЕсли
		Иначе
			Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблСписокНалоговыхДокументов" Тогда
				// Налоговые / SmartIDv2 = Истина
			ИначеЕсли Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблВыгрузкаPDF" Тогда
				//	PaperLess
				вСписокДокументов = "СписокЭкспортаPDF";
				ТипДок = "PDFPaperless";
				РезультатОтправки = ОтправитьПодписанныйДокументSmartIDвPaperLessНаСервере(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок);
			Иначе//Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблФинДок" Или Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблPDFДокументы" Тогда 
				//	ЭДО
				Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблФинДок" Тогда
					вСписокДокументов = "ФинансовыеДокументы";
					ТипДок = Объект.ТекВидОперации
				Иначе//Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблPDFДокументы" Тогда
					вСписокДокументов = "СписокЭкспортаPDF";
					ТипДок = "PDFДокументы"
				КонецЕсли;
				РезультатОтправки = ОтправитьПодписанныйДокументSmartIDНаСервере(СтруктураОтветаСтатусаПодписиSmartID, вСписокДокументов, ТипДок);
			КонецЕсли
		КонецЕсли;

		Если SmartIDv2 Тогда
			totalCount = СтруктураОтветаСтатусаПодписиSmartID.totalCount;
			successCount = СтруктураОтветаСтатусаПодписиSmartID.successCount;
			ТекстСообщения = НСтр("ru = 'Успешно подписано ';uk='Успішно підписано '") + successCount
				+ НСтр("ru = ' документов из ';uk=' документів з '") + totalCount
		Иначе
			Если ОшибкаПодписи Или РезультатОтправки = Ложь Или Не ЗначениеЗаполнено(РезультатОтправки) Тогда
				ТекстСообщения = НСтр("ru = 'Ошибка отправки подписанного(ых) документа(ов). Документ(ы) не подписан(ы).';uk='Помилка відправки підписанного(их) документа(ів). Документ(и) не підписаний(і).'");
				СообщениеПользователю(ТекстСообщения);
				Возврат
			КонецЕсли;
			ТекстСообщения = НСтр("ru = 'Документ успешно подписан.';uk='Документ(и) успішно підписаний(і).'")
		КонецЕсли;
		СообщениеПользователю(ТекстСообщения, Ложь);
		Если Объект.UnitТест Тогда
			UnitТестПодписиSmartIDОК = Истина
		Иначе
			ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
		КонецЕсли;
		//Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблФинДок" Тогда
		//	ТипДок = Объект.ТекВидОперации;
		//	ПроверитьСтатусыФинДок("")
		//Иначе//Если Элементы.ПанельОбластей.ТекущаяСтраница.Имя = "ОблPDFДокументы" Тогда
		//	ТипДок = "PDFДокументы";
		//	ПроверитьСтатусыФинДокPDF("")
		//КонецЕсли;
		Возврат
	ИначеЕсли status = "3" Тогда
		//	операция отклонена (клиент отклонил запрос), закрыть QR-код
		ФормаПодпись.Закрыть();
		ТекстСообщения = НСтр("ru = 'Вы отклонили подпись. Документ(ы) не подписан(ы).';uk='Ви відхилили підпис. Документ(и) не підписаний(і).'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	ИначеЕсли status = "4" Тогда
		//	ошибка (при обработке запроса), закрыть QR-код
		ФормаПодпись.Закрыть();
		ТекстСообщения = НСтр("ru = 'Ошибка при обработке запроса подписи. Документ(ы) не подписан(ы).';uk='Помилка при обробці запиту підпису. Документ(и) не підписаний(і).'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли;

	Если Не ФормаПодпись.Открыта() Тогда
		ОтключитьОбработчикОжидания("ОжиданиеПодписиSmartID");
		ТекстСообщения = НСтр("ru = 'Вы закрыли окно с QR-кодом и отклонили подпись. Документ(ы) не подписан(ы).';uk='Ви закрили вікно з QR-кодом і відхилили підпис. Документ(и) не підписаний(і).'");
		СообщениеПользователю(ТекстСообщения, Ложь);
		Возврат
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция ПолучитьQRКодНаСервере(QRСтрока, РазмерКода)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ПолучитьQRКод(QRСтрока, РазмерКода);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаКлиенте
Функция СформироватьИВывестиQRКод(СтруктураВозврата)

	QRСтрока = "https://www.privat24.ua/rd/kep?hash=rd/kep/{""clientId"":""" + СтруктураВозврата.clientId
		+ """, ""operationId"":""" + СтруктураВозврата.operationId + """}";
	РазмерКода = 80;
	Картинка = ПолучитьQRКодНаСервере(QRСтрока, РазмерКода);

	Попытка
		ФормаПодпись = ПолучитьФорму("Обработка.МодульОбменаПриват24вБО.Форма.ПодписьSmartId");//, стПараметрыФормы);
	Исключение
		ФормаПодпись = ПолучитьФорму("ВнешняяОбработка.МодульОбменаПриват24вБО.Форма.ПодписьSmartId");//, ПараметрыФормы);
	КонецПопытки;

	ФормаПодпись.Картинка = Картинка;
	ФормаПодпись.ТолькоПросмотр = Истина;
	ФормаПодпись.Открыть()

КонецФункции

//-------------------------------------

//пока не используется
&НаКлиенте
Процедура ЗаполнитьСписокВыбораДублейФинДок()
	
	Элементы.ТекущийДокИзДублей.СписокВыбора.Очистить();
	Объект.ТекущийДокИзДублей = "";
	Для Каждого СтрокаДублей Из Объект.сзДокДубли Цикл
		Элементы.ТекущийДокИзДублей.СписокВыбора.Добавить(СтрокаДублей.Значение, СтрокаДублей.Представление)
	КонецЦикла;	
	
КонецПроцедуры 

//не используется
&НаКлиенте
Процедура сзДокДублиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Объект.сзДокДубли.Очистить();
	ЭлементСзДокДубли = Элементы.ТекущийДокИзДублей.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Объект.сзДокДубли.Добавить(ЭлементСзДокДубли.Значение, ЭлементСзДокДубли.Представление);
	Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблPDFДокументы;
	ПодписатьPDFДокументы("")

КонецПроцедуры

//не используется
&НаКлиенте
Процедура КомандаДублиДокОтменаВыбора(Команда)

	Элементы.ПанельОбластей.ТекущаяСтраница = Элементы.ПанельОбластей.ПодчиненныеЭлементы.ОблPDFДокументы;
	Возврат

КонецПроцедуры

&НаКлиенте
Процедура ТекстАвтоЗаполнениеНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь)

КонецПроцедуры

&НаКлиенте
Процедура ТекстАвтоОбменПлатежейНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь)

КонецПроцедуры

&НаКлиенте
Процедура ТекстНастройкиЗПНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь)

КонецПроцедуры

&НаКлиенте
Процедура ТекстНастройкиПроксиНажатие(Элемент)

	ИспользоватьПроксиПриИзменении(Неопределено);

	ТекущийЭлемент = Элемент;
	Попытка
		ПереключитьРабочуюОбласть(Элемент, Ложь)
	Исключение
		ПереключитьРабочуюОбласть(Элементы[ИмяОбластиВозврата.Имя],, ИмяЗаголовкаВозврата, Истина)
	КонецПопытки;

	ИмяОбластиВозврата = "";
	ИмяЗаголовкаВозврата = ""

КонецПроцедуры

&НаКлиенте
Процедура ТекстПутьКФайламНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент, Ложь)
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокВыводитьОстаткиПлатежиПриИзменении(Элемент)

	Элементы.ГруппаОстаткиНаСчетахИмпорт.Видимость = Объект.ФлажокВыводитьОстаткиПлатежи;
	Элементы.ГруппаОстаткиНаСчетахЭкспорт.Видимость = Объект.ФлажокВыводитьОстаткиПлатежи

КонецПроцедуры

&НаКлиенте
Процедура ТекстВернутьсяИзПодписиНажатие(Элемент)

	ВидимостьКомандПапка24(Истина);
	ПереключитьРабочуюОбласть(Элемент, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗаполнитьПредприятияОбновить(Команда)

	ПрочитатьЗаполнитьПредприятияАКСервер()

КонецПроцедуры

&НаСервере
Процедура ДобавитьНаОснованииДокППИНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ДобавитьНаОснованииДокППИ();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура КомандаТЧФинДокВходящиеДобавитьНаОсновании(Команда)

	ДобавитьНаОснованииДокППИНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьТЧФинДокВходящиеДобавитьНаОсновании()

	Элементы.ТЧФинДокВходящиеДобавитьНаОсновании.Видимость = Объект.ТекВидОперации = "Счета"
		И Элементы.ГруппаСписокФинДок.ТекущаяСтраница = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокВходящие
		И Объект.ФинансовыеДокументы.Количество() > 0

КонецПроцедуры

&НаКлиенте
Процедура ТЧФинДокВходящиеПослеУдаления(Элемент)

	ВидимостьТЧФинДокВходящиеДобавитьНаОсновании();

	ВидимостьКнопокФинДокВходящие()

КонецПроцедуры

&НаКлиенте
Процедура ПанельДействийПриСменеСтраницы(Элемент, ТекущаяСтраница)

	ВидимостьКолонкаНазначениеПлатежа()

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКолонкаНазначениеПлатежа()

	Если Объект.ТекВидОперации = "Счета" Тогда
		ФинДокВходящие = Элементы.ГруппаСписокФинДок.ТекущаяСтраница = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокВходящие;
		ФинДокИсходящие = Элементы.ГруппаСписокФинДок.ТекущаяСтраница = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокИсходящие;

		Элементы.ТЧФинДокИсходящие.ПодчиненныеЭлементы.КолонкаНазначениеПлатежа.ТолькоПросмотр = Не (ФинДокИсходящие
			И Объект.НазначениеПлатежаСчетов <> Объект.сзНазначенияПлатежейСчетов[0].Значение)
	Иначе
		ФинДокВходящие = Ложь;
		ФинДокИсходящие = Ложь
	КонецЕсли;

	Элементы.ТЧФинДокВходящие.ПодчиненныеЭлементы.КолонкаНазначениеПлатежаВх.Видимость = ФинДокВходящие;
	Элементы.ТЧФинДокИсходящие.ПодчиненныеЭлементы.КолонкаНазначениеПлатежа.Видимость = ФинДокИсходящие
		И Объект.НазначениеПлатежаСчетов <> Объект.сзНазначенияПлатежейСчетов[0]

КонецПроцедуры

&НаКлиенте
Процедура КолонкаНазначениеПлатежаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Если СтрДлина(Текст) < 5 Или СтрДлина(Текст) > 420 Тогда
		ТекстСообщения = НСтр("ru = 'Длина назначения платежа должна быть в диапазоне от 5 до 420 символов.';uk='Довжина призначення платежу повинна бути в діапазоні від 5 до 420 символів.'");
		СообщениеПользователю(ТекстСообщения, Ложь)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СпособПроводитьДокументыПриИзменении(Элемент)

	Объект.ПроводитьПлатежи = Элементы.СпособПроводитьДокументы.СписокВыбора.Индекс(Элементы.СпособПроводитьДокументы.СписокВыбора.НайтиПоЗначению(Объект.СпособПроводитьДокументы)) + 1

КонецПроцедуры

&НаСервере
Процедура СообщениеПользователю(ТекстСообщения, ОтправлятьСтатистику = Истина)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.СообщениеПользователю(ТекстСообщения, ОтправлятьСтатистику);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

//------------------ КорпКарты ------------------------

&НаКлиенте
Процедура ТекстКорпКартыНажатие(Элемент)

	ТекущийЭлемент = Элемент;
	ПереключитьРабочуюОбласть(Элемент)

КонецПроцедуры

&НаСервере
Функция ПолучениеИнформацииПоКорпКартамНаСервере(КолКартВПачке, corporation = Неопределено, ПолеВыбораТипКарты)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ПолучениеИнформацииПоКорпКартам(КолКартВПачке, corporation, ПолеВыбораТипКарты);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаКлиенте
Процедура КомандаОбновитьСписокКорпКарт(Команда)

	ДействиеАналитики = "ПолучениеДанныхПоКорпорациямИПоКартамАК";
	Объект.ДействиеАналитики = ДействиеАналитики;

	ПолучениеИнформацииПоКорпКартамНаСервере(КолКартВПачке, ПолеВыбораТипКарты, ПолеВыбораТипКарты);

	Элементы.КнопкаПоказатьВсеКарты.Видимость = Истина;
	Элементы.КнопкаСкрытьЗакрытыеИПросроченныеКарты.Видимость = Ложь;

	Если Не Объект.UnitТест Тогда
		ОбновитьСтатистикуРаботыНаСервере(КатегорияПоСобытиюНаСервере(), Объект.ДействиеАналитики)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеКорпКартыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ВыбратьКарту(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКарту(Элемент = Неопределено)

	Если Элемент = Неопределено Тогда
		corporation = "";
		branch = "";
		corpType = "";
		panNumber = "";
		НадписьВыбраннаяКарта = "";
		ЗаголовокВыбраннаяКорпКарта = "";
		ПодсказкаВыбраннаяКорпКарта = ""
	Иначе
		corporation = Элемент.ТекущиеДанные.corporation;
		branch = Элемент.ТекущиеДанные.branch;
		corpType = Элемент.ТекущиеДанные.corpType;
		panNumber = Элемент.ТекущиеДанные.panNumber;
		//MainCardNum = Элемент.ТекущиеДанные.MainCardNum;
		РазделительБК = ?(ЗначениеЗаполнено(branch) И ЗначениеЗаполнено(corporation), "-", "");
		НадписьВыбраннаяКарта = Элемент.ТекущиеДанные.КолонкаНомерКарты;//branch + РазделительБК + corporation;//НомерКарты
		ВыпискаПоГруппеКарт = ЗначениеЗаполнено(corpType) И Не ЗначениеЗаполнено(PanNumber);
		ЗаголовокВыбраннаяКорпКарта = ?(ВыпискаПоГруппеКарт, НСтр("ru='Группа';uk='Група'"), "Карта");
		ПодсказкаВыбраннаяКорпКарта = ?(ВыпискаПоГруппеКарт, НСтр("ru='Выбранная группа';uk='Обрана група'"), НСтр("ru='Выбранная карта';uk='Обрана карта'"));
		Объект.ТабличноеПолеВыписка.Очистить()
	КонецЕсли;
	Элементы.НадписьВыбраннаяКарта.Заголовок = ЗаголовокВыбраннаяКорпКарта;
	Элементы.НадписьВыбраннаяКарта1.Заголовок = ЗаголовокВыбраннаяКорпКарта;
	Элементы.НадписьВыбраннаяКарта.Подсказка = ПодсказкаВыбраннаяКорпКарта;
	Элементы.НадписьВыбраннаяКарта1.Подсказка = ПодсказкаВыбраннаяКорпКарта;
	//УстановитьВидимостьВыбранныеКартаГруппа()

КонецПроцедуры

// не используется 
&НаКлиенте
Процедура УстановитьВидимостьВыбранныеКартаГруппа()

	ВидимостьВыбранныхКартаГруппа = ЗначениеЗаполнено(НадписьВыбраннаяКарта);
	Элементы.НадписьВыбраннаяКарта.Видимость = ВидимостьВыбранныхКартаГруппа;
	Элементы.НадписьВыбраннаяКарта1.Видимость = ВидимостьВыбранныхКартаГруппа;

	УстановитьВидимостьВыбораТипаКарт()

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВыбораТипаКарт(ТекущаяСтраница = Неопределено)

	Если ТекущаяСтраница = Неопределено Тогда
		ТекущаяСтраница = Элементы.ГруппаСтраницыКорпКарт.ТекущаяСтраница.Имя
	КонецЕсли;
	ВыпискаПоГруппеКарт = ЗначениеЗаполнено(corpType) И Не ЗначениеЗаполнено(PanNumber);
	Если ТекущаяСтраница = Элементы.ГруппаСтраницыКорпКарт.ПодчиненныеЭлементы.ГруппаСтраницаКарты.Имя Или ТекущаяСтраница = 0
			Или (ТекущаяСтраница = Элементы.ГруппаСтраницыКорпКарт.ПодчиненныеЭлементы.ГруппаСтраницаВыписка.Имя Или ТекущаяСтраница = 1)
			И ВыпискаПоГруппеКарт И ЗначениеЗаполнено(НадписьВыбраннаяКарта) Тогда//.Имя
		ВидимостьВыбораТипаКарт = Истина
	Иначе
		ВидимостьВыбораТипаКарт = Ложь
	КонецЕсли;
	Элементы.ПолеВыбораТипКарты.Видимость = ВидимостьВыбораТипаКарт

КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьВсеКарты(Команда)

	ДействиеАналитики = "ПолучениеДанныхПоВсемКартамАК";
	Объект.ДействиеАналитики = ДействиеАналитики;

	ПолучениеИнформацииПоКорпКартамНаСервере(КолКартВПачке, corporation, ПолеВыбораТипКарты);

	Элементы.КнопкаПоказатьВсеКарты.Видимость = Ложь;
	Элементы.КнопкаСкрытьЗакрытыеИПросроченныеКарты.Видимость = Истина

КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьЗакрытыеИПросроченныеКарты(Команда)

	ДействиеАналитики = "ПолучениеДанныхСкрытьЗакрытыеИПросроченныеКартыАК";
	Объект.ДействиеАналитики = ДействиеАналитики;

	ПолучениеИнформацииПоКорпКартамНаСервере(КолКартВПачке, corporation, ПолеВыбораТипКарты);

	Элементы.КнопкаПоказатьВсеКарты.Видимость = Истина;
	Элементы.КнопкаСкрытьЗакрытыеИПросроченныеКарты.Видимость = Ложь

КонецПроцедуры

&НаСервере
Функция ПолучениеВыпискаПоКартамНаСервере(ВыпискаПоГруппеКарт, branch, corporation, corpType, ОтборПериодДатаНачала,
		ОтборПериодДатаОкончания, PanNumber)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	СтруктураОтвета = ОбработкаОбьект.ПолучениеВыпискаПоКартам(ВыпискаПоГруппеКарт, branch, corporation, corpType, ОтборПериодДатаНачала,
		ОтборПериодДатаОкончания, PanNumber);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат СтруктураОтвета

КонецФункции

&НаКлиенте
Процедура КомандаОбновитьВыпискаКорпКарты(Команда)

	Если Не ЗначениеЗаполнено(branch) Или Не ЗначениеЗаполнено(corporation) Тогда
		Если Не Объект.UnitТест Тогда
			ТекстСообщения = НСтр("ru='Выберите корпорацию или карту.';uk='Оберіть корпорацію або картку.'");
			СообщениеПользователю(ТекстСообщения, Ложь)
		КонецЕсли;
		Элементы.ГруппаСтраницыКорпКарт.ТекущаяСтраница = Элементы.ГруппаСтраницыКорпКарт.ПодчиненныеЭлементы.ГруппаСтраницаКарты;
		УстановитьВидимостьВыбораТипаКарт();
		Возврат
	КонецЕсли;

	ДействиеАналитики = "ВыпискаПоКартам";
	Объект.ДействиеАналитики = ДействиеАналитики;

	ВыпискаПоГруппеКарт = ЗначениеЗаполнено(corpType) И Не ЗначениеЗаполнено(PanNumber);
	ПолучениеВыпискаПоКартамНаСервере(ВыпискаПоГруппеКарт, branch, corporation, corpType, ОтборПериод.ДатаНачала,
		ОтборПериод.ДатаОкончания, PanNumber)

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЖурналКорпКарты(Команда)

	ДействиеАналитики = "ОтчетПоКартам";
	Объект.ДействиеАналитики = ДействиеАналитики;

	ПолучениеИнформацииПоКорпКартамНаСервере(КолКартВПачке, , ПолеВыбораТипКарты)

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКорпКартыНаСервере(ПолеВыбораТипКарты)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьКорпКарты(ПолеВыбораТипКарты);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораТипКартыПриИзменении(Элемент)

	Если Элементы.ГруппаСтраницыКорпКарт.ТекущаяСтраница = Элементы.ГруппаСтраницыКорпКарт.ПодчиненныеЭлементы.ГруппаСтраницаКарты Тогда
		Объект.ТабличноеПолеКорпКарты.Очистить();
		ЗаполнитьКорпКартыНаСервере(ПолеВыбораТипКарты)
	Иначе//Если Элементы.ГруппаСтраницыКорпКарт.ТекущаяСтраница = Элементы.ГруппаСтраницыКорпКарт.ПодчиненныеЭлементы.ГруппаСтраницаВыписка Тогда
		Объект.ТабличноеПолеВыписка.Очистить();
		ВыпискаПоГруппеКарт = ЗначениеЗаполнено(corpType) И Не ЗначениеЗаполнено(PanNumber);
		ПолучениеВыпискаПоКартамНаСервере(ВыпискаПоГруппеКарт, branch, corporation, corpType, ОтборПериод.ДатаНачала,
			ОтборПериод.ДатаОкончания, PanNumber)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НадписьВыбраннаяКартаОчистка(Элемент, СтандартнаяОбработка)

	НадписьВыбраннаяКарта = "";
	corporation = "";
	branch = "";
	panNumber = "";
	//MainCardNum = "";

	УстановитьЗаголовокВыбраннаяКартаПоУмолчанию()

КонецПроцедуры

&НаКлиенте
Процедура НадписьВыбраннаяКарта1Очистка(Элемент, СтандартнаяОбработка)

	НадписьВыбраннаяКарта = "";
	corporation = "";
	branch = "";
	panNumber = "";
	//MainCardNum = "";

	УстановитьЗаголовокВыбраннаяКартаПоУмолчанию()

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокВыбраннаяКартаПоУмолчанию()

	ЗаголовокВыбраннаяКорпКарта = НСтр("ru='Выбрана группа/карта';uk='Обрана група/картка'");
	Элементы.НадписьВыбраннаяКарта.Заголовок = ЗаголовокВыбраннаяКорпКарта;
	Элементы.НадписьВыбраннаяКарта1.Заголовок = ЗаголовокВыбраннаяКорпКарта

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыКорпКартПриСменеСтраницы(Элемент, ТекущаяСтраница)

	УстановитьВидимостьВыбораТипаКарт()

КонецПроцедуры

&НаКлиенте
Процедура ФлагСчетИзЗаказаПриИзменении(Элемент)

	ВидимостьТЧФинДокИсходящиеИмяДокумента();

	Если Объект.ФинансовыеДокументы.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Табличная часть с документами будет очищена. Продолжить?';uk='Таблична частина з документами буде очищена. Продовжити?'");
		сзКнопки = Новый СписокЗначений;
		сзКнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Да';uk='Так'"));
		сзКнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Нет';uk='Ні'"));
		ЗаголовокВопроса = НСтр("ru='';uk=''");
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОбновитьСчетИзЗаказа", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, сзКнопки,, КодВозвратаДиалога.Да, ЗаголовокВопроса)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьТЧФинДокИсходящиеИмяДокумента()

	Элементы.ТЧФинДокИсходящие.ПодчиненныеЭлементы.ТЧФинДокИсходящиеИмяДокумента.Видимость = 
		// если включен флаг ФлагСчетИзЗаказа
		(Объект.ФлагСчетИзЗаказа
			Или Найти(ВРег(МетаданныеИмяНаСервере()), ВРег("BASRent")) > 0 Или Найти(ВРег(МетаданныеИмяНаСервере()), ВРег("BASRentCORP")) > 0)
		И Элементы.РабочаяОбласть.Заголовок = НСтр("ru='Счета на оплату';uk='Рахунки на оплату'")
		И Элементы.ГруппаСписокФинДок.ТекущаяСтраница.Имя = Элементы.ГруппаСписокФинДок.ПодчиненныеЭлементы.ФинДокИсходящие.Имя

КонецПроцедуры

&НаСервере
Функция МетаданныеИмяНаСервере()

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ТекстОтвета = ОбработкаОбьект.МетаданныеИмя();
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат ТекстОтвета

КонецФункции

&НаКлиенте
Процедура ВопросОбновитьСчетИзЗаказа(Ответ, Параметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ФинансовыеДокументы.Очистить()
	КонецЕсли

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтатусыЭДО()

	//Статусы
	Объект.сзСтатусыЭДО.Очистить();
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Неизвестный статус';uk='Невідомий статус'"), НСтр("ru='Неизвестный статус';uk='Невідомий статус'"));//(0)

	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Черновик';uk='Чернетка'"), НСтр("ru='Черновик';uk='Чернетка'"));//1
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='В работе';uk='В роботі'"), НСтр("ru='В работе';uk='В роботі'"));//2
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Проверен и сохранен (в работе)';uk='Перевірений та збережений (в роботі)'"), НСтр("ru='Проверен и сохранен (в работе)';uk='Перевірений та збережений (в роботі)'"));//3
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Подписан и отправлен';uk='Підписаний та відправлений'"), НСтр("ru='Подписан и отправлен';uk='Підписаний та відправлений'"));//4//подписан отправителем
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru ='Принят контрагентом';uk = 'Прийнято контрагентом'"), НСтр("ru = 'Принят контрагентом';uk = 'Прийнято контрагентом'"));//5
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='В очереди на отправку в налоговую';uk='У черзі на відправку до податкової'"), НСтр("ru='В очереди на отправку в налоговую';uk='У черзі на відправку до податкової'"));//6//отправляется в налоговую
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Отправлен в налоговую';uk='Відправлений до податкової'"), НСтр("ru='Отправлен в налоговую';uk='Відправлений до податкової'"));//7
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Доставлен в налоговую';uk='Доставлений в податкову'"), НСтр("ru='Доставлен в налоговую';uk='Доставлений в податкову'"));//8//получен в налоговой
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Отклонен в налоговой';uk='Відхилено у податковій'"), НСтр("ru='Отклонен в налоговой';uk='Відхилено у податковій'"));//9
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Принят в налоговой';uk='Прийнято в податковій'"), НСтр("ru='Принят в налоговой';uk='Прийнято в податковій'"));//10
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru = 'Отклонен контрагентом';uk = 'Вiдхилен контрагентом'"), НСтр("ru = 'Отклонен контрагентом';uk = 'Вiдхилен контрагентом'"));//11
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru = 'Подписан получателем';uk = 'Підписаний отримувачем'"), НСтр("ru = 'Подписан получателем';uk = 'Підписаний отримувачем'"));//12//подписан контрагентом

	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Не выгружался';uk='Не вивантажувався'"), НСтр("ru='Не выгружался';uk='Не вивантажувався'"));//без номера//замена статуса 13

	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Отправлен без подписи';uk='Відправлений без підпису'"), НСтр("ru='Отправлен без подписи';uk='Відправлений без підпису'"));//14
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Утвержден получателем';uk='Затверджено одержувачем'"), НСтр("ru='Утвержден получателем';uk='Затверджено одержувачем'"));//15//утвержден (без подписи)
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Удален';uk='Видалений'"), НСтр("ru='Удален';uk='Видалений'"));//16//удален (не возвращается в журнал)
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Подготовлен к отправке в налоговую';uk='Підготовлено до відправки в податкову'"), НСтр("ru='Подготовлен к отправке в налоговую';uk='Підготовлено до відправки в податкову'"));//17
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Ожидает расшифровки';uk='Очікує розшифровки'"), НСтр("ru='Ожидает расшифровки';uk='Очікує розшифровки'"));//18//Документ зашифрован
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Расшифрован';uk='Розшифрований'"), НСтр("ru='Расшифрован';uk='Розшифрований'"));//19//Расшифрован (есть квитанция)
	//Объект.сзСтатусыЭДО.Добавить(НСтр("ru='';uk=''"), НСтр("ru='';uk=''"));//20
	//Объект.сзСтатусыЭДО.Добавить(НСтр("ru='';uk=''"), НСтр("ru='';uk=''"));//21
	Объект.сзСтатусыЭДО.Добавить(НСтр("ru='Подписан. Не отправлен';uk='Підписаний. Не відправлений'"), НСтр("ru='Подписан. Не отправлен';uk='Підписаний. Не відправлений'"));//22

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСтатусДокумента()

	Если Элементы.СтатусДокумента.СписокВыбора.Количество() = 0 Тогда
		ТекстВсеСтатусы = НСтр("ru='Все статусы';uk='Всі статуси'");
		Элементы.СтатусДокумента.СписокВыбора.Добавить(ТекстВсеСтатусы, ТекстВсеСтатусы);
		Если Не ЗначениеЗаполнено(Объект.СтатусДокумента) Тогда
			Объект.СтатусДокумента = Элементы.СтатусДокумента.СписокВыбора[0]
		КонецЕсли;
		Для каждого СтатусДок Из Объект.сзСтатусыЭДО Цикл
			Элементы.СтатусДокумента.СписокВыбора.Добавить(СтатусДок.Значение, СтатусДок.Представление)
		КонецЦикла
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)

	СтатусДокументаПриИзмененииНаСервере(Элементы.СтатусДокумента.СписокВыбора[0].Значение)

КонецПроцедуры

&НаСервере
Процедура СтатусДокументаПриИзмененииНаСервере(ЭлементыСтатусДокументаСписокВыбора0Значение)

	Объект.СписокДокументов.Загрузить(Объект.фСписокДокументов.Выгрузить());
	Объект.ФинансовыеДокументы.Загрузить(Объект.вФинансовыеДокументы.Выгрузить());
	Объект.СписокЭкспортаPDF.Загрузить(Объект.вСписокЭкспортаPDF.Выгрузить());

	Если Объект.СтатусДокумента = ЭлементыСтатусДокументаСписокВыбора0Значение Тогда
		//Все статусы
	Иначе
		//	отбор по статусу

		// налоговые
		сзУдаляемыеСтроки = Новый СписокЗначений;
		Для каждого СтрокаСпискаДокументов Из Объект.СписокДокументов Цикл
			Если СтрокаСпискаДокументов.СтатусДокумента <> Объект.СтатусДокумента Тогда
				сзУдаляемыеСтроки.Добавить(СтрокаСпискаДокументов)
			КонецЕсли
		КонецЦикла;
		Для каждого ЭлементСпискаУдаляемаяСтрока Из сзУдаляемыеСтроки Цикл
			Объект.СписокДокументов.Удалить(ЭлементСпискаУдаляемаяСтрока.Значение)
		КонецЦикла;

		// фин.док
		сзУдаляемыеСтроки = Новый СписокЗначений;
		Для каждого СтрокаСпискаДокументов Из Объект.ФинансовыеДокументы Цикл
			Если СтрокаСпискаДокументов.СтатусДокумента <> Объект.СтатусДокумента Тогда
				сзУдаляемыеСтроки.Добавить(СтрокаСпискаДокументов)
			КонецЕсли
		КонецЦикла;
		Для каждого ЭлементСпискаУдаляемаяСтрока Из сзУдаляемыеСтроки Цикл
			Объект.ФинансовыеДокументы.Удалить(ЭлементСпискаУдаляемаяСтрока.Значение)
		КонецЦикла;

		// документы PDF
		сзУдаляемыеСтроки = Новый СписокЗначений;
		Для каждого СтрокаСпискаДокументов Из Объект.СписокЭкспортаPDF Цикл
			Если СтрокаСпискаДокументов.СтатусДокумента <> Объект.СтатусДокумента Тогда
				сзУдаляемыеСтроки.Добавить(СтрокаСпискаДокументов)
			КонецЕсли
		КонецЦикла;
		Для каждого ЭлементСпискаУдаляемаяСтрока Из сзУдаляемыеСтроки Цикл
			Объект.СписокЭкспортаPDF.Удалить(ЭлементСпискаУдаляемаяСтрока.Значение)
		КонецЦикла
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаUnitТест(Команда)

	UnitТест()

КонецПроцедуры

&НаКлиенте
Процедура СерияПаспортаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	//СерияПаспорта
	ПроверкаТекстовогоПоля(Текст, 2);
	Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные.СерияПаспорта = Текст
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПаспортаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	//НомерПаспорта //"DGInom"
	ПроверкаЦифровогоПоля(Текст, 6);
	Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные.НомерПаспорта = Текст

КонецПроцедуры

&НаКлиенте
Процедура IDКартыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	//IDКарты //"DGInom"
	ПроверкаЦифровогоПоля(Текст, 9);
	Элементы.ЭкспортПлатежныеДокументы.ТекущиеДанные.IDКарты = Текст

КонецПроцедуры

&НаКлиенте
Функция ПроверкаЦифровогоПоля(Текст, ДлинаПоля = Неопределено)

	Если СтрДлина(Текст) > 0 Тогда
		ЕстьОшибки = Ложь;
		КолСпецСимволов = 0;
		Для i = 1 По СтрДлина(Текст) Цикл
			Если Найти("0123456789", ВРег(Сред(Текст, i, 1))) = 0 Тогда
				КолСпецСимволов = КолСпецСимволов + 1;
				Если КолСпецСимволов > 1 Тогда
					Прервать
				КонецЕсли
			КонецЕсли
		КонецЦикла;
		ТекстСообщенияСуффикс = НСтр("ru=' Должны использоваться только цифры.';uk=' Повинні використовуватись лише цифри.'");
		Если КолСпецСимволов > 1 Тогда
			ТекстСообщения = НСтр("ru='Есть запрещенные символы в поле.';uk='Є заборонені символи у полі.'");
			СообщениеПользователю(ТекстСообщения + ТекстСообщенияСуффикс, Ложь);
			ЕстьОшибки = Истина
		ИначеЕсли КолСпецСимволов > 0 Тогда
			ТекстСообщения = НСтр("ru='Есть запрещенный символ в поле.';uk='Є заборонений символ у полі.'");
			СообщениеПользователю(ТекстСообщения + ТекстСообщенияСуффикс, Ложь);
			ЕстьОшибки = Истина
		КонецЕсли;
		Если ДлинаПоля <> Неопределено И СтрДлина(Текст) < ДлинаПоля Тогда
			ТекстСообщения = НСтр("ru='Должно быть введено %Количество% символов.';uk='Повинно бути введено %Количество% символів.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", ДлинаПоля);
			СообщениеПользователю(ТекстСообщения, Ложь);
			ЕстьОшибки = Истина
		КонецЕсли;
		Если ЕстьОшибки Тогда
			Возврат Ложь
		КонецЕсли
	КонецЕсли

КонецФункции

&НаКлиенте
Функция ПроверкаТекстовогоПоля(Текст, ДлинаПоля = Неопределено)

	Если СтрДлина(Текст) > 0 Тогда
		ЕстьОшибки = Ложь;
		КолСпецСимволов = 0;
		Для i = 1 По СтрДлина(Текст) Цикл
			Если Найти("АБВГДЕЄЖЗІИЙКЛМНОПРСТУФХЧЦШЩЬЪЫЭЮЯ", ВРег(Сред(Текст, i, 1))) = 0 Тогда
				КолСпецСимволов = КолСпецСимволов + 1;
				Если КолСпецСимволов > 1 Тогда
					Прервать
				КонецЕсли
			КонецЕсли
		КонецЦикла;
		ТекстСообщенияСуффикс = НСтр("ru=' Должны использоваться только буквы кириллицы.';uk=' Повинні використовуватись лише літери кирилиці.'");
		Если КолСпецСимволов > 1 Тогда
			ТекстСообщения = НСтр("ru='Есть запрещенные символы в поле.';uk='Є заборонені символи у полі.'");
			СообщениеПользователю(ТекстСообщения + ТекстСообщенияСуффикс, Ложь);
			ЕстьОшибки = Истина
		ИначеЕсли КолСпецСимволов > 0 Тогда
			ТекстСообщения = НСтр("ru='Есть запрещенный символ в поле.';uk='Є заборонений символ у полі.'");
			СообщениеПользователю(ТекстСообщения + ТекстСообщенияСуффикс, Ложь);
			ЕстьОшибки = Истина
		КонецЕсли;
		Если ДлинаПоля <> Неопределено И СтрДлина(Текст) < ДлинаПоля Тогда
			ТекстСообщения = НСтр("ru='Должно быть введено %Количество% символов.';uk='Повинно бути введено %Количество% символів.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", ДлинаПоля);
			СообщениеПользователю(ТекстСообщения, Ложь);
			ЕстьОшибки = Истина
		КонецЕсли;
		Попытка
			Текст = ВРег(Текст)
		Исключение КонецПопытки;
		Если ЕстьОшибки Тогда
			Возврат Ложь
		КонецЕсли
	Иначе
		ТекстСообщения = НСтр("ru='Содержимое поля пусто.';uk='Вміст поля порожній.'");
		СообщениеПользователю(ТекстСообщения, Ложь)
	КонецЕсли;
	Возврат Истина

КонецФункции

&НаКлиенте
Процедура ЗарплатныеВедомостиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	//ПараметрыФормы = Новый Структура("РежимВыбора, ТекущаяСтрока, Отбор", Истина, Объект.СтавкаНДС, Новый Структура());
	Если Объект.ИдКонф = "UNF" Или Объект.ИдКонф = "BSB" Тогда
		//ОткрытьФорму("Документ.ПлатежнаяВедомость.ФормаВыбора")//, ПараметрыФормы)
	ИначеЕсли Найти(ВРег(Объект.ПолноеИмяКонфигурации), ВРег("БухгалтерияСельскохозяйственногоПредприятия")) > 0 
			ИЛИ Найти(ВРег(Объект.ПолноеИмяКонфигурации), ВРег("КомплексноеРешениеСельскохозяйственногоПредприятия")) > 0
			ИЛИ Найти(ВРег(Объект.ПолноеИмяКонфигурации), ВРег("BASАгроБухгалтерия")) > 0
			Или Найти(ВРег(Объект.ПолноеИмяКонфигурации), ВРег("BASБухгалтерияЭлеватораМельницыИКомбикормовогоЗавода")) > 0
			Тогда
		//Попытка
		//	ОткрытьФорму("Документ.ИНАГРО_ЗарплатаКВыплатеОрганизаций.ФормаВыбора")
		//Исключение
		//	// на случай отсутствия формы выбора
		//	ОткрытьФорму("Документ.ИНАГРО_ЗарплатаКВыплатеОрганизаций.ФормаСписка")
		//КонецПопытки
	ИначеЕсли Объект.ИдКонф = "BP" ИЛИ Объект.ИдКонф = "ERP" Или Объект.ИдКонф = "BASC" Тогда
		// нет формы выбора документа ВедомостьНаВыплатуЗарплатыВБанк в BP, BASC, ERP; форма списка вызывается штатно (BASC)
		Если Объект.ИдКонф = "BP" Тогда
			//ОткрытьФорму("Документ.ВедомостьНаВыплатуЗарплатыВБанк.ФормаВыбора")
		Иначе
			// BASCorp, ERP // нет формы выбора
			//ОткрытьФорму("Документ.ВедомостьНаВыплатуЗарплатыВБанк.ФормаСписка")
		КонецЕсли
	ИначеЕсли Найти("KUBU,UABY", Объект.ИдКонф) > 0 Тогда
		// нет формы выбора
		Попытка
			ОткрытьФорму("Документ.ВедомостьНаВыплатуЗарплатыПеречислением.ФормаВыбора")
		Исключение
			// на случай отсутствия формы выбора
			//ОткрытьФорму("Документ.ВедомостьНаВыплатуЗарплатыПеречислением.ФормаСписка")
		КонецПопытки
	ИначеЕсли Объект.ИдКонф = "BASR" Тогда
		// открывается стандартно // открывается с ошибкой
		//Попытка
		//	ОткрытьФорму("Документ.ЗарплатаКВыплатеОрганизаций.ФормаВыбора")
		//Исключение
		//	// на случай отсутствия формы выбора
		//	ОткрытьФорму("Документ.ЗарплатаКВыплатеОрганизаций.ФормаСписка")
		//КонецПопытки
	ИначеЕсли Объект.ИдКонф = "AAA" Тогда
		// нет формы выбора
		Попытка
			// на случай присутствия формы выбора
			ОткрытьФорму("Документ.ВыплатаЗарплаты.ФормаВыбора")
		Исключение
			//ОткрытьФорму("Документ.ВыплатаЗарплаты.ФормаСписка")
		КонецПопытки
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура РасчетныеЛисткиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		Элементы.РасчетныеЛистки.ТекущийЭлемент = Элементы.РасчетныеЛистки.ПодчиненныеЭлементы.РасчетныеЛисткиНомерСтроки;
		ТД = Элементы.РасчетныеЛистки.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			ОткрытьФормуВыбораДокумента(ТД, "ВыборРЛЗавершение")
		КонецЕсли
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВыборРЛЗавершение(СтуркутраВыбора, Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.РасчетныеЛистки.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
 	КонецЕсли;
	
	ТД.СсылкаНаДокумент = СтуркутраВыбора;
	
	ЗаполнитьСтрокуПоРЛ(ТД.СсылкаНаДокумент, ТД.НомерСтроки - 1)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоРЛ(Док, НомерСтроки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписокРасчетныхЛистков(ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);//, Док, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		Элементы.СписокДокументов.ТекущийЭлемент = Элементы.СписокДокументов.ПодчиненныеЭлементы.ГруппаСписокДокументовНомерСтроки.ПодчиненныеЭлементы.СписокДокументовНомерСтроки;
		ТД = Элементы.СписокДокументов.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТД.СсылкаНаДокумент) Тогда
			ОткрытьФормуВыбораДокумента(ТД, "ВыборННЗавершение")
		КонецЕсли
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВыборННЗавершение(СтуркутраВыбора, Параметры) Экспорт
	
	Если СтуркутраВыбора = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	ТД = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат
 	КонецЕсли;
	
	ТД.СсылкаНаДокумент = СтуркутраВыбора;

	Отборы = Новый Структура;
	Отборы.Вставить("ОтборПоЖурналу", ОтборПоЖурналу);
	Отборы.Вставить("ОтборПоВидуДок", ОтборПоВидуДок);

	ЗаполнитьСтрокуПоНН(Отборы, ТД.СсылкаНаДокумент, ТД.НомерСтроки - 1)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоНН(Отборы, Док, НомерСтроки)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ЗаполнитьСписок(Отборы, ОтборПериод.ДатаНачала, ОтборПериод.ДатаОкончания);//, Док, НомерСтроки);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьРегламентОтчеты(Команда)

	Попытка
		//	документ записан
		ОткрытьФорму("Документ.РегламентированныйОтчет.ФормаВыбораТестЗвит1С")
	Исключение
		//	документ записан
		ОткрытьФорму("Документ.РегламентированныйОтчет.ФормаВыбора")
	КонецПопытки

КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьНалоговые(Команда)

	Попытка
		//	документ записан
		ОткрытьФорму("Документ.НалоговаяНакладная.ФормаВыбора");
	Исключение
		//	документ записан
		ОткрытьФорму("Документ.НалоговаяНакладная.ФормаСписка")
	КонецПопытки
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуДокПриИзменении(Элемент)

	ЗаполнитьСписокДокументов("")

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЖурналуПриИзменении(Элемент)

	ЗаполнитьСписокДокументов("")

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИнтервалаДат()

	Если День(ДатаПоОткрытияМодуля) < День(ТекущаяДата()) Тогда
		ДатаОтбора = КонецДня(ТекущаяДата());
		СформироватьПредставлениеПериода();
		ДатаПоОткрытияМодуля = ТекущаяДата();
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыПроксиИзРеестраНаСервере()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ПолучитьПараметрыПроксиИзРеестра(Истина);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьПараметрыПрокси(Команда)

	ПолучитьПараметрыПроксиИзРеестраНаСервере()

КонецПроцедуры

&НаСервере
Функция ПолучитьКодВыбраннойОрганизацииНаСервере(ТекСтрокаОрганизация)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	КодКомпании = ОбработкаОбьект.ПолучитьКодВыбраннойОрганизации(ТекСтрокаОрганизация);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект");

	Возврат КодКомпании

КонецФункции

&НаКлиенте
Процедура ТокеныКомпанийПолеОрганизацияПриИзменении(Элемент)

	ТекСтрока = Элементы.ТокеныКомпаний.ТекущиеДанные;
	ТекСтрока.КодКомпании = ПолучитьКодВыбраннойОрганизацииНаСервере(ТекСтрока.Организация);
	ОбновитьОтображениеСтатуса(ОпределитьСостояниеАвторизовано())

КонецПроцедуры

// Возвращает Истина, если это ОС Linux на клиенте
&НаКлиенте
Функция ЭтоLinuxКлиент()

	Перем ЭтоLinuxКлиент;

	Попытка
		Выполнить("УстановитьПривилегированныйРежим(Истина)");
		Выполнить("ЭтоLinuxКлиент = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить(""ЭтоLinuxКлиент"")");
		Если ЭтоLinuxКлиент = Неопределено Тогда
			Возврат Ложь//Нет клиентского приложения
		КонецЕсли;
		Возврат ЭтоLinuxКлиент
	Исключение
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64
	КонецПопытки;

	Возврат ЭтоLinuxКлиент

КонецФункции

&НаСервере
Функция КнопкаИнфоОПодписиНаСервере(ТипДок)
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	КодКомпании = ОбработкаОбьект.ПолучитьИнформациюОПодписи(ТипДок);

КонецФункции

&НаКлиенте
Процедура КнопкаИнфоОПодписи(Команда)

	Если Команда.Имя = "ИнфоPDF" Тогда
		ТипДок = "PDFДокументы"
	Иначе
		ТипДок = Объект.ТекВидОперации
	КонецЕсли;
	КнопкаИнфоОПодписиНаСервере(ТипДок)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопироватьПлатеж(Команда)

	ТекущиеДанные = Элементы.ИмпортПлатежныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НоваяСтрокаИмпорт = Объект.ИмпортПлатежныеДокументы.Добавить();
		НоваяСтрокаИмпорт.Дата = ТекущиеДанные.Дата;
		НоваяСтрокаИмпорт.Валюта = ТекущиеДанные.Валюта;
		НоваяСтрокаИмпорт.ВидДокумента = ТекущиеДанные.ВидДокумента;
		НоваяСтрокаИмпорт.ВидОперации = ТекущиеДанные.ВидОперации;
		НоваяСтрокаИмпорт.БанковскийСчет = ТекущиеДанные.БанковскийСчет;
		НоваяСтрокаИмпорт.ДоговорКонтрагента = ТекущиеДанные.ДоговорКонтрагента;
		НоваяСтрокаИмпорт.ДокументРасчетов = ТекущиеДанные.ДокументРасчетов;
		НоваяСтрокаИмпорт.Контрагент = ТекущиеДанные.Контрагент;
		НоваяСтрокаИмпорт.ЛицевойСчет = ТекущиеДанные.ЛицевойСчет;
		НоваяСтрокаИмпорт.НазначениеПлатежа = ТекущиеДанные.НазначениеПлатежа;
		НоваяСтрокаИмпорт.НомерПлатежа = ТекущиеДанные.НомерПлатежа;
		НоваяСтрокаИмпорт.Организация = ТекущиеДанные.Организация;
		//НоваяСтрокаИмпорт.СсылкаНаДокумент = ТекущиеДанные.СсылкаНаДокумент;
		НоваяСтрокаИмпорт.СтавкаНДС = ТекущиеДанные.СтавкаНДС;
		НоваяСтрокаИмпорт.СуммаДокумента = ТекущиеДанные.СуммаДокумента;
		НоваяСтрокаИмпорт.СуммаНДС = ТекущиеДанные.СуммаНДС;
		НоваяСтрокаИмпорт.СуммаПриход = ТекущиеДанные.СуммаПриход;
		НоваяСтрокаИмпорт.СуммаРасход = ТекущиеДанные.СуммаРасход;
		НоваяСтрокаИмпорт.СчетКонтрагента = ТекущиеДанные.СчетКонтрагента
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция УдалитьПлатежНаСервере(ТекущиеДанныеНомерСтроки)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.ИмпортПлатежныеДокументы.Удалить(ТекущиеДанныеНомерСтроки - 1);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")

КонецФункции

&НаКлиенте
Процедура КомандаУдалитьПлатеж(Команда)

	ТекущиеДанные = Элементы.ИмпортПлатежныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанныеНомерСтроки = ТекущиеДанные.НомерСтроки;
		УдалитьПлатежНаСервере(ТекущиеДанныеНомерСтроки)
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция УдалитьНДНаСервере(ТекущиеДанныеНомерСтроки)

	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбьект.СписокДокументов.Удалить(ТекущиеДанныеНомерСтроки - 1);
	ЗначениеВРеквизитФормы(ОбработкаОбьект, "Объект")

КонецФункции

&НаКлиенте
Процедура КомандаУдалитьНалоговыйИсходящий(Команда)

	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанныеНомерСтроки = ТекущиеДанные.НомерСтроки;
		УдалитьНДНаСервере(ТекущиеДанныеНомерСтроки)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопироватьНалоговыйИсходящий(Команда)

	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НоваяСтрокаНД = Объект.СписокДокументов.Добавить();
		НоваяСтрокаНД.Дата = ТекущиеДанные.Дата;
		НоваяСтрокаНД.ВалютаДокумента = ТекущиеДанные.ВалютаДокумента;
		НоваяСтрокаНД.ВидДокумента = ТекущиеДанные.ВидДокумента;
		НоваяСтрокаНД.ВидОперации = ТекущиеДанные.ВидОперации;
		НоваяСтрокаНД.XML = ТекущиеДанные.XML;
		НоваяСтрокаНД.КодВидаДокумента = ТекущиеДанные.КодВидаДокумента;
		НоваяСтрокаНД.Комментарий = ТекущиеДанные.Комментарий;
		НоваяСтрокаНД.Контрагент = ТекущиеДанные.Контрагент;
		НоваяСтрокаНД.ВключенаВЕдиныйРеестрНалоговыхНакладных = ТекущиеДанные.ВключенаВЕдиныйРеестрНалоговыхНакладных;
		НоваяСтрокаНД.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = ТекущиеДанные.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
		НоваяСтрокаНД.ВходящийНомер = ТекущиеДанные.ВходящийНомер;
		НоваяСтрокаНД.Ответственный = ТекущиеДанные.Ответственный;
		//НоваяСтрокаНД.СсылкаНаДокумент = ТекущиеДанные.СсылкаНаДокумент;
		НоваяСтрокаНД.ПросроченоДней = ТекущиеДанные.ПросроченоДней;
		НоваяСтрокаНД.СуммаДокумента = ТекущиеДанные.СуммаДокумента
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаНалоговыеАЯ(Команда)

	ТекущаяКолонка = Элементы.ВходящиеНН.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокДокументов.Сортировать(Сред(ТекущаяКолонка.Имя, 11) + " Убыв")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаНалоговыеЯА(Команда)

	ТекущаяКолонка = Элементы.ВходящиеНН.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокДокументов.Сортировать(Сред(ТекущаяКолонка.Имя, 11) + " Возр")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаНалоговыеИсходящиеАЯ(Команда)

	ТекущаяКолонка = Элементы.СписокДокументов.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокДокументов.Сортировать(Сред(ТекущаяКолонка.Имя, 17) + " Убыв")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаНалоговыеИсходящиеЯА(Команда)

	ТекущаяКолонка = Элементы.СписокДокументов.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокДокументов.Сортировать(Сред(ТекущаяКолонка.Имя, 17) + " Возр")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаФинДокАЯ(Команда)

	ТекущаяКолонка = Элементы.ТЧФинДокИсходящие.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.ФинансовыеДокументы.Сортировать(Сред(ТекущаяКолонка.Имя, 18) + " Убыв")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаФинДокЯА(Команда)

	ТекущаяКолонка = Элементы.ТЧФинДокИсходящие.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.ФинансовыеДокументы.Сортировать(Сред(ТекущаяКолонка.Имя, 18) + " Возр")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаPDFДокументыАЯ(Команда)

	ТекущаяКолонка = Элементы.СписокPDFДокументы.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокЭкспортаPDF.Сортировать(Сред(ТекущаяКолонка.Имя, 19) + " Убыв")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаPDFДокументыЯА(Команда)

	ТекущаяКолонка = Элементы.СписокPDFДокументы.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокЭкспортаPDF.Сортировать(Сред(ТекущаяКолонка.Имя, 19) + " Возр")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаPaperLessАЯ(Команда)

	ТекущаяКолонка = Элементы.СписокЭкспортаPDF.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокЭкспортаPDF.Сортировать(Сред(ТекущаяКолонка.Имя, 18) + " Убыв")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КомандаСортировкаPaperLessЯА(Команда)

	ТекущаяКолонка = Элементы.СписокЭкспортаPDF.ТекущийЭлемент;
	Если ТекущаяКолонка <> Неопределено Тогда
		Объект.СписокЭкспортаPDF.Сортировать(Сред(ТекущаяКолонка.Имя, 18) + " Возр")
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТокеныКомпанийФлажокПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ТокеныКомпаний.ТекущиеДанные;
	Если ТекущиеДанные.Флажок Тогда
		Для каждого СтрокаТК Из Объект.ТокеныКомпаний Цикл
			Если СтрокаТК.НомерСтроки <> ТекущиеДанные.НомерСтроки Тогда
				СтрокаТК.Флажок = Ложь
			КонецЕсли
		КонецЦикла;
		Объект.Организация = ТекущиеДанные.Организация;
		ОрганизацияПриИзменении("")
	Иначе
		ТекущиеДанные.Флажок = Истина
	КонецЕсли

КонецПроцедуры

//-----------------------------------------------------

ВыполняетсяЗакрытие = Ложь;

// ЗП СтатусВедомостиЗП
Если Не ЗначениеЗаполнено(Объект.СтатусВедомостиЗП) Тогда
	СтатусВедомостиЗПВсе = НСтр("ru='Все пакеты';uk='Всі пакети'");
	Элементы.СтатусВедомостиЗП.СписокВыбора.Добавить(СтатусВедомостиЗПВсе, СтатусВедомостиЗПВсе);
	СтатусВедомостиЗПCохраненные = НСтр("ru='Cохраненные - пакеты, которые еще не утверждены и допускают редактирование';uk='Збереження - пакети, які ще не затверджені і допускають редагування'");
	Элементы.СтатусВедомостиЗП.СписокВыбора.Добавить(СтатусВедомостиЗПCохраненные, СтатусВедомостиЗПCохраненные);
	CохраненныеНаПодпись = НСтр("ru='На подпись - пакеты, которые может подписать клиент';uk='На підпис - пакети, які може підписати клієнт'");
	Элементы.СтатусВедомостиЗП.СписокВыбора.Добавить(CохраненныеНаПодпись, CохраненныеНаПодпись);
	CохраненныеОбработанные = НСтр("ru='Обработанные пакеты';uk='Оброблені пакети'");
	Элементы.СтатусВедомостиЗП.СписокВыбора.Добавить(CохраненныеОбработанные, CохраненныеОбработанные);
	CохраненныеЗабракованные = НСтр("ru='Забракованные пакеты';uk='Забраковані пакети'");
	Элементы.СтатусВедомостиЗП.СписокВыбора.Добавить(CохраненныеЗабракованные, CохраненныеЗабракованные);
	Объект.СтатусВедомостиЗП = СтатусВедомостиЗПВсе
КонецЕсли;

// ЗП ВидВыплатыЗП
Если Не ЗначениеЗаполнено(Объект.ВидВыплаты) Тогда
	ВидВыплатыЗП = НСтр("ru='Зарплатная выплата: выплата с целевым назначением: заработная плата, аванс, премия, больничные, стипендия и т.д.';uk='Зарплатна виплата: виплата з цільовим призначенням: заробітна плата, аванс, премія, лікарняні, стипендія і т.д.'");
	Элементы.ВидВыплаты.СписокВыбора.Добавить(ВидВыплатыЗП, ВидВыплатыЗП);
	ВидВыплатыМасВыпл = НСтр("ru='Массовая выплата: выплата с нецелевым назначением';uk='Масова виплата: виплата з нецільовим призначенням'");
	Элементы.ВидВыплаты.СписокВыбора.Добавить(ВидВыплатыМасВыпл, ВидВыплатыМасВыпл);
	Объект.ВидВыплаты = ВидВыплатыЗП
КонецЕсли;
