////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			
	        ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
			
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()
