
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеСайтаСтруктура = ПолучитьАдресСайта();
	Если ТипЗнч(ДанныеСайтаСтруктура) = Тип("Структура") 
		И ЗначениеЗаполнено(ДанныеСайтаСтруктура.УзелОбмена) Тогда
		
		ПараметрыОткрытия = Новый Структура("Ключ", ДанныеСайтаСтруктура.УзелОбмена);
		ОткрытьФорму("ПланОбмена.ОбменУправлениеНебольшойФирмойСайт.ФормаОбъекта", ПараметрыОткрытия);
	Иначе
		ОткрытьФорму("ПланОбмена.ОбменУправлениеНебольшойФирмойСайт.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСайта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСайта.АдресСайта КАК АдресСайта,
	|	ОбменУправлениеНебольшойФирмойСайт.Код КАК Код,
	|	ДанныеСайта.IDСайта КАК IDСайта,
	|	ДанныеСайта.URLАдминЗоны КАК URLАдминЗоны,
	|	ОбменУправлениеНебольшойФирмойСайт.Ссылка КАК УзелОбмена
	|ИЗ
	|	РегистрСведений.ДанныеСайта КАК ДанныеСайта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ОбменУправлениеНебольшойФирмойСайт КАК ОбменУправлениеНебольшойФирмойСайт
	|		ПО ДанныеСайта.IDСайта = ОбменУправлениеНебольшойФирмойСайт.Код
	|ГДЕ
	|	ДанныеСайта.IDСайта <> """"";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()<=1 Тогда
		Выборка.Следующий();
		Возврат Новый Структура("УзелОбмена", Выборка.УзелОбмена);
	КонецЕсли;
	
КонецФункции