#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция по СтавкеНДС определяет суффикс имени параметра табличного документа:
// фактически колонкку таблицы налоговой накладной 20%, 0%... где должна отображаться соответствующая сумма
//
Функция ОпределитьКолонкуТаблицы(ВалютаДокумента, СтавкаНДС=Неопределено)
	
	Если СтавкаНДС.Ставка = 0 И НЕ СтавкаНДС.НеОблагается Тогда
		Возврат "0";
	ИначеЕсли  СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
		Возврат "20";
	ИначеЕсли СтавкаНДС.Ставка = 7 Тогда
		Возврат "7";	
	Иначе
		Возврат "БезНДС";
	КонецЕсли;
	
КонецФункции // ОпределитьКолонкуТаблицы()

Функция ОпределитьКодСтавки(ИмяКолонки, ВРегВалюте)

	Если ИмяКолонки = "0" Тогда
		Если НЕ ВРегВалюте
			Тогда
			Возврат "901";//"0Эксп";
		Иначе       
			Возврат "902";//"0Укр";
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "БезНДС" Тогда
		Возврат "903";		
	ИначеЕсли ИмяКолонки = "7" Тогда
		Возврат "7";	
	Иначе
		Возврат "20";	
	КонецЕсли;	

КонецФункции // ОпределитьКодСтавки()

#Область ИнтерфейсПечати

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложени2КНалоговойНакладной_Приложение2";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной");
		
		Для Страница = 1 По 2 Цикл
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				ТабДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yy" );
			ОбластьМакета.Параметры.НомерНалоговойНакладной = НомерДокумента;
			
			// номер приложения при печати в виде дроби: N приложения/N налоговой
			ОбластьМакета.Параметры.Номер = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(ТекущийДокумент, Шапка.Префикс) + "/" + УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяНакладная, Шапка.Префикс);
			//ОбластьМакета.Параметры.НомерНалоговойНакладной = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяНакладная);
			КодЯзыкаПечать = "uk";
			
			СведенияОПродавце   = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			ОбластьМакета.Параметры.ТелефоныОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// налоговые реквизиты не указыватюся
				ИННОрганизации					= "ХХХХХХХХХХХХ";
				НомерСвидетельстваОрганизации	= "ХХХХХХХХХХХХ"	
			Иначе	
				ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			
			ОбластьМакета.Параметры.НомерСвидетельстваОрганизации = НомерСвидетельстваОрганизации;
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			Иначе
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			ОбластьМакета.Параметры.ТелефоныКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
			
			НомерСвидетельстваКонтрагента                         = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента) Тогда
				НомерСвидетельстваКонтрагента = "ХХХХХХХХХХХХ";
			КонецЕсли; 
			ОбластьМакета.Параметры.НомерСвидетельстваКонтрагента = НомерСвидетельстваКонтрагента;
			
			ИННКонтрагента                                        = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента) Тогда
				ИННКонтрагента = "ХХХХХХХХХХХХ";
			КонецЕсли; 
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				//Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				//	ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				//КонецЕсли;
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаКорректировки) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаКорректировки = Шапка.Дата;
				КонецЕсли;
				
				// номенклатура 
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// "обнулим" значения неиспользуемого типа корректировки 
				// колонки 5...8
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = "Х";
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = "Х";
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = "Х";
					ОбластьМакета.Параметры.Количество  		 = "Х";
				КонецЕсли;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма изменения базы НДС
				// колонки 9...11
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 		= "Х";
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0 		= "Х";
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС	= "Х";
				
				Колонка = "ИзменениеСуммыБезНДС" + ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				// колонки 12...15
				ОбластьМакета.Параметры.ИзменениеСуммыНДС_Плюс  = "Х";
				ОбластьМакета.Параметры.ИзменениеСуммыНДС_Минус = "Х";
				Если СтрокаТаблицы.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
					
					Если  СтрокаТаблицы.ИзменениеСуммыБезНДС >= 0 Тогда
						КолонкаКорректировокНОНК = "_Плюс";
					Иначе
						КолонкаКорректировокНОНК = "_Минус";
					КонецЕсли;
					
					ОбластьМакета.Параметры["ИзменениеСуммыНДС" + КолонкаКорректировокНОНК] = СтрокаТаблицы.ИзменениеСуммыНДС;
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.Дата  = Формат(Шапка.Дата, "ДФ=dd.MM.yy" );
			ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yy" );
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатнаяФорма()

Функция ПечатнаяФормаНалоговыйКодекс(МассивОбъектов, ОбъектыПечати)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2011";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2011";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2011");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложенияНалоговойНакладной
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		СимволДляПустыхПоказателей    	 = Константы.СимволПустыхПоказателейВНалоговойНакладной.Получить(); 
		ВыводитьНомерДоговораБезКлеточек = Константы.ВыводитьНомерДоговораБезКлеточек.Получить(); 
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
			
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
				ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				
				Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
					
					ОбластьМакета.Параметры.ВыдаетсяПокупателю = "Х";
					
				ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
					
					// это ошибка, может быть из-за того, что по изначальной накладной стоял такой тип причины
					ОбластьМакета.Параметры.ВыдаетсяПокупателю = "Х";
					
				Иначе
					
					// накладная остается у поставщика
					ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
					ОбластьМакета.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
					ОбластьМакета.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy" );
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			ТекНомерФилиалНалоговой = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложенияНалоговойНакладной) Тогда
				ТекНомерФилиалНалоговой	= "" + Шапка.СпецРежимНалогообложенияНалоговойНакладной + ТекНомерФилиалНалоговой; 
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиалНалоговой, Инд, 1);
			КонецЦикла;		
			
			// Номер
			ТекНомер = Прав("        " + СокрЛП(НомерДокумента), 8);
			Для Инд = 1 По 8 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
				ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;		
			КодЯзыкаПечать = "uk";
			СведенияОПродавце   = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Инд = 1;
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				
				ТекСимвол = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				
				Если ТекСимвол = "," Тогда
					// до первой запятой - один телефон
					Прервать;
				КонецЕсли;
				
				Если Найти("0123456789", ТекСимвол) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+Инд] = ТекСимвол;
				Если Инд = 10 Тогда
					Прервать;
				Иначе	
					Инд = Инд + 1;
				КонецЕсли;
			КонецЦикла;
			
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// налоговые реквизиты не указыватюся
				ИННОрганизации					= "0";
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			
		    ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			ОбластьМакета.Параметры["НомерСвидетельстваОрганизации"] = НомерСвидетельстваОрганизации;
			
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			Иначе
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			
			// телефон
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Инд = 1;
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				
				ТекСимвол = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
				
				Если ТекСимвол = "," Тогда
					// до первой запятой - один телефон
					Прервать;
				КонецЕсли;
				
				Если Найти("0123456789", ТекСимвол) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+Инд] = ТекСимвол;
				Если Инд = 10 Тогда
					Прервать;
				Иначе	
					Инд = Инд + 1;
				КонецЕсли;
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0000000000";
			КонецЕсли; 
			ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента"] = НомерСвидетельстваКонтрагента;
			
			ИННКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли;
		    ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
			Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
				Для Инд = 1 По 6 Цикл
					ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;
			Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
				ОбластьНомера = ОбластьМакета.Область("НомерДоговора1");	
				ОбластьНомера.Объединить();
				ОбластьНомера = ОбластьМакета.Область("НомерДоговора2");	
				ОбластьНомера.Объединить();
				ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
			КонецЕсли;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаКорректировки) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаКорректировки = Шапка.Дата;
				КонецЕсли;
				
				// номенклатура 
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// "обнулим" значения неиспользуемого типа корректировки 
				// колонки 5...8
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = СимволДляПустыхПоказателей;
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.Количество  		 = СимволДляПустыхПоказателей;
				КонецЕсли;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма изменения базы НДС
				// колонки 9...11
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 		= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0 		= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС	= СимволДляПустыхПоказателей;
				
				Колонка = "ИзменениеСуммыБезНДС" + ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			// итоговые строки
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			
			ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 		= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0 		= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.ИзменениеСуммыНДС			= СимволДляПустыхПоказателей;
			
			ТаблицаИтогов = ТаблицаНоменклатуры.Скопировать();
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС,ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				Колонка = "ИзменениеСуммыБезНДС"+ ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
			КонецЦикла;
			ТаблицаИтогов.Свернуть("", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				ОбластьМакета.Параметры.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
			КонецЦикла;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.Дата  = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy" );
			ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yyyy" );
			
			ОбластьМакета.Параметры.Номер  					 = СокрЛП(ТекНомер 		 + ?(ЗначениеЗаполнено(ТекНомерФилиал), "/" + ТекНомерФилиал, ""));
			ОбластьМакета.Параметры.НомерНалоговойНакладной  = СокрЛП(ТекНомерНалоговой + ?(ЗначениеЗаполнено(ТекНомерФилиалНалоговой), "/" + ТекНомерФилиалНалоговой, ""));
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаНалоговыйКодекс2012(МассивОбъектов, ОбъектыПечати, ИмяМакета = "Приложение2КНалоговойНакладной2012")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2012";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТекущийДокумент.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина
			  И ТекущийДокумент.ВключенаВЕдиныйРеестрНалоговыхНакладных = Ложь Тогда
		
			Сообщить(СтрШаблон(НСтр("ru = 'Документ ¤1¤ должна быть зарегистрирована в Едином реестре!
					                       |Нельзя выдавать покупателю печатный документ до регистрации в Едином реестре!'; uk = 'Документ ¤1¤ має бути зареєстрована у Єдиному реєстрі податкових накладних!
					                       |Не можна видавати покупцю друкований документ до реєстрації у Єдиному реєстрі!'")
										   , ТекущийДокумент)
				   , СтатусСообщения.ОченьВажное);			
		
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2012";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2012");
		Если ИмяМакета = "Приложение2КНалоговойНакладной2012Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2012Альбом");
			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложенияНалоговойНакладной,
		|	Приложение2.ВалютаДокумента КАК ВалютаДокумента1,
		|	Приложение2.Курс,
		|	Приложение2.Кратность
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		СимволДляПустыхПоказателей    	 = Константы.СимволПустыхПоказателейВНалоговойНакладной.Получить(); 
		ВыводитьНомерДоговораБезКлеточек = Константы.ВыводитьНомерДоговораБезКлеточек.Получить(); 
		ПечататьКодУКТВЭДБезПробелов = Константы.ПечататьКодУКТВЭДБезПробелов.Получить(); 
		ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной = Константы.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной.Получить(); 
		ПечататьДатыБезРазделителей = НЕ Константы.ПечататьДатыВНалоговыхНакладныхСРазделителями.Получить();
		ДополнитьНазваниеНомеромГТД = НЕ Константы.НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах.Получить();
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.ИзменениеЦеныБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеЦеныБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2
				И Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// печатаем в одном экземпляре
				Продолжить;
			КонецЕсли;
			
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
				
				ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				
				Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
					
					ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
					
				ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
					
					// это ошибка, может быть из-за того, что по изначальной накладной стоял такой тип причины
					ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
					
				Иначе
					
					// накладная остается у поставщика
					ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца = "Х";
					ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
					ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			КонецЕсли;
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy" );
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			ТекНомерФилиалНалоговой = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложенияНалоговойНакладной) Тогда
				ТекНомерФилиалНалоговой	= "" + Шапка.СпецРежимНалогообложенияНалоговойНакладной + ТекНомерФилиалНалоговой; 
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиалНалоговой, Инд, 1);
			КонецЦикла;		
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			ТекНомер = Прав("        " + СокрЛП(НомерДокумента), 8);
			Для Инд = 1 По 8 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
				ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;		
			КодЯзыкаПечать = "uk";
			СведенияОПродавце   = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Инд = 1;
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				
				ТекСимвол = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				
				Если ТекСимвол = "," Тогда
					// до первой запятой - один телефон
					Прервать;
				КонецЕсли;
				
				Если Найти("0123456789", ТекСимвол) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+Инд] = ТекСимвол;
				Если Инд = 10 Тогда
					Прервать;
				Иначе	
					Инд = Инд + 1;
				КонецЕсли;
			КонецЦикла;
			
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// налоговые реквизиты не указыватюся
				ИННОрганизации					= "300000000000";
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
		    ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			ОбластьМакета.Параметры["НомерСвидетельстваОрганизации"] = НомерСвидетельстваОрганизации;
			
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			Иначе
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			
			// телефон
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Инд = 1;
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				
				ТекСимвол = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
				
				Если ТекСимвол = "," Тогда
					// до первой запятой - один телефон
					Прервать;
				КонецЕсли;
				
				Если Найти("0123456789", ТекСимвол) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+Инд] = ТекСимвол;
				Если Инд = 10 Тогда
					Прервать;
				Иначе	
					Инд = Инд + 1;
				КонецЕсли;
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
			ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента"] = НомерСвидетельстваКонтрагента;
			
			ИННКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
		    ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);		
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		    ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			КонецЕсли;
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ПечататьКодУКТВЭДБезПробелов Тогда
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				КонецЕсли;
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаКорректировки) Тогда
					// укажем дату выписки накладной
					Если ПечататьДатыБезРазделителей Тогда
						ОбластьМакета.Параметры.ДатаКорректировки = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
					Иначе
						ОбластьМакета.Параметры.ДатаКорректировки = Шапка.Дата;
					КонецЕсли;    
				Иначе
					Если ПечататьДатыБезРазделителей Тогда
						ОбластьМакета.Параметры.ДатаКорректировки = Формат(СтрокаТаблицы.ДатаКорректировки, "ДФ=ddMMyyyy");
					Иначе	
						ОбластьМакета.Параметры.ДатаКорректировки = СтрокаТаблицы.ДатаКорректировки;
					КонецЕсли; 
				КонецЕсли;
				
				// номенклатура 
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
													 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "");
													 ;
				
				// "обнулим" значения неиспользуемого типа корректировки 
				// колонки 5...8
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = СимволДляПустыхПоказателей;
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.Количество  		 = СимволДляПустыхПоказателей;
				КонецЕсли;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма изменения базы НДС
				// колонки 9...11
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 		= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0 		= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС	= СимволДляПустыхПоказателей;
				
				Колонка = "ИзменениеСуммыБезНДС" + ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			// итоговые строки
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			
			ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 		= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0 		= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.ИзменениеСуммыНДС			= СимволДляПустыхПоказателей;
			
			ТаблицаИтогов = ТаблицаНоменклатуры.Скопировать();
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС,ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				Колонка = "ИзменениеСуммыБезНДС"+ ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
			КонецЦикла;
			ТаблицаИтогов.Свернуть("", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				ОбластьМакета.Параметры.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
			КонецЦикла;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.Дата  = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy" );
			ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yyyy" );
			
			ОбластьМакета.Параметры.Номер  					 = СокрЛП(ТекНомер 		 + ?(ЗначениеЗаполнено(ТекНомерФилиал), "/" + ТекНомерФилиал, ""));
			ОбластьМакета.Параметры.НомерНалоговойНакладной  = СокрЛП(ТекНомерНалоговой + ?(ЗначениеЗаполнено(ТекНомерФилиалНалоговой), "/" + ТекНомерФилиалНалоговой, ""));
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати, ИмяМакета = "Приложение2КНалоговойНакладной2014")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2014";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2014";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2014");
		Если ИмяМакета = "Приложение2КНалоговойНакладной2014Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2014Альбом");
			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение2.ВалютаДокумента КАК ВалютаДокумента1,
		|	Приложение2.Курс,
		|	Приложение2.Кратность,
		|	Приложение2.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ЭлектронныйДокумент,
		|	Приложение2.ДатаОплаты
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной = Константы.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной.Получить(); 
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.ИзменениеЦеныБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеЦеныБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		// определим параметры шапки документа
		
		//Дата налоговой
		ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
	
		// Номер налоговой
		ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
		
		// филиал/спецрежим налоговой
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";  //число  4 символа, без лидирующих нулей
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("        " + СокрЛП(НомерДокумента), 8);
		
		// номер договора
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
	
		// дата договора
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
		Иначе
			ТекДатаДоговора = "";
		КонецЕсли;
	
		//Дата оплаты
		ТекДатаОплаты = Формат(Шапка.ДатаОплаты, "ДФ=ddMMyyyy");
		
		КодЯзыкаПечать = "uk";
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "300000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				ИННКонтрагента 				  = "400000000000";
			КонецЕсли;
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			НомерСвидетельстваКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "400000000000";
			КонецЕсли; 
			
		КонецЕсли; 
		ИННКонтрагента 				  = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2 Тогда
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка 
					ИЛИ Шапка.ЭлектронныйДокумент Тогда
					// печатаем в одном экземпляре
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			// Выводим область оригинал/копия
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Шапка.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
			ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент 							 = Шапка.ЭлектронныйДокумент;
			Если Шапка.ЭлектронныйДокумент = Ложь Тогда
				Если Страница = 2 Тогда
					// копия - всегда остается у продавца
					ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца  = "Х";
					
				Иначе
					
					// оргинал
					Если  Шапка.ТипПричиныНевыдачиПокупателю = 0 ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
						
						// НН, для которой тип причины невыдачи - продажа ниже обычных цен выдается покупателю, вторая пара накладных (собстенно на превышение) - нет
						ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
						
					Иначе
						
						// накладная остается у поставщика
						ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
						ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
						ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    			= Сред(ТекНомерФилиал, Инд, 1);
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;		
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 8 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// название продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] =  Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			//ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента           = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента              = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН покупателя		
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
			
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаОплаты_"+Инд]    = Сред(ТекДатаОплаты, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			КонецЕсли;
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
			    ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = "";
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = "";
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = "";
					ОбластьМакета.Параметры.Количество  		 = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаКорректировки) Тогда
					
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаКорректировки = Шапка.Дата;
					
				КонецЕсли;
				
				// номенклатура 
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				Колонка = "ИзменениеСуммыБезНДС" + ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			// итоговые строки
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			
			ТаблицаИтогов = ТаблицаНоменклатуры.Скопировать();
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС,ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				Колонка = "ИзменениеСуммыБезНДС"+ ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
			КонецЦикла;
			ТаблицаИтогов.Свернуть("", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				ОбластьМакета.Параметры.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
			КонецЦикла;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			ОбластьМакета.Параметры.Дата  = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy" );
			ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yyyy" );
			
			ОбластьМакета.Параметры.Номер  					 = СокрЛП(ТекНомер 		    + ?(ЗначениеЗаполнено(ТекНомерФилиал), "/" + ТекНомерФилиал, ""));
			ОбластьМакета.Параметры.НомерНалоговойНакладной  = СокрЛП(ТекНомерНалоговой + ?(ЗначениеЗаполнено(ТекНомерФилиал), "/" + ТекНомерФилиал, ""));
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати, ИмяМакета = "Приложение2КНалоговойНакладной2014Мес12")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2014Мес12";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2014Мес12";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2014Мес12");
		Если ИмяМакета = "Приложение2КНалоговойНакладной2014Мес12Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2014Мес12Альбом");
			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.ПоставкаДипПредставительству КАК ПоставкаДипПредставительству,
		|	Приложение2.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение2.ВалютаДокумента КАК ВалютаДокумента1,
		|	Приложение2.Курс,
		|	Приложение2.Кратность,
		|	Приложение2.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ЭлектронныйДокумент,
		|	Приложение2.ДатаОплаты
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной = Константы.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной.Получить(); 
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.ИзменениеЦеныБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеЦеныБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		// определим параметры шапки документа
		
		//Дата налоговой
		ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
	
		// Номер налоговой
		ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
		
		// филиал/спецрежим налоговой
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";  //число  4 символа, без лидирующих нулей
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("        " + СокрЛП(НомерДокумента), 8);
		
		// номер договора
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
	
		// дата договора
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
		Иначе
			ТекДатаДоговора = "";
		КонецЕсли;
	
		//Дата оплаты
		ТекДатаОплаты = Формат(Шапка.ДатаОплаты, "ДФ=ddMMyyyy");
		
		КодЯзыкаПечать = "uk";
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "300000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				ИННКонтрагента 				  = "400000000000";
			КонецЕсли;
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			НомерСвидетельстваКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			Если  Шапка.ПоставкаДипПредставительству = Истина 
				И Шапка.ТипПричиныНевыдачиПокупателю <=2 Тогда
				
				ИННКонтрагента = "400000000000";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				// вместо адреса - просто страна нерезидента
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";

			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				     ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				
				ИННКонтрагента = "400000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			КонецЕсли;
			
		КонецЕсли; 
		ИННКонтрагента 				  = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2 Тогда
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка 
					ИЛИ Шапка.ЭлектронныйДокумент Тогда
					// печатаем в одном экземпляре
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			// Выводим область оригинал/копия
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Шапка.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
			ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент 							 = Шапка.ЭлектронныйДокумент;
			Если Шапка.ЭлектронныйДокумент = Ложь Тогда
				Если Страница = 2 Тогда
					// копия - всегда остается у продавца
					ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца  = "Х";
					
				Иначе
					
					// оргинал
					Если  Шапка.ТипПричиныНевыдачиПокупателю = 0 ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
						
						// НН, для которой тип причины невыдачи - продажа ниже обычных цен выдается покупателю, вторая пара накладных (собстенно на превышение) - нет
						ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
						
					Иначе
						
						// накладная остается у поставщика
						ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
						ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
						ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    			= Сред(ТекНомерФилиал, Инд, 1);
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;		
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 8 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// название продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] =  Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			//ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента           = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента              = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН покупателя		
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			КонецЕсли;
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
			    ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = "";
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = "";
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = "";
					ОбластьМакета.Параметры.Количество  		 = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаКорректировки) Тогда
					
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаКорректировки = Шапка.Дата;
					
				КонецЕсли;
				
				// номенклатура 
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				Колонка = "ИзменениеСуммыБезНДС" + ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			// итоговые строки
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			
			ТаблицаИтогов = ТаблицаНоменклатуры.Скопировать();
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС,ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				Колонка = "ИзменениеСуммыБезНДС"+ ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
			КонецЦикла;
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					ОбластьМакета.Параметры["ИзменениеСуммыНДС" + КолонкаДляСуммы] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					ОбластьМакета.Параметры["ИзменениеСуммыНДС" + КолонкаДляСуммы] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
				КонецЕсли;
				
			КонецЦикла;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			ОбластьМакета.Параметры.Дата  = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy" );
			ОбластьМакета.Параметры.ДатаНалоговойНакладной  = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=dd.MM.yyyy" );
			
			ОбластьМакета.Параметры.Номер  					 = СокрЛП(ТекНомер 		    + ?(ЗначениеЗаполнено(ТекНомерФилиал), "/" + ТекНомерФилиал, ""));
			ОбластьМакета.Параметры.НомерНалоговойНакладной  = СокрЛП(ТекНомерНалоговой + ?(ЗначениеЗаполнено(ТекНомерФилиал), "/" + ТекНомерФилиал, ""));
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати, ИмяМакета = "Приложение2КНалоговойНакладной2015")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2015";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2015";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2015");
		Если ИмяМакета = "Приложение2КНалоговойНакладной2015Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2015Альбом");
			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.ПоставкаДипПредставительству КАК ПоставкаДипПредставительству,
		|	Приложение2.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
	    |	Приложение2.Договор.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции, 
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение2.ВалютаДокумента КАК ВалютаДокумента1,
		|	Приложение2.Курс,
		|	Приложение2.Кратность,
		|	Приложение2.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.РегистрируетсяВЕРННПокупателем,
		|	Приложение2.ЭлектронныйДокумент,
		|	Приложение2.ДатаОплаты
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной = Константы.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной.Получить(); 
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.ИзменениеЦеныБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеЦеныБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		// определим параметры шапки документа
		
		//Дата налоговой
		ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
	
		// Номер налоговой
		ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
		
		// филиал/спецрежим налоговой
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("        " + СокрЛП(НомерДокумента), 8);
		
		// номер договора
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
	
		// дата договора
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
		Иначе
			ТекДатаДоговора = "";
		КонецЕсли;
	
		КодЯзыкаПечать = "uk";
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "500000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// остальные данные (телефон) не заполняется
			ТекТелефоныОрганизации = "";
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				ИННКонтрагента 				  = "400000000000";
			КонецЕсли;
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			НомерСвидетельстваКонтрагента   = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			ИННКонтрагента 				    = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
			Если  Шапка.ПоставкаДипПредставительству = Истина 
				И Шапка.ТипПричиныНевыдачиПокупателю <=2 Тогда
				
				ИННКонтрагента = "400000000000";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				// вместо адреса - просто страна нерезидента
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";

			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				     ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			КонецЕсли;
			
		КонецЕсли; 
		ИННКонтрагента 				  = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
			
			// Выводим область оригинал/копия
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			// П2 с отрицательной суммой, которые выдаются покупателю и которые выписанны к НН с датой после 01.01.2015 - регистрирует в ЕРНН покупатель
			Если Шапка.РегистрируетсяВЕРННПокупателем = Истина Тогда
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем = "Х";
			КонецЕсли;
			
			ОбластьМакетаЗаголовок.Параметры.СоглашениеОРазделеПродукции = ?(Шапка.СоглашениеОРазделеПродукции = Истина, "Х", "");
			
			// оргинал
			Если  Шапка.ТипПричиныНевыдачиПокупателю > 0 Тогда
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
				// такие П2, даже с отрицательной суммой регистрирует продавец
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем = "";
				
			КонецЕсли;
		
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    			= Сред(ТекНомерФилиал, Инд, 1);
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;		
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 8 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// название продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] =  Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			//ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента           = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента              = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН покупателя		
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			КонецЕсли;
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
			    ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = "";
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = "";
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = "";
					ОбластьМакета.Параметры.Количество  		 = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаКорректировки) Тогда
					
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаКорректировки = Шапка.Дата;
					
				КонецЕсли;
				
				// номенклатура 
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				Колонка = "ИзменениеСуммыБезНДС" + ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			// итоговые строки
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			
			ТаблицаИтогов = ТаблицаНоменклатуры.Скопировать();
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС,ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				Колонка = "ИзменениеСуммыБезНДС"+ ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
			КонецЦикла;
			ТаблицаИтогов.Свернуть("СтавкаНДС", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					ОбластьМакета.Параметры["ИзменениеСуммыНДС" + КолонкаДляСуммы] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					ОбластьМакета.Параметры["ИзменениеСуммыНДС" + КолонкаДляСуммы] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС, ,"0,00");
				КонецЕсли;
				
			КонецЦикла;
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати, ИмяМакета = "Приложение2КНалоговойНакладной2016", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2016";
	
	ПервыйДокумент = Истина;
		
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		
		ВРегВалюте = (ТекущийДокумент.ВалютаДокумента = ВалютаУчета);
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей = Новый Структура();
			СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G001");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
			
			Если     ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.НеНДСОперацииВозврат
				ИЛИ ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.НеНДСОперацииКорректировка Тогда
				// такие операции не предусматривают выписки налоговых накладных
				Возврат	СтруктураПоказателей;
			КонецЕсли;
			
		КонецЕсли;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2016";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2016");
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		Если ИмяМакета = "Приложение2КНалоговойНакладной2016Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2016Альбом");
			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.ПоставкаДипПредставительству КАК ПоставкаДипПредставительству,
		|	Приложение2.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика,
		|		Номенклатура.КодЛьготы,
		|		НомерСтрокиНН
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		НомерСтрокиНН
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
		|	Приложение2.Договор.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции,
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение2.ВалютаДокумента КАК ВалютаДокумента1,
		|	Приложение2.Курс,
		|	Приложение2.Кратность,
		|	Приложение2.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.РегистрируетсяВЕРННПокупателем,
		|	Приложение2.ЭлектронныйДокумент,
		|	Приложение2.ДатаОплаты,
		|	Приложение2.КтоВыписалНалоговуюНакладную.КодПоДРФО КАК ИННКтоВыписалНН,
		|	Приложение2.НалоговаяНакладная.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены КАК ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены,
		|	Приложение2.НалоговаяНакладная.Сводная КАК Сводная,
		|	Приложение2.НалоговаяНакладная.ВидОперации КАК ВидОперацииНалоговой
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		// получим "печатную форму" исходной НН для определения номера корректируемой строки
		СтруктураПоискаНомераСтрокиННПолная      = Новый Структура("Номенклатура,ЦенаБезНДС,ЕдиницаИзмеренияКод");
		СтруктураПоискаНомераСтрокиННСокращенная = Новый Структура("Номенклатура,ЦенаБезНДС");
		Попытка
			
			КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("НалоговаяНакладная");
			Документы.НалоговаяНакладная.Печать(ТекущийДокумент.НалоговаяНакладная, Новый Структура("ТолькоФормироватьСтруктуруПоказателейПечатнойФормы"), КоллекцияПечатныхФорм, Неопределено, Неопределено);
			ПечатнаяФормаНН 	= КоллекцияПечатныхФорм[0].ТабличныйДокумент.НалоговыйДокумент.R;
			
			Если ПечатнаяФормаНН.Колонки.Найти("G3S") = Неопределено Тогда
				ПечатнаяФормаНН.Колонки.Добавить("Номенклатура");
			Иначе	
				ПечатнаяФормаНН.Колонки.G3S.Имя = "Номенклатура";
			КонецЕсли;
			
			Если ПечатнаяФормаНН.Колонки.Найти("G105_2S") = Неопределено Тогда
				ПечатнаяФормаНН.Колонки.Добавить("ЕдиницаИзмеренияКод");
			Иначе	
				ПечатнаяФормаНН.Колонки.G105_2S.Имя = "ЕдиницаИзмеренияКод";
			КонецЕсли;
			
			Если ПечатнаяФормаНН.Колонки.Найти("G6") = Неопределено Тогда
				ПечатнаяФормаНН.Колонки.Добавить("ЦенаБезНДС");
			Иначе	
				ПечатнаяФормаНН.Колонки.G6.Имя = "ЦенаБезНДС";
			КонецЕсли;
			
		Исключение 
			ПечатнаяФормаНН = Новый ТаблицаЗначений;
			ПечатнаяФормаНН.Колонки.Добавить("Номенклатура");
			ПечатнаяФормаНН.Колонки.Добавить("ЕдиницаИзмеренияКод");
			ПечатнаяФормаНН.Колонки.Добавить("ЦенаБезНДС");
		КонецПопытки;
		
		ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной = Константы.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной.Получить(); 
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// Для служебныех целей понадобится исходная таблица
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.ИзменениеЦеныБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеЦеныБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		// определим параметры шапки документа
		
		//Дата налоговой
		ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
	
		// Номер налоговой
		ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
		
		// филиал/спецрежим налоговой
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";
		Если Шапка.ДатаНалоговойНакладной < '2016-04-01' Тогда
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;
		Иначе	
			ТекНомерФилиал = КодСпецРежима;
			Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				ТекНомерФилиал = "5";
			КонецЕсли;
		КонецЕсли;
		ТекНомерФилиалНалоговой  = ТекНомерФилиал;
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		
		// филиал/спецрежим
		КодСпецРежима    = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
			КодСпецРежима = "5";
		КонецЕсли;
		
		КодЯзыкаПечать = "uk";
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "500000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// остальные данные (телефон) не заполняется
			ТекТелефоныОрганизации = "";
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.УсловнаяПродажаВозврат
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				Если Шапка.Сводная = Истина Тогда
					ИННКонтрагента 	 = "600000000000";
				Иначе	
					ИННКонтрагента 	 = "400000000000";	
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			НомерСвидетельстваКонтрагента   = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			ИННКонтрагента 				    = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			Если Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
				
				ИННКонтрагента = "200000000000";

			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";

			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				     ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			КонецЕсли;
			
		КонецЕсли; 
		ИННКонтрагента 				  = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
			
			// Выводим область оригинал/копия
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			// П2 с отрицательной суммой, которые выдаются покупателю и которые выписанны к НН с датой после 01.01.2015 - регистрирует в ЕРНН покупатель
			Если Шапка.РегистрируетсяВЕРННПокупателем = Истина Тогда
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем = "Х";
			Иначе
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПродавцом = "Х";
			КонецЕсли;
			
			Если (    Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда
				  
				  ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
				  
			КонецЕсли;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииВозврат 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииКорректировка
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РозницаКонрагентуОсвобожденныеОперацииВозврат Тогда
			
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
			
			КонецЕсли;
			
			// оргинал
			Если  Шапка.ТипПричиныНевыдачиПокупателю > 0 Тогда
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
				// такие П2, даже с отрицательной суммой регистрирует продавец
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем = "";
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПродавцом   = "Х";
				
			КонецЕсли;
		
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиалНалоговой, Инд, 1);
			КонецЦикла;		
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
			
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			//ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента           = НазваниеКонтрагента;
			
			// ИНН покупателя		
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной вместе с итогами
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС, ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС), ВРегВалюте);
				Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					// данные не заполняются
				ИначеЕсли КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					ОбластьМакета.Параметры.ИзменениеСуммыНДС20    = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.ИзменениеСуммыБезНДС);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G9", СтрокаТаблицы.ИзменениеСуммыНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС7 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					ОбластьМакета.Параметры.ИзменениеСуммыНДС7    = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G111", СтрокаТаблицы.ИзменениеСуммыБезНДС);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G111", СтрокаТаблицы.ИзменениеСуммыНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0Укр = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R007G03", СтрокаТаблицы.ИзменениеСуммыБезНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0Эксп = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R006G03", СтрокаТаблицы.ИзменениеСуммыБезНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G11", СтрокаТаблицы.ИзменениеСуммыБезНДС);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ИтогНДС    = СтрокаТаблицы.ИзменениеСуммыНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИзменениеСуммыНДС  = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R001G03", ИтогНДС);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// рассчитаем поля для подвала заранее
			ПечЛьготаНДС = "";
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииВозврат
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииКорректировка
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РозницаКонрагентуОсвобожденныеОперацииВозврат Тогда
				
				// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
				ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
				ВремТаблица.Свернуть("КодЛьготы");
				Для каждого СтрокаТаблицы Из ВремТаблица Цикл
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
						ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
						ПечЛьготаНДС = Шапка.ЛьготаНДС;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN0", ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПродавцом);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",  ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("H03",      ОбластьМакетаЗаголовок.Параметры.Сводная);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",  ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	"");
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	"");
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODFILL",	Шапка.ДатаНалоговойНакладной);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODNUM",	Прав(ТекНомерНалоговой,7));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODNUM1",	Лев(ТекНомерФилиалНалоговой, 1));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODNUM2",	Сред(ТекНомерФилиалНалоговой, 2));
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
				
			КонецЕсли;
			
			// Выводим табличную часть
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
			    ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = "";
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = "";
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = "";
					ОбластьМакета.Параметры.Количество  		 = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = УчетНДССервер.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС), ВРегВалюте);
				
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииВозврат
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииКорректировка
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РозницаКонрагентуОсвобожденныеОперацииВозврат Тогда
					
					Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
						ОбластьМакета.Параметры.КодЛьготы = "99999999";
					КонецЕсли;
					
				Иначе
					
					ОбластьМакета.Параметры.КодЛьготы = "";	
					
				КонецЕсли;
				
				
				// определеним номер строки исходной НН
				Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.НомерСтрокиНН) Тогда
					ЗаполнитьЗначенияСвойств(СтруктураПоискаНомераСтрокиННПолная, ОбластьМакета.Параметры);
					СтруктураПоискаНомераСтрокиННПолная.ЦенаБезНДС = Окр(СтрокаТаблицы.ЦенаБезНДС,2);
					
					НайденныеСтроки = ПечатнаяФормаНН.НайтиСтроки(СтруктураПоискаНомераСтрокиННПолная);
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						ЗаполнитьЗначенияСвойств(СтруктураПоискаНомераСтрокиННСокращенная, ОбластьМакета.Параметры);
						СтруктураПоискаНомераСтрокиННСокращенная.ЦенаБезНДС = Окр(СтрокаТаблицы.ЦенаБезНДС,2);
						
						НайденныеСтроки = ПечатнаяФормаНН.НайтиСтроки(СтруктураПоискаНомераСтрокиННСокращенная);
					    Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьМакета.Параметры.НомерСтрокиНН = ПечатнаяФормаНН.Индекс(НайденныеСтроки[0]) + 1;
						КонецЕсли;
					Иначе	
						ОбластьМакета.Параметры.НомерСтрокиНН = ПечатнаяФормаНН.Индекс(НайденныеСтроки[0]) + 1;
					КонецЕсли;
				КонецЕсли;
				
				ДанныеОСумме = СтрокаТаблицы.ИзменениеСуммыБезНДС;
				
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					
					ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС = "";
					
					ДанныеОСумме = 0;
					
				ИначеЕсли Шапка.Сводная = Истина И Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.УсловнаяПродажаВозврат Тогда
					
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
					
					СтрокаСтруктуры.G001		= ОбластьМакета.Параметры.НомерСтрокиНН;
					СтрокаСтруктуры.G2S 		= ОбластьМакета.Параметры.Причина;
					
					СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					
					СтрокаСтруктуры.G5  = СтрокаТаблицы.ИзменениеКоличества;
					СтрокаСтруктуры.G6  = СтрокаТаблицы.ЦенаБезНДС;
					Если СтрокаСтруктуры.G5 = 0 Тогда
						СтрокаСтруктуры.G6  = 0;	
					КонецЕсли;
					
					СтрокаСтруктуры.G7  = СтрокаТаблицы.ИзменениеЦеныБезНДС;
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Количество;
					Если СтрокаСтруктуры.G7 = 0 Тогда
						СтрокаСтруктуры.G8  = 0;	
					КонецЕсли;
					
					СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
					СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
					СтрокаСтруктуры.G010  		= ДанныеОСумме;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2017(МассивОбъектов, ОбъектыПечати, ИмяМакета = "Приложение2КНалоговойНакладной2017", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоУслугам, ТаблицаПоОС;
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной2016";
	
	ПервыйДокумент = Истина;
		
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		
		ВРегВалюте = (ТекущийДокумент.ВалютаДокумента = ВалютаУчета);
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей = Новый Структура();
			СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G001");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G32");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G33");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G011");
			
			Если     ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.НеНДСОперацииВозврат
				ИЛИ ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.НеНДСОперацииКорректировка Тогда
				// такие операции не предусматривают выписки налоговых накладных
				Возврат	СтруктураПоказателей;
			КонецЕсли;
			
		КонецЕсли;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Приложение2КНалоговойНакладной2017";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Приложение2КНалоговойНакладной.ПФ_MXL_Приложение2КНалоговойНакладной2017Альбом");
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	    Макет.КодЯзыкаМакета = "ru";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Приложение2.Номер,
		|	Приложение2.Дата,
		|	Приложение2.ВидОперации,
		|	Приложение2.Контрагент,
		|	Приложение2.Организация,
		|	Приложение2.УсловиеПродажи,
		|	Приложение2.ФормаРасчетов,
		|	Приложение2.НалоговаяНакладная,
		|	Приложение2.НалоговаяНакладная.Дата КАК ДатаНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.Номер КАК НомерНалоговойНакладной,
		|	Приложение2.НалоговаяНакладная.ПоставкаДипПредставительству КАК ПоставкаДипПредставительству,
		|	Приложение2.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	Приложение2.ВалютаДокумента,
		|	Приложение2.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеЦены / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.ИзменениеСуммы / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.Запасы.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.Запасы.Сумма / (1 + Приложение2.Запасы.СтавкаНДС.Ставка / 100) / Приложение2.Запасы.Количество
		|			ИНАЧЕ Приложение2.Запасы.Сумма / Приложение2.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика,
		|		Номенклатура.КодЛьготы,
		|		НомерСтрокиНН,
		|		КодУКТВЭД.Вид КАК КодВид,
		|		КодУКТВЭД.КодСХДеятельности КАК КодСХ
		|	),
		|	Приложение2.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		1 КАК Количество,
		|		ИзменениеКоличества,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеЦены / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеЦены
		|		КОНЕЦ КАК ИзменениеЦеныБезНДС,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.ИзменениеСуммы / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.ИзменениеСуммы
		|		КОНЕЦ КАК ИзменениеСуммыБезНДС,
		|		ИзменениеСуммыНДС,
		|		Причина,
		|		ДатаКорректировки,
		|		ВЫБОР
		|			КОГДА Приложение2.СуммаВключаетНДС
		|				ТОГДА Приложение2.ОС.Сумма / (1 + Приложение2.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ Приложение2.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		СтавкаНДС,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		НомерСтрокиНН,
		|		КодУКТВЭД.Вид КАК КодВид,
		|		"""" КАК КодСХ
		|	),
		|	Приложение2.Организация.Префикс КАК Префикс,
		|	Приложение2.Дата КАК ДатаДокумента,
		|	Приложение2.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.ТипПричиныНевыдачиПокупателю,
		|	Приложение2.СпецРежимНалогообложения,
		|	Приложение2.Договор.НомерДоговора КАК НомерДоговора,
		|	Приложение2.Договор.ДатаДоговора КАК ДатаДоговора,
		|	Приложение2.Договор.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции,
		|	Приложение2.НалоговаяНакладная.СпецРежимНалогообложения КАК СпецРежимНалогообложения,
		|	Приложение2.ВалютаДокумента КАК ВалютаДокумента1,
		|	Приложение2.Курс,
		|	Приложение2.Кратность,
		|	Приложение2.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	Приложение2.РегистрируетсяВЕРННПокупателем,
		|	Приложение2.ЭлектронныйДокумент,
		|	Приложение2.ДатаОплаты,
		|	Приложение2.КтоВыписалНалоговуюНакладную.КодПоДРФО КАК ИННКтоВыписалНН,
		|	Приложение2.НалоговаяНакладная.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены КАК ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены,
		|	Приложение2.НалоговаяНакладная.Сводная КАК Сводная,
		|	Приложение2.НалоговаяНакладная.ВидОперации КАК ВидОперацииНалоговой
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2
		|ГДЕ
		|	Приложение2.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		// получим "печатную форму" исходной НН для определения номера корректируемой строки
		СтруктураПоискаНомераСтрокиННПолная      = Новый Структура("Номенклатура,ЦенаБезНДС,ЕдиницаИзмеренияКод");
		СтруктураПоискаНомераСтрокиННСокращенная = Новый Структура("Номенклатура,ЦенаБезНДС");
		Попытка
			
			КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("НалоговаяНакладная");
			Документы.НалоговаяНакладная.Печать(ТекущийДокумент.НалоговаяНакладная, Новый Структура("ТолькоФормироватьСтруктуруПоказателейПечатнойФормы"), КоллекцияПечатныхФорм, Неопределено, Неопределено);
			ПечатнаяФормаНН 	= КоллекцияПечатныхФорм[0].ТабличныйДокумент.НалоговыйДокумент.R;
			
			Если ПечатнаяФормаНН.Колонки.Найти("G3S") = Неопределено Тогда
				ПечатнаяФормаНН.Колонки.Добавить("Номенклатура");
			Иначе	
				ПечатнаяФормаНН.Колонки.G3S.Имя = "Номенклатура";
			КонецЕсли;
			
			Если ПечатнаяФормаНН.Колонки.Найти("G105_2S") = Неопределено Тогда
				ПечатнаяФормаНН.Колонки.Добавить("ЕдиницаИзмеренияКод");
			Иначе	
				ПечатнаяФормаНН.Колонки.G105_2S.Имя = "ЕдиницаИзмеренияКод";
			КонецЕсли;
			
			Если ПечатнаяФормаНН.Колонки.Найти("G6") = Неопределено Тогда
				ПечатнаяФормаНН.Колонки.Добавить("ЦенаБезНДС");
			Иначе	
				ПечатнаяФормаНН.Колонки.G6.Имя = "ЦенаБезНДС";
			КонецЕсли;
			
		Исключение 
			ПечатнаяФормаНН = Новый ТаблицаЗначений;
			ПечатнаяФормаНН.Колонки.Добавить("Номенклатура");
			ПечатнаяФормаНН.Колонки.Добавить("ЕдиницаИзмеренияКод");
			ПечатнаяФормаНН.Колонки.Добавить("ЦенаБезНДС");
		КонецПопытки;
		
		ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной = Константы.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной.Получить(); 
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			НомерНалоговой = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			НомерНалоговой = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерНалоговойНакладной, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// Для служебныех целей понадобится исходная таблица
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.ИзменениеЦеныБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеЦеныБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
																			
				Строка.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ИзменениеСуммыНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ИзменениеСуммыНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		// определим параметры шапки документа
		
		//Дата налоговой
		ТекДатаНалоговой = Формат(Шапка.ДатаНалоговойНакладной, "ДФ=ddMMyyyy");
	
		// Номер налоговой
		ТекНомерНалоговой = Прав("       " + СокрЛП(НомерНалоговой), 7);
		
		// филиал/спецрежим налоговой
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";
		Если Шапка.ДатаНалоговойНакладной < '2016-04-01' Тогда
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;
		Иначе	
			ТекНомерФилиал = КодСпецРежима;
			Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				ТекНомерФилиал = "5";
			КонецЕсли;
		КонецЕсли;
		ТекНомерФилиалНалоговой  = ТекНомерФилиал;
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		
		// филиал/спецрежим
		КодСпецРежима    = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
			КодСпецРежима = "5";
		КонецЕсли;
		
		КодЯзыкаПечать = "uk";
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "500000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// остальные данные (телефон) не заполняется
			ТекТелефоныОрганизации = "";
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.УсловнаяПродажаВозврат
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РаботыОтНерезидентаКорректировка Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				Если Шапка.Сводная = Истина Тогда
					ИННКонтрагента 	 = "600000000000";
				Иначе	
					ИННКонтрагента 	 = "400000000000";	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
			
			ИННКонтрагента 		= ИННОрганизации;
			НазваниеКонтрагента = НазваниеОрганизации;
			
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			НомерСвидетельстваКонтрагента   = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			ИННКонтрагента 				    = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			Если Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
				
				ИННКонтрагента = "200000000000";

			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";

			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				     ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			КонецЕсли;
			
		КонецЕсли; 
		ИННКонтрагента 				  = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
			
			// Выводим область оригинал/копия
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			// П2 с отрицательной суммой, которые выдаются покупателю и которые выписанны к НН с датой после 01.01.2015 - регистрирует в ЕРНН покупатель
			Если Шапка.РегистрируетсяВЕРННПокупателем = Истина Тогда
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем = "Х";
			Иначе
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПродавцом = "Х";
			КонецЕсли;
			
			Если (    Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
				  ИЛИ Шапка.ВидОперацииНалоговой = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда
				  
				  ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
				  
			КонецЕсли;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииВозврат 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииКорректировка
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РозницаКонрагентуОсвобожденныеОперацииВозврат Тогда
			
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
			
			КонецЕсли;
			
			// оргинал
			Если  Шапка.ТипПричиныНевыдачиПокупателю > 0 Тогда
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
				// такие П2, даже с отрицательной суммой регистрирует продавец
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем = "";
				ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПродавцом   = "Х";
				
			КонецЕсли;
		
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата налоговой
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(ТекДатаНалоговой, Инд, 1);
			КонецЦикла; 
			
			// Номер налоговой
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(ТекНомерНалоговой, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим налоговой
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиалНалоговой_"+Инд]    = Сред(ТекНомерФилиалНалоговой, Инд, 1);
			КонецЦикла;		
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
			
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			//ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента           = НазваниеКонтрагента;
			
			// ИНН покупателя		
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной вместе с итогами
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "ИзменениеСуммыБезНДС, ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(Шапка.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС), ВРегВалюте);
				Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					// данные не заполняются
				ИначеЕсли КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					ОбластьМакета.Параметры.ИзменениеСуммыНДС20    = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.ИзменениеСуммыБезНДС);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G9", СтрокаТаблицы.ИзменениеСуммыНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС7 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					ОбластьМакета.Параметры.ИзменениеСуммыНДС7    = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G111", СтрокаТаблицы.ИзменениеСуммыБезНДС);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G111", СтрокаТаблицы.ИзменениеСуммыНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0Укр = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R007G03", СтрокаТаблицы.ИзменениеСуммыБезНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС0Эксп = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R006G03", СтрокаТаблицы.ИзменениеСуммыБезНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДСБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G11", СтрокаТаблицы.ИзменениеСуммыБезНДС);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "ИзменениеСуммыНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ИтогНДС    = СтрокаТаблицы.ИзменениеСуммыНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИзменениеСуммыНДС  = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R001G03", ИтогНДС);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// рассчитаем поля для подвала заранее
			ПечЛьготаНДС = "";
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииВозврат
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииКорректировка
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РозницаКонрагентуОсвобожденныеОперацииВозврат Тогда
				
				// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
				ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
				ВремТаблица.Свернуть("КодЛьготы");
				Для каждого СтрокаТаблицы Из ВремТаблица Цикл
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
						ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
						ПечЛьготаНДС = Шапка.ЛьготаНДС;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN0", ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПродавцом);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",  ОбластьМакетаЗаголовок.Параметры.РегистрируетсяВЕРННПокупателем);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("H03",      ОбластьМакетаЗаголовок.Параметры.Сводная);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",  ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	"");
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	"");
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODFILL",	Шапка.ДатаНалоговойНакладной);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODNUM",	Прав(ТекНомерНалоговой,7));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODNUM1",	Лев(ТекНомерФилиалНалоговой, 1));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HPODNUM2",	Сред(ТекНомерФилиалНалоговой, 2));
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
				
			КонецЕсли;
			
			ДопТекст = "";
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				ДопТекст = " " + " (перевищення бази оподаткування, визначеної відповідно до статей 188 і 189 Податкового кодексу України, над фактичною ціною постачання)";	
			КонецЕсли;
			
			// Выводим табличную часть
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
			    ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				
				// Теперь заполним
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если СтрокаТаблицы.ИзменениеКоличества = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеКоличества  = "";
					ОбластьМакета.Параметры.ЦенаБезНДС  		 = "";
				КонецЕсли;
				Если СтрокаТаблицы.ИзменениеЦеныБезНДС = 0 Тогда
					ОбластьМакета.Параметры.ИзменениеЦеныБезНДС  = "";
					ОбластьМакета.Параметры.Количество  		 = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = УчетНДССервер.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				Если СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодУслуги Тогда
					ОбластьМакета.Параметры.КодДКПП   = ОбластьМакета.Параметры.КодУКТВЭД;	
					ОбластьМакета.Параметры.КодУКТВЭД = "";
				ИначеЕсли СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовараИмпортированного Тогда
					ОбластьМакета.Параметры.Импортированный = "X";
				КонецЕсли;
				Если НЕ КодСпецРежима = "2" Тогда
					ОбластьМакета.Параметры.КодСХ = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
				                                       + ДопТекст;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС), ВРегВалюте);
				
				ОбластьМакета.Параметры.ИзменениеСуммыБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.ИзменениеСуммыБезНДС, ,"0,00");
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииВозврат
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ОсвобожденныеОперацииКорректировка
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.РозницаКонрагентуОсвобожденныеОперацииВозврат Тогда
					
					Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
						ОбластьМакета.Параметры.КодЛьготы = "99999999";
					КонецЕсли;
					
				Иначе
					
					ОбластьМакета.Параметры.КодЛьготы = "";	
					
				КонецЕсли;
				
				
				// определеним номер строки исходной НН
				Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.НомерСтрокиНН) Тогда
					ЗаполнитьЗначенияСвойств(СтруктураПоискаНомераСтрокиННПолная, ОбластьМакета.Параметры);
					СтруктураПоискаНомераСтрокиННПолная.ЦенаБезНДС = Окр(СтрокаТаблицы.ЦенаБезНДС,2);
					
					НайденныеСтроки = ПечатнаяФормаНН.НайтиСтроки(СтруктураПоискаНомераСтрокиННПолная);
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						ЗаполнитьЗначенияСвойств(СтруктураПоискаНомераСтрокиННСокращенная, ОбластьМакета.Параметры);
						СтруктураПоискаНомераСтрокиННСокращенная.ЦенаБезНДС = Окр(СтрокаТаблицы.ЦенаБезНДС,2);
						
						НайденныеСтроки = ПечатнаяФормаНН.НайтиСтроки(СтруктураПоискаНомераСтрокиННСокращенная);
					    Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьМакета.Параметры.НомерСтрокиНН = ПечатнаяФормаНН.Индекс(НайденныеСтроки[0]) + 1;
						КонецЕсли;
					Иначе	
						ОбластьМакета.Параметры.НомерСтрокиНН = ПечатнаяФормаНН.Индекс(НайденныеСтроки[0]) + 1;
					КонецЕсли;
				КонецЕсли;
				
				ДанныеОСумме = СтрокаТаблицы.ИзменениеСуммыБезНДС;
				
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					
					ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.КодДКПП = "";
					ОбластьМакета.Параметры.Импортированный = "";
					ОбластьМакета.Параметры.КодСХ = "";
					ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					ОбластьМакета.Параметры.ИзменениеСуммыБезНДС = "";
					
					ДанныеОСумме = 0;
					
				ИначеЕсли Шапка.Сводная = Истина И Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.УсловнаяПродажаВозврат Тогда
					
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.КодДКПП = "";
					ОбластьМакета.Параметры.Импортированный = "";
					ОбластьМакета.Параметры.КодСХ = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					
				ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
					
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.КодДКПП = "";
					ОбластьМакета.Параметры.Импортированный = "";
					ОбластьМакета.Параметры.КодСХ = "";
					ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
					
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
					
					СтрокаСтруктуры.G001		= ОбластьМакета.Параметры.НомерСтрокиНН;
					СтрокаСтруктуры.G2S 		= ОбластьМакета.Параметры.Причина;
					
					СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
					СтрокаСтруктуры.G32  		= ОбластьМакета.Параметры.Импортированный;
					СтрокаСтруктуры.G33  		= ОбластьМакета.Параметры.КодДКПП;
					
					СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					
					СтрокаСтруктуры.G5  = СтрокаТаблицы.ИзменениеКоличества;
					СтрокаСтруктуры.G6  = СтрокаТаблицы.ЦенаБезНДС;
					Если СтрокаСтруктуры.G5 = 0 Тогда
						СтрокаСтруктуры.G6  = 0;	
					КонецЕсли;
					
					СтрокаСтруктуры.G7  = СтрокаТаблицы.ИзменениеЦеныБезНДС;
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Количество;
					Если СтрокаСтруктуры.G7 = 0 Тогда
						СтрокаСтруктуры.G8  = 0;	
					КонецЕсли;
					
					СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
					СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
					СтрокаСтруктуры.G010  		= ДанныеОСумме;
					СтрокаСтруктуры.G011  		= ОбластьМакета.Параметры.КодСХ;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
		    ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабДокумент);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции // ()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, 
	
	КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// РегламентированнаяОтчетность
	ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Ложь;
	Если  ТипЗнч(ПараметрыПечати) = Тип("Структура")
		И ПараметрыПечати.Свойство("ТолькоФормироватьСтруктуруПоказателейПечатнойФормы") Тогда
	
		ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина;
	
	КонецЕсли;
	// Конец РегламентированнаяОтчетность
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	ДатаВступленияВСилуПриказа1379 = Константы.ДатаВступленияВСилуПриказа1379.Получить();
	
    ДатаВступленияВСилуПриказа1307 = УчетНДССервер.ДатаВступленияВСилуПриказа1307();	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной") Тогда
		Если МассивОбъектов[0].Дата >= '20170316' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2017(МассивОбъектов, ОбъектыПечати, "Приложение2КНалоговойНакладной2017Альбом", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1307 Тогда						
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати, , ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= '20150101' Тогда						
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= '20141201' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= '20110110' И МассивОбъектов[0].Дата < ДатаВступленияВСилуПриказа1379 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1379 Тогда
			Если МассивОбъектов[0].Дата >= '20140301' Тогда
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати));
			Иначе
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс2012(МассивОбъектов, ОбъектыПечати));
			КонецЕсли;
		ИначеЕсли МассивОбъектов[0].Дата < '20110101' Тогда	
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		Иначе
			// в период с 01.01 по 09.01 когда новая форма не вступила в действие
			// оставляем возможность печатать документ по старой или по новой форме
			Если МассивОбъектов[0].ПечататьПоФормеПриказа969 Тогда
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФормаНалоговыйКодекс(МассивОбъектов, ОбъектыПечати));
			Иначе
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладной", "Приложение №2 к налоговой накладной", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладнойАльбом") Тогда
		Если МассивОбъектов[0].Дата >= '20170316' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладнойАльбом", "Приложение №2 к налоговой накладной (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2017(МассивОбъектов, ОбъектыПечати, "Приложение2КНалоговойНакладной2017Альбом", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1307 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладнойАльбом", "Приложение №2 к налоговой накладной (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати, "Приложение2КНалоговойНакладной2016Альбом", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= '20150101' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладнойАльбом", "Приложение №2 к налоговой накладной (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати, "Приложение2КНалоговойНакладной2015Альбом"));
		ИначеЕсли МассивОбъектов[0].Дата >= '20141201' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладнойАльбом", "Приложение №2 к налоговой накладной (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати, "Приложение2КНалоговойНакладной2014Мес12Альбом"));
		Иначе
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2КНалоговойНакладнойАльбом", "Приложение №2 к налоговой накладной (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати, "Приложение2КНалоговойНакладной2014Альбом"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2КНалоговойНакладной";
	КомандаПечати.Представление = НСтр("ru='Приложение №2 к налоговой накладной';uk='Додаток №2 до податкової накладної'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2КНалоговойНакладнойАльбом";
	КомандаПечати.Представление = НСтр("ru='Приложение №2 к налоговой накладной (альбом. ориент.)';uk='Додаток №2 до податкової накладної (альбом. орієнт.)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.Порядок = 4;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли