&НаКлиенте
Перем стРезультат, ДействиеЗакрытия;

&НаКлиенте
Процедура КомандаДа(Команда)

	ДействиеЗакрытия = "ОК";
	стРезультат.Вставить("Результат", ДействиеЗакрытия);
	стРезультат.Вставить("ИмяПроцедуры", ИмяПроцедуры);
	стРезультат.Вставить("ОтключитьОптимизациюПоВремениОстатки", ОтключитьОптимизациюПоВремениОстатки);
	Закрыть(стРезультат)

КонецПроцедуры

&НаКлиенте
Процедура КомандаНет(Команда)

	ДействиеЗакрытия = "Отмена";
	стРезультат.Вставить("Результат", ДействиеЗакрытия);
	стРезультат.Вставить("ИмяПроцедуры", ИмяПроцедуры);
	стРезультат.Вставить("ОтключитьОптимизациюПоВремениОстатки", ОтключитьОптимизациюПоВремениОстатки);
	Закрыть(стРезультат)

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ДействиеЗакрытия = "" Тогда
		стРезультат.Вставить("Результат", "Отмена");
		стРезультат.Вставить("ИмяПроцедуры", ИмяПроцедуры);
		стРезультат.Вставить("ОтключитьОптимизациюПоВремениОстатки", ОтключитьОптимизациюПоВремениОстатки);
		Закрыть(стРезультат)
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстПревышениеВремени = Параметры.ТекстПревышениеВремени;
	ИмяПроцедуры = Параметры.ИмяПроцедуры;
	ОтключитьОптимизациюПоВремениОстатки = Параметры.ОтключитьОптимизациюПоВремениОстатки

КонецПроцедуры

стРезультат = Новый Структура;
ДействиеЗакрытия = ""
