

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого СтрокаЗапасы Из Параметры.Запасы Цикл
		НоваяСтрокаЗапасы = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЗапасы, СтрокаЗапасы);
	КонецЦикла; 
	мОтборСтрокНоменклатуры = Новый ФиксированнаяСтруктура("Документ", Параметры.Документ);
	
	Документ  = Параметры.Документ;
	Элементы.Запасы.ОтборСтрок = мОтборСтрокНоменклатуры;
	ЭтаФорма.ИнфНадписьДокумент = Строка(Параметры.Документ);
	ЭтаФорма.ИнфНадписьРеквизитыДокумента = "Организация: "+Строка(Параметры.Организация)+ "  Контрагент: "+Строка(Параметры.Контрагент)+ "  Договор: "+Строка(Параметры.Договор);
КонецПроцедуры

&НаСервере
// Функция помещает результаты подбора в хранилище
Функция ЗаписатьЗапасыВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Запасы.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ЗаписатьЗапасыВХранилище());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ЗапасыФлаг" Тогда
		Если Объект.Запасы[ВыбраннаяСтрока].Флаг Тогда
			Объект.Запасы[ВыбраннаяСтрока].Флаг = Ложь;
			Объект.Запасы[ВыбраннаяСтрока].КоличествоВДокумент 	= 0;
			Объект.Запасы[ВыбраннаяСтрока].ВсегоВДокумент 		= 0;
			Объект.Запасы[ВыбраннаяСтрока].СуммаНДСВДокумент 	= 0;
			
		Иначе	
			Объект.Запасы[ВыбраннаяСтрока].Флаг = Истина;
			Объект.Запасы[ВыбраннаяСтрока].КоличествоВДокумент = Объект.Запасы[ВыбраннаяСтрока].Количество;
			Объект.Запасы[ВыбраннаяСтрока].ВсегоВДокумент = Объект.Запасы[ВыбраннаяСтрока].Всего;
			Объект.Запасы[ВыбраннаяСтрока].СуммаНДСВДокумент = Объект.Запасы[ВыбраннаяСтрока].СуммаНДС;
			
		КонецЕсли; 
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	мОтборСтрокНоменклатуры = Новый Структура("Документ", Документ);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(мОтборСтрокНоменклатуры);
	
	Для каждого Строка  Из НайденныеСтроки Цикл
		Строка.Флаг 	= Истина;
		Строка.КоличествоВДокумент = Строка.Количество;
		Строка.ВсегоВДокумент = Строка.Всего;
		Строка.СуммаНДСВДокумент = Строка.СуммаНДС;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтВсех(Команда)
	
	мОтборСтрокНоменклатуры = Новый Структура("Документ", Документ);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(мОтборСтрокНоменклатуры);
	
	Для каждого Строка  Из НайденныеСтроки Цикл
		Строка.Флаг 	= Ложь;
		Строка.КоличествоВДокумент 	= 0;
		Строка.ВсегоВДокумент 		= 0;
		Строка.СуммаНДСВДокумент 	= 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКодУКТВЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораНоменклатурыГТД(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКодУКТВЭДОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
	
		ТекущаяСтрокаТоваров = Элементы.Товары.ТекущиеДанные;
		Если НЕ ТекущаяСтрокаТоваров = Неопределено Тогда
			ТекущаяСтрокаТоваров.НомерГТД = ПолучитьРеквизитНоменклатурыГТДНаСервере(ВыбранноеЗначение, "НомерГТД");
		КонецЕсли;

		ВыбранноеЗначение = ПолучитьРеквизитНоменклатурыГТДНаСервере(ВыбранноеЗначение, "КодУКТВЭД");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораНоменклатурыГТД(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрокаТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыВыбора = Новый СписокЗначений();
	ВариантыВыбора.Добавить(Ложь,   НСтр("ru='Выбрать по данным номенклатуры';uk='Вибрати по даним номенклатури'"));
	ВариантыВыбора.Добавить(Истина, НСтр("ru='Произвольный выбор';uk='Довільний вибір'"));
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НачалоВыбораНоменклатурыГТДЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), ВариантыВыбора, Элемент, 0);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитНоменклатурыГТДНаСервере(Ссылка, ИмяРекзвизита)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРекзвизита);	

КонецФункции 

&НаКлиенте
Процедура НачалоВыбораНоменклатурыГТДЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Элемент = ДополнительныеПараметры.Элемент;
	
	РезультатВыбора = ВыбранныйЭлемент;
    
    Если РезультатВыбора = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
	ТекущаяСтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Если РезультатВыбора.Значение = Истина Тогда
		ПараметрыВыбора1 = Новый Структура("ТекущаяСтрока");
		Если ТекущаяСтрокаТоваров <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрокаТоваров.КодУКТВЭД) Тогда
			ПараметрыВыбора1.Вставить("ТекущаяСтрока", ТекущаяСтрокаТоваров.КодУКТВЭД);	
		КонецЕсли;  
		ОткрытьФорму("Справочник.КлассификаторУКТВЭД.Форма.ФормаВыбора", ПараметрыВыбора1, Элемент);
	Иначе
	    ДанныеСтроки = Новый Структура("КодУКТВЭД, НомерГТД, Номенклатура");
	    ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущаяСтрокаТоваров); 
	    ПараметрыВыбора1 = ЗаполнитьПараметрыВыбораНоменклатурыГТД(ДанныеСтроки);
		
		ОткрытьФорму("Справочник.НоменклатураГТД.Форма.ФормаВыбора", ПараметрыВыбора1, Элемент);
	КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьПараметрыВыбораНоменклатурыГТД(ТекущаяСтрокаТоваров)
	
	Параметры = Новый Структура("Отбор, ТекущаяСтрока");
	
	Параметры.Отбор = Новый Структура("Владелец", ТекущаяСтрокаТоваров.Номенклатура); 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("КодУКТВЭД", ТекущаяСтрокаТоваров.КодУКТВЭД);
	Запрос.УстановитьПараметр("НомерГТД",  ТекущаяСтрокаТоваров.НомерГТД);
	Запрос.УстановитьПараметр("Владелец",  ТекущаяСтрокаТоваров.Номенклатура);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	НоменклатураГТД.Ссылка
	               |ИЗ
	               |	Справочник.НоменклатураГТД КАК НоменклатураГТД
	               |ГДЕ
	               |	НоменклатураГТД.КодУКТВЭД  = &КодУКТВЭД
	               |	И НоменклатураГТД.НомерГТД = &НомерГТД
	               |	И НоменклатураГТД.Владелец = &Владелец";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Параметры.ТекущаяСтрока = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Параметры; 
	
КонецФункции
