////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик команды СправочникОрганизации.
//
&НаКлиенте
Процедура СправочникПодключаемоеОборудование(Команда)
	
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Данные еще не записаны! Переход к редактированию справочника ""Организации"" возможен только после записи данных!';uk='Дані ще не записані! Перехід до редагування довідника ""Організації"" можливий тільки після запису даних!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка");
	
КонецПроцедуры // СправочникОрганизации()

&НаКлиенте
Процедура ОткрытьПравилаОбменаСПодключаемымОборудованием(Команда)
	
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ТекстСообщения = НСтр("ru='Данные еще не записаны! Переход к настройкам возможен только после записи данных! Записать?';uk='Дані ще не записані! Перехід до налаштувань можливий тільки після запису даних! Записати?'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьПравилаОбменаСПодключаемымОборудованиемЗавершение", ЭтотОбъект), ТекстСообщения, Режим, 0);
        Возврат;
	КонецЕсли;
	
	ОткрытьПравилаОбменаСПодключаемымОборудованиемФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравилаОбменаСПодключаемымОборудованиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Записать();
    Иначе
        Возврат;
    КонецЕсли;
    
    ОткрытьПравилаОбменаСПодключаемымОборудованиемФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравилаОбменаСПодключаемымОборудованиемФрагмент()
    
    ОбновитьИнтерфейс();
    ОткрытьФорму("Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline.ФормаСписка", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочиеМеста(Команда)
	
	ОткрытьФорму("Справочник.РабочиеМеста.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОткрытьПравилаОбменаСПодключаемымОборудованием.Доступность = НаборКонстант.ИспользоватьОбменСПодключаемымОборудованиемOffline;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПослеЗаписи формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры // ПослеЗаписи()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура ФункциональнаяОпцияИспользоватьОбменСПодключаемымОборудованиемOfflineПриИзменении(Элемент)
	
	Элементы.ОткрытьПравилаОбменаСПодключаемымОборудованием.Доступность = НаборКонстант.ИспользоватьОбменСПодключаемымОборудованиемOffline;
	
КонецПроцедуры

