
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерийныеНомера.Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование = &Наименование
		// Гунько 2020-04-14
		//|	И СерийныеНомера.Владелец = &Владелец";
		|";
		
		//Запрос.УстановитьПараметр("Владелец", Владелец);
		// ...Гунько 2020-04-14
		Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Отказ = Истина;
			
			// Гунько 2020-04-14
			//ТекстСообщения = НСтр("ru='У номенклатуры %1% уже введен серийный номер %2%';uk='У номенклатури %1% вже введений серійний номер %2%'");
			//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", Владелец);
			ТекстСообщения = НСтр("ru='Уже введен серийный номер %2%';uk='Вже введений серійний номер %2%'");
			// ...Гунько 2020-04-14
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2%", СокрЛП(Наименование));
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнтеграцияГИСМВызовСервера.ЭтоНомерКиЗ(Наименование) Тогда
		НомерКиЗГИСМ =Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
