#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ИспользоватьСравнение = Истина;
	НастройкиОтчета.ИспользоватьПериодичность = Ложь;
	
	НастройкиОтчета.ДополнительныеГруппировкиСтрок.Добавить("Регистратор");
	
	НастройкиВариантов["Ведомость"].Вставить("РежимПериода", "ЗаПериод");
	НастройкиВариантов["ВедомостьКратко"].Вставить("РежимПериода", "ЗаПериод");
	
	НастройкиВариантов["Остатки"].Вставить("РежимПериода", "НаДату");
	НастройкиВариантов["Остатки"].Вставить("ТолькоРесурсыОстатков", Истина);
	
	НастройкиВариантов["ВедомостьКраткоКонтекст"].Рекомендуемый = Истина;
	НастройкиВариантов["ВедомостьКраткоКонтекст"].Вставить("УровеньГруппировкиСтрок", 3);
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

Процедура ПриКонтекстномОткрытии(Объект, ПолеСвязи, Отборы) Экспорт
	
	Если ПолеСвязи = "Контрагент" Тогда
		Контрагент = Объект.Контрагент;
		Отборы.Вставить(ПолеСвязи, Контрагент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ОбработатьСхемуМультивалютногоОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолейСумм = Новый Массив;
	Для каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если НЕ ДоступноеПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		ИмяПоля = Строка(ДоступноеПоле.Поле);
		МассивПолейСумм.Добавить(ИмяПоля);
	КонецЦикла; 
	
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияСумм(ВариантыОформления, МассивПолейСумм);
			
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Ведомость"].Теги = НСТР("ru='Взаиморасчеты,Долги,Авансы,Контрагенты,Покупатели,Поставщики';uk='Взаєморозрахунки,Борги,Аванси,Контрагенти,Покупці,Постачальники'");
	НастройкиВариантов["ВедомостьКратко"].Теги = НСТР("ru='Взаиморасчеты,Долги,Авансы,Контрагенты,Покупатели,Поставщики';uk='Взаєморозрахунки,Борги,Аванси,Контрагенти,Покупці,Постачальники'");
	НастройкиВариантов["Остатки"].Теги = НСТР("ru='Взаиморасчеты,Долги,Авансы,Контрагенты,Покупатели,Поставщики';uk='Взаєморозрахунки,Борги,Аванси,Контрагенти,Покупці,Постачальники'");
	НастройкиВариантов["ВедомостьКраткоКонтекст"].Теги = НСТР("ru='Взаиморасчеты,Долги,Авансы,Контрагенты,Покупатели,Поставщики,Валюты';uk='Взаєморозрахунки,Борги,Аванси,Контрагенти,Покупці,Постачальники,Валюти'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты",,, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.РасходнаяНакладная",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ОтчетКомиссионера",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ПриходнаяНакладная",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.АктВыполненныхРабот",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.РасходСоСчета",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ОтчетОПереработке",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ПоступлениеВКассу",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ЗаказПокупателя",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.СчетНаОплату",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ОтчетПереработчика",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ОтчетКомитенту",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.РасходИзКассы",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ЗаказПоставщику",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ПоступлениеНаСчет",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.СчетНаОплатуПоставщика",, Истина, Истина);
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ВедомостьКраткоКонтекст"].СвязанныеПоля, "Контрагент", "Документ.ДополнительныеРасходы",, Истина, Истина);
	
КонецПроцедуры

#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли