#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Применяется Тогда
			Запись.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КодВычета,"Наименование");
		Иначе
				Запись.Представление =  НСтр("ru='Стандартный личный вычет не применяется';uk='Стандартне особисте відрахування не застосовується'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли