Перем ИзменилсяКод;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	// необходимо перезаписать (пререзаполнить наименования и реквизиты) в справочнике НоменклатураГТД, если изменился код справочника
	Если ИзменилсяКод Тогда
	
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураГТД.Ссылка
		               |ИЗ
		               |	Справочник.НоменклатураГТД КАК НоменклатураГТД
		               |ГДЕ
		               |	НоменклатураГТД.НомерГТД = &Ссылка";
					   
		СообщениеОбОшибкеВыдавалось = Ложь;
		
		Выборка = Запрос.Выполнить().Выбрать();				   
		Пока Выборка.Следующий() Цикл
		
			Спр = Выборка.Ссылка.ПолучитьОбъект();
			Спр.ОбменДанными.Загрузка = Истина;
			Попытка
			    Спр.Записать();
			Исключение
				
				Если СообщениеОбОшибкеВыдавалось = Ложь Тогда
					Сообщить("Не удалось обновить данные справочника Номенклатура ГТД. Отображение Номера ГТД в списке и в наименовании этого справочника может быть не правильным!", СтатусСообщения.Внимание);
					СообщениеОбОшибкеВыдавалось = Истина;
				КонецЕсли;
				
			КонецПопытки;
		
		КонецЦикла;
	
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	ИзменилсяКод = Ссылка.Код <> Код;
	
КонецПроцедуры
