////////////////////////////////////////////////////////////////////////////////
// Поиск и создание документов (УНФ)

Функция ПолучитьДанныеСтрокиТЧ(ДанныеЗаполнения, ДеревоРазбора) Экспорт
	
	РеквизитыИБ			 		= Новый Структура;
	РеквизитыИБКонтрагента 		= Новый Структура;
	ДанныеДляЗаполненияСтрокиТЧ = Новый Структура();
	
	ДанныеДляЗаполненияСтрокиТЧ.Вставить("Количество", 0);
	ДанныеДляЗаполненияСтрокиТЧ.Вставить("Цена", 0);
	ДанныеДляЗаполненияСтрокиТЧ.Вставить("Сумма", 0);
	ДанныеДляЗаполненияСтрокиТЧ.Вставить("СуммаСНДС", 0);
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения Цикл
		
		ИмяРеквизитаВБД = ТекСтрока.Реквизит;
		
		Если ВРег(ИмяРеквизитаВБД) = ВРег("Мест") Тогда
			ИмяРеквизитаВБД = "КоличествоМест";
		ИначеЕсли ВРег(ИмяРеквизитаВБД) = ВРег("Описание") Тогда
			ИмяРеквизитаВБД = "Содержание";
		ИначеЕсли Найти(ИмяРеквизитаВБД, "ДоКорректировки") <> 0 Тогда
			ИмяРеквизитаВБД = СтрЗаменить(ИмяРеквизитаВБД, "ДоКорректировки", "ДоИзменения");
		КонецЕсли;
		
		Если ВРег(ИмяРеквизитаВБД) = ВРег("Описание") Тогда
			ИмяРеквизитаВБД = "Содержание";
		КонецЕсли;
		
		НайденноеЗначение = ПолучитьЗначениеРеквизита(ТекСтрока, ТекСтрока.Реквизит, Истина, ДеревоРазбора);
		
		//Если номер заказа, нужно искать ссылку на документ
		Если ВРег(ИмяРеквизитаВБД) = ВРег("НомерПоДаннымПоставщика")
			И НЕ ПустаяСтрока(НайденноеЗначение) Тогда
			РеквизитыИБКонтрагента.Вставить("НомерПоДаннымПоставщика", НайденноеЗначение);
		КонецЕсли;
		
		Если ВРег(ИмяРеквизитаВБД) = ВРег("НомерЗаказаПоДаннымПокупателя")
			И НЕ ПустаяСтрока(НайденноеЗначение) Тогда
			РеквизитыИБ.Вставить("Номер", НайденноеЗначение);
		КонецЕсли;
		
		ДанныеДляЗаполненияСтрокиТЧ.Вставить(ИмяРеквизитаВБД, НайденноеЗначение);
		
		Если ТекСтрока.Реквизит = "Номенклатура" И ЗначениеЗаполнено(НайденноеЗначение) Тогда
			
			ТекНоменклатура = НайденноеЗначение;
			
			СтрокаНоменклатура = ДеревоРазбора.Строки.Найти(ТекСтрока.ЗначениеРеквизита,"ИндексСтроки",Истина);
			НайденноеЗначение = ПолучитьЗначениеРеквизита(СтрокаНоменклатура, "ЕдиницаИзмерения", Истина, ДеревоРазбора);
			Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
				ДанныеДляЗаполненияСтрокиТЧ.Вставить("ЕдиницаИзмерения", НайденноеЗначение);
			Иначе
				ДанныеДляЗаполненияСтрокиТЧ.Вставить("ЕдиницаИзмерения", ТекНоменклатура.ЕдиницаИзмерения);
			КонецЕсли;
			
		ИначеЕсли ВРег(ТекСтрока.Реквизит) = "ИД" И ЗначениеЗаполнено(ТекСтрока.ЗначениеРеквизита) Тогда
			
			НайденноеЗначение = Справочники.НоменклатураПоставщиков.НайтиПоРеквизиту("Идентификатор", ТекСтрока.ЗначениеРеквизита);
			Если ЗначениеЗаполнено(НайденноеЗначение) И ЗначениеЗаполнено(НайденноеЗначение.Характеристика) Тогда
				ДанныеДляЗаполненияСтрокиТЧ.Вставить("Характеристика", НайденноеЗначение.Характеристика);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЦенаВключаетНДС = Истина;
	Если ДанныеДляЗаполненияСтрокиТЧ.Свойство("ЦенаВключаетНДС") Тогда
		ЦенаВключаетНДС = ДанныеДляЗаполненияСтрокиТЧ.ЦенаВключаетНДС = Истина;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.СуммаСНДС)
		И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Количество)
		И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Цена) Тогда
		СуммаВСтрокеТЧ = ДанныеДляЗаполненияСтрокиТЧ.Количество * ДанныеДляЗаполненияСтрокиТЧ.Цена;
		ЦенаВключаетНДС = Цел(СуммаВСтрокеТЧ) = Цел(ДанныеДляЗаполненияСтрокиТЧ.СуммаСНДС);
	КонецЕсли;
	
	Если ЦенаВключаетНДС И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.СуммаСНДС) Тогда
		ДанныеДляЗаполненияСтрокиТЧ.Сумма = ДанныеДляЗаполненияСтрокиТЧ.СуммаСНДС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Сумма)
		И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Количество)
		И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Цена) Тогда
		ДанныеДляЗаполненияСтрокиТЧ.Сумма = ДанныеДляЗаполненияСтрокиТЧ.Количество * ДанныеДляЗаполненияСтрокиТЧ.Цена;
	КонецЕсли;
	
	// Реквизит СуммаСНДС в УНФ называется ВСЕГО
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.СуммаСНДС) Тогда
		ДанныеДляЗаполненияСтрокиТЧ.Вставить("Всего", ДанныеДляЗаполненияСтрокиТЧ.СуммаСНДС);
	ИначеЕсли Не ЦенаВключаетНДС
		И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Сумма)
		И ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.СуммаНДС) Тогда
		ДанныеДляЗаполненияСтрокиТЧ.Вставить("Всего", ДанныеДляЗаполненияСтрокиТЧ.Сумма + ДанныеДляЗаполненияСтрокиТЧ.СуммаНДС);
	ИначеЕсли ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Сумма) Тогда
		ДанныеДляЗаполненияСтрокиТЧ.Вставить("Всего", ДанныеДляЗаполненияСтрокиТЧ.Сумма);
	КонецЕсли;
	
	// Если передавался номер заказа пробуем найти
	Если РеквизитыИБ.Количество() > 0
		ИЛИ РеквизитыИБКонтрагента.Количество() > 0 Тогда
		
		ВидЭД 		= Перечисления.ВидыЭД.ОтветНаЗаказ;
		Контрагент	= ПолучитьЗначениеРеквизита(ДеревоРазбора, "Контрагент", Истина, ДеревоРазбора);
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
		
			НайденныйДокумент = НайтиДокумент(ВидЭД, Контрагент, РеквизитыИБ, РеквизитыИБКонтрагента);
			Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
				ДанныеДляЗаполненияСтрокиТЧ.Вставить("Заказ", НайденныйДокумент);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ДанныеДляЗаполненияСтрокиТЧ.Свойство("Содержание")
		И ДанныеДляЗаполненияСтрокиТЧ.Свойство("Наименование") Тогда
		ДанныеДляЗаполненияСтрокиТЧ.Вставить("Содержание", ДанныеДляЗаполненияСтрокиТЧ.Наименование);
	КонецЕсли;
	
	Возврат ДанныеДляЗаполненияСтрокиТЧ;
	
КонецФункции

Функция ПолучитьЗначениеРеквизита(СтрокаДерева, ИмяРеквизита, ВключатьПодчиненные = Ложь, ДеревоРазбора = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если СтрокаДерева.Строки.Количество()>0 Тогда
		НайденнаяСтрока = СтрокаДерева.Строки.Найти(ИмяРеквизита, "Реквизит", ВключатьПодчиненные);
	Иначе
		НайденнаяСтрока = СтрокаДерева;
	КонецЕсли;
	
	Если НайденнаяСтрока <> Неопределено Тогда
		Результат = НайденнаяСтрока.ЗначениеРеквизита;
		// Если реквизит ссылочного типа (передали реквизит ДеревоРазбора),
		// тогда нашли всего лишь индекс строки
		Если ЗначениеЗаполнено(ДеревоРазбора) Тогда 
			НайденнаяСтрока = ДеревоРазбора.Строки.Найти(Результат, "ИндексСтроки", Истина);
			Если НайденнаяСтрока <> Неопределено Тогда
				Результат = НайденнаяСтрока.СсылкаНаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьСтруктуруДляПоступленияТоваровУслуг(СтрокаДляЗагрузки, ДеревоРазбора, ЭтоАкт = Ложь) Экспорт
	
	ДанныеДляОбъекта		= Новый Структура;
	ДанныеЗаполненияШапки	= Новый Структура;
	Запасы 					= Документы.ПриходнаяНакладная.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	Расходы 				= Документы.ПриходнаяНакладная.ПустаяСсылка().Расходы.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Реквизит = "СписокОписаний" Тогда
			
			СтрокаРеквизитаОписанийРабот = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Для Каждого СтрокаРеквизитаОписания Из СтрокаРеквизитаОписанийРабот.Строки Цикл
				
				Если СтрокаРеквизитаОписания.Строки.Количество() = 0 Тогда
					
					ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизитаОписания, СтрокаРеквизитаОписания.Реквизит, Истина, ДеревоРазбора);
					
					Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
						ДанныеЗаполненияШапки.Вставить(СтрокаРеквизитаОписания.Реквизит, ЗначениеРеквизита);
					КонецЕсли;
					
				Иначе
					
					ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизитаОписания.Строки, ДеревоРазбора);
					
					Если ЭтоАкт
						ИЛИ (ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Номенклатура)
						И ДанныеДляЗаполненияСтрокиТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
						
						НоваяСтрока = Расходы.Добавить();
					Иначе
						НоваяСтрока = Запасы.Добавить();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияСтрокиТЧ);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Если СтрокаРеквизита.Строки.Количество() = 0 Тогда 
				
				// Заполним реквизит шапки
				ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
				
				Если СтрокаРеквизита.Реквизит = "Дата" Тогда
					ИмяРеквизита = "ДатаВходящегоДокумента";
				ИначеЕсли СтрокаРеквизита.Реквизит = "Номер" Тогда
					ИмяРеквизита = "НомерВходящегоДокумента";
				ИначеЕсли СтрокаРеквизита.Реквизит = "Валюта" Тогда
					ИмяРеквизита = "ВалютаДокумента";
				Иначе
					ИмяРеквизита = СтрокаРеквизита.Реквизит;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
					ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, ЗначениеРеквизита);
				КонецЕсли;
				
			Иначе 
				// Добавим строку табличной части
				ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизита.Строки, ДеревоРазбора);
				
				Если ЭтоАкт
					ИЛИ (ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Номенклатура)
					И ДанныеДляЗаполненияСтрокиТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
					
					НоваяСтрока = Расходы.Добавить();
				Иначе
					НоваяСтрока = Запасы.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияСтрокиТЧ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЗаполненияШапки.Вставить("ПоложениеЗаказаПоставщику", Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти);
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		ДанныеЗаполненияШапки.Вставить("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	КонецЕсли;
	
	ДанныеЗаполненияШапки.Удалить("ВидОперации");
	ДанныеДляОбъекта.Вставить("Шапка"  , ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Запасы" , Запасы);
	
	Пользователь = Пользователи.ТекущийПользователь();
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	Для каждого Строка Из Расходы Цикл
		Строка.СтруктурнаяЕдиница = ОсновноеПодразделение;
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Строка.НаправлениеДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "НаправлениеДеятельности");
		КонецЕсли;
	КонецЦикла;
	ДанныеДляОбъекта.Вставить("Расходы", Расходы);
	
	Возврат ДанныеДляОбъекта;
	
КонецФункции

Функция ПодготовитьСтруктуруДляКорректировкиПоступления(СтрокаДляЗагрузки, ДеревоРазбора)
	
	ДанныеДляОбъекта      = Новый Структура;
	ДанныеЗаполненияШапки = Новый Структура;
	
	Запасы = Документы.КорректировкаПоступления.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	Расходы = Документы.КорректировкаПоступления.ПустаяСсылка().Расходы.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Реквизит = "СписокОписаний" Тогда
			 
			СтрокаРеквизитаОписанийРабот = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Для Каждого СтрокаРеквизитаОписания Из СтрокаРеквизитаОписанийРабот.Строки Цикл
				
				Если СтрокаРеквизитаОписания.Строки.Количество() = 0 Тогда
					ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизитаОписания, СтрокаРеквизитаОписания.Реквизит, Истина, ДеревоРазбора);
					Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
						ДанныеЗаполненияШапки.Вставить(СтрокаРеквизитаОписания.Реквизит, ЗначениеРеквизита);
					КонецЕсли;
				Иначе
					ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизитаОписания.Строки, ДеревоРазбора);
					ЗаполнитьЗначенияСвойств(Расходы.Добавить(), ДанныеДляЗаполненияСтрокиТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Если СтрокаРеквизита.Строки.Количество() = 0 Тогда 
				
				// Заполним реквизит шапки
				ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
				
				Если СтрокаРеквизита.Реквизит = "ДатаПоДаннымКлиента" Тогда
					ИмяРеквизита = "ДатаПоДаннымПокупателя";
				ИначеЕсли СтрокаРеквизита.Реквизит = "НомерПоДаннымКлиента" Тогда
					ИмяРеквизита = "НомерПоДаннымПокупателя";
				ИначеЕсли СтрокаРеквизита.Реквизит = "Валюта" Тогда
					ИмяРеквизита = "ВалютаДокумента";
				ИначеЕсли СтрокаРеквизита.Реквизит = "Основание" Тогда
					ИмяРеквизита = "ДокументОснование";
				Иначе
					ИмяРеквизита = СтрокаРеквизита.Реквизит;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
					ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, ЗначениеРеквизита);
				КонецЕсли;
				
			Иначе 
				
				// Добавим строку табличной части
				ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизита.Строки, ДеревоРазбора);
				
				Если ЗначениеЗаполнено(ДанныеДляЗаполненияСтрокиТЧ.Номенклатура)
					И ДанныеДляЗаполненияСтрокиТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					НоваяСтрока = Расходы.Добавить();
				Иначе
					НоваяСтрока = Запасы.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияСтрокиТЧ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЗаполненияШапки.Вставить("ВидОперацииЭД", ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "ВидОперации", Истина, ДеревоРазбора));
	
	Если ДанныеЗаполненияШапки.ВидОперации = Перечисления.ВидыОперацийЭД.Исправление Тогда
		ДанныеЗаполненияШапки.Вставить("НомерИсправления",ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "НомерИсправления"));
		ДанныеЗаполненияШапки.Вставить("ДатаИсправления", ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "ДатаИсправления"));
	КонецЕсли;
	
	ДанныеЗаполненияШапки.Вставить("НомерИсходногоДокумента",ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "НомерИсходногоДокумента"));
	ДанныеЗаполненияШапки.Вставить("ДатаИсходногоДокумента", ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "ДатаИсходногоДокумента"));
	ДанныеЗаполненияШапки.Вставить("НомерИсправленияИсходногоДокумента",ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "НомерИсправленияИсходногоДокумента"));
	ДанныеЗаполненияШапки.Вставить("ДатаИсправленияИсходногоДокумента", ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "ДатаИсправленияИсходногоДокумента"));
	
	ДанныеЗаполненияШапки.Вставить("НомерВходящегоДокумента",ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "Номер"));
	ДанныеЗаполненияШапки.Вставить("ДатаВходящегоДокумента", ПолучитьЗначениеРеквизита(СтрокаДляЗагрузки, "Дата"));
	
	ДанныеДляОбъекта.Вставить("Шапка",  ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Запасы", Запасы);
	ДанныеДляОбъекта.Вставить("Расходы", Расходы);
	
	Возврат ДанныеДляОбъекта;
	
КонецФункции

Функция ПодготовитьСтруктуруДляСчетНаОплатуПоставщика(СтрокаДляЗагрузки, ДеревоРазбора) Экспорт
	
	ДанныеДляОбъекта			= Новый Структура;
	ДанныеЗаполненияШапки		= Новый Структура;
	Запасы = Документы.СчетНаОплатуПоставщика.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Строки.Количество() = 0 Тогда // примитивный тип
			
			ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Если СтрокаРеквизита.Реквизит = "ЦенаВключаетНДС" Тогда
				
				ИмяРеквизита = "СуммаВключаетНДС";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Валюта" Тогда
				
				ИмяРеквизита = "ВалютаДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Курс" Тогда
				
				ИмяРеквизита = "Курс";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "НомерПоДаннымПоставщика" Тогда
				
				ИмяРеквизита = "НомерВходящегоДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "ДатаПоДаннымПоставщика" Тогда
				
				ИмяРеквизита = "ДатаВходящегоДокумента";
				
			Иначе
				
				ИмяРеквизита = СтрокаРеквизита.Реквизит;
				
			КонецЕсли;
			
			ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, ЗначениеРеквизита);
			
		ИначеЕсли СтрокаРеквизита.Реквизит = "СтрокаТЧ" Тогда
			
			// Добавим строку табличной части
			ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизита.Строки, ДеревоРазбора);
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияСтрокиТЧ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляОбъекта.Вставить("Шапка",  ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Запасы", Запасы);
	
	Возврат ДанныеДляОбъекта;
	
КонецФункции

Функция ПодготовитьСтруктуруДляЗаказаПокупателя(СтрокаДляЗагрузки, ДеревоРазбора) Экспорт
	
	ДанныеДляОбъекта = Новый Структура;
	ДанныеЗаполненияШапки = Новый Структура;
	Запасы = Документы.ЗаказПокупателя.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Строки.Количество()=0 Тогда // примитивный тип
			
			ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Если СтрокаРеквизита.Реквизит = "ЦенаВключаетНДС" Тогда
				
				ИмяРеквизита = "СуммаВключаетНДС";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Валюта" Тогда
				
				ИмяРеквизита = "ВалютаДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Курс" Тогда
				
				ИмяРеквизита = "КурсВзаиморасчетов";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "ДатаПоДаннымКлиента" 
				ИЛИ СтрокаРеквизита.Реквизит = "ДатаПоДаннымПоставщика" Тогда
				
				ИмяРеквизита = "ДатаВходящегоДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "НомерПоДаннымКлиента" 
				ИЛИ СтрокаРеквизита.Реквизит = "НомерПоДаннымПоставщика" Тогда
				
				ИмяРеквизита = "НомерВходящегоДокумента";
				
			Иначе
				
				ИмяРеквизита = СтрокаРеквизита.Реквизит;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
				
				ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, ЗначениеРеквизита);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаРеквизита.Реквизит = "СтрокаТЧ" Тогда
			
			// Добавим строку табличной части
			ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизита.Строки, ДеревоРазбора);
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияСтрокиТЧ);
			
			Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ТипНоменклатуры");
				НоваяСтрока.ТипНоменклатурыЗапас = ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляОбъекта.Вставить("Шапка", 	ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Запасы",	Запасы);
	
	Возврат ДанныеДляОбъекта;
	
КонецФункции

Функция ПодготовитьСтруктуруДляЗаказаПоставщику(СтрокаДляЗагрузки, ДеревоРазбора) Экспорт
	
	ДанныеДляОбъекта			= Новый Структура;
	ДанныеЗаполненияШапки		= Новый Структура;
	Запасы = Документы.ЗаказПоставщику.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Строки.Количество() = 0 Тогда // примитивный тип
			
			ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Если СтрокаРеквизита.Реквизит = "ЦенаВключаетНДС" Тогда
				
				ИмяРеквизита = "СуммаВключаетНДС";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Валюта" Тогда
				
				ИмяРеквизита = "ВалютаДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Курс" Тогда
				
				ИмяРеквизита = "Курс";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "НомерПоДаннымПоставщика" Тогда
				
				ИмяРеквизита = "НомерВходящегоДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "ДатаПоДаннымПоставщика" Тогда
				
				ИмяРеквизита = "ДатаВходящегоДокумента";
				
			Иначе
				
				ИмяРеквизита = СтрокаРеквизита.Реквизит;
				
			КонецЕсли;
			
			ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, ЗначениеРеквизита);
			
		ИначеЕсли СтрокаРеквизита.Реквизит = "СтрокаТЧ" Тогда
			
			// Добавим строку табличной части
			ДанныеДляЗаполненияСтрокиТЧ = ПолучитьДанныеСтрокиТЧ(СтрокаРеквизита.Строки, ДеревоРазбора);
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияСтрокиТЧ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляОбъекта.Вставить("Шапка",  ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Запасы", Запасы);
	
	Возврат ДанныеДляОбъекта;
	
КонецФункции

Функция ПодготовитьСтруктуруДляУПД(ДеревоДанных) Экспорт
	
	ДанныеОбъекта = Новый Структура;
	
	Запасы         = Документы.ПриходнаяНакладная.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	Расходы         = Документы.ПриходнаяНакладная.ПустаяСсылка().Расходы.ВыгрузитьКолонки();
	
	Валюта = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект(
				"Валюты", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВалютаКод"));
	ДанныеОбъекта.Вставить("ВалютаДокумента", Валюта);
	КурсВзаиморасчетов = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ВалютаКурс");
	ДанныеОбъекта.Вставить("Курс", ?(ЗначениеЗаполнено(КурсВзаиморасчетов), КурсВзаиморасчетов, 1));
	ДанныеОбъекта.Вставить("Кратность", 1);
	
	ДанныеОбъекта.Вставить("ВидОперацииЭД", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВидОперации"));
	
	ДанныеОбъекта.Вставить("СуммаВключаетНДС", Ложь);
	ДанныеОбъекта.Вставить("Корректировка",    Ложь);
	
	ДанныеОбъекта.Вставить("НомерВходящегоДокумента", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента"));
	ДанныеОбъекта.Вставить("ДатаВходящегоДокумента",  ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента"));
	
	Если ЗначениеЗаполнено(ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления")) Тогда
		ДанныеОбъекта.Вставить("Исправление", Истина);
		ДанныеОбъекта.Вставить("НомерИсправления", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления"));
		ДанныеОбъекта.Вставить("ДатаИсправления",  ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсправления"));
	Иначе
		ДанныеОбъекта.Вставить("Исправление", Ложь);
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	
	ДанныеОбъекта.Вставить("Организация", ОрганизацияПоДаннымЭД(ДеревоДанных, "СведенияОПокупателе"));
	ДанныеОбъекта.Вставить("Контрагент",  КонтрагентПоДаннымЭД(ДеревоДанных, "СведенияОПродавце"));
	
	ДанныеОбъекта.Вставить("ПередачаТовараКомитентом", Ложь);
	
	ТекстоваяИнформация = ДеревоДанных.Строки.Найти("ДопДанныеДокументаОтгрузки.ТекстоваяИнформация", "ПолныйПуть", Истина);
	Если ТекстоваяИнформация <> Неопределено Тогда
		Для Каждого СтрокаТекстовойИнформации Из ТекстоваяИнформация.Строки Цикл
			Если ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СтрокаТекстовойИнформации, 
						"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация.НомерСтроки.Идентификатор") = "ПередачаТовараКомитентом" Тогда
				ДанныеОбъекта.ПередачаТовараКомитентом = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СтрокаТекстовойИнформации,
						"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация.НомерСтроки.Значение") = "Истина";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("ПоложениеЗаказаПоставщику", Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти);
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		ДанныеОбъекта.Вставить("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		Признак = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Признак");
		Если Признак = "1" Тогда
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("ЕдиницыИзмерения",
				ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЕдиницаИзмеренияКод"));
		Иначе
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("ЕдиницыИзмерения",
				ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЕдиницаИзмеренияКод"));
			НоваяСтрока.Содержание = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ТоварНаименование");
		КонецЕсли;
		
		// Обязательные реквизиты:
		НоваяСтрока.СтавкаНДС = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.НалоговаяСтавка");
		НоваяСтрока.СуммаНДС = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СуммаНалога");
		
		// Необязательные реквизиты:
		НоваяСтрока.Количество = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Количество");
		НоваяСтрока.Цена = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмерения");
		НоваяСтрока.Сумма = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалога");
		НоваяСтрока.Всего = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровСНалогом");
		
		ИдентификаторНоменклатуры = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ИдТовараУКонтрагента");
		НаименованиеНоменклатуры  = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре,
				"СведенияОТоварах.НомерСтроки.ТоварНаименование");
		НоваяСтрока.Номенклатура = НоменклатураКонтрагента(ДанныеОбъекта.Контрагент, ИдентификаторНоменклатуры, НаименованиеНоменклатуры);
		
		Если Признак = "1" Тогда
		
			СведенияОТаможеннойДекларации = СведенияОТоваре.Строки.Найти(
											"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации", "ПолныйПуть", Истина);
			
			Если СведенияОТаможеннойДекларации <> Неопределено
				И СведенияОТаможеннойДекларации.Строки.Количество() > 0 Тогда
				
				НомерТД = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
								"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.ТаможеннаяДекларацияНомер");
				
				КодСтраныТД = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
								"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.СтранаПроисхожденияКод");
				
				Если ЗначениеЗаполнено(НомерТД) Тогда
					ТаможеннаяДекларация = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("НомерТД", НомерТД);
					Если НЕ ЗначениеЗаполнено(ТаможеннаяДекларация) Тогда
						ТаможеннаяДекларацияОбъект = Справочники.НомераГТД.СоздатьЭлемент();
						ТаможеннаяДекларацияОбъект.Код = НомерТД;
						ТаможеннаяДекларацияОбъект.Записать();
						ТаможеннаяДекларация = ТаможеннаяДекларацияОбъект.Ссылка;
					КонецЕсли;
					НоваяСтрока.НомерГТД = ТаможеннаяДекларация;
					НоваяСтрока.СтранаПроисхождения = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", КодСтраныТД);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.СтруктурнаяЕдиница = ОсновноеПодразделение;
			Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				НоваяСтрока.НаправлениеДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "НаправлениеДеятельности");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("Шапка", ДанныеОбъекта);
	ДанныеДляЗаполнения.Вставить("Запасы", Запасы);
	ДанныеДляЗаполнения.Вставить("Расходы", Расходы);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

Функция ПодготовитьСтруктуруДляУКД(ДеревоДанных) Экспорт
	
	ДанныеОбъекта = Новый Структура;
	
	Запасы         = Документы.КорректировкаПоступления.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	Расходы         = Документы.КорректировкаПоступления.ПустаяСсылка().Расходы.ВыгрузитьКолонки();
	
	Валюта = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект(
				"Валюты", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВалютаКод"));
	ДанныеОбъекта.Вставить("ВалютаДокумента", Валюта);
	КурсВзаиморасчетов = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ВалютаКурс");
	ДанныеОбъекта.Вставить("КурсВзаиморасчетов", ?(ЗначениеЗаполнено(КурсВзаиморасчетов), КурсВзаиморасчетов, 1));
	ДанныеОбъекта.Вставить("КратностьВзаиморасчетов", 1);
	
	ДанныеОбъекта.Вставить("СуммаВключаетНДС", Ложь);
	
	ДанныеОбъекта.Вставить("НомерВходящегоДокумента", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента"));
	ДанныеОбъекта.Вставить("ДатаВходящегоДокумента",  ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента"));
	
	ДанныеОбъекта.Вставить("НомерИсходногоДокумента", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсходногоДокумента"));
	ДанныеОбъекта.Вставить("ДатаИсходногоДокумента",  ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсходногоДокумента"));
	
	Если ЗначениеЗаполнено(ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправленияИсходногоДокумента")) Тогда
		ДанныеОбъекта.Вставить("УчитыватьИсправлениеИсходногоДокумента", Истина);
		ДанныеОбъекта.Вставить("НомерИсправленияИсходногоДокумента", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправленияИсходногоДокумента"));
		ДанныеОбъекта.Вставить("ДатаИсправленияИсходногоДокумента",  ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсправленияИсходногоДокумента"));
	Иначе
		ДанныеОбъекта.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления")) Тогда
		ДанныеОбъекта.Вставить("ВидОперацииЭД", Перечисления.ВидыОперацийЭД.Исправление);
		ДанныеОбъекта.Вставить("Исправление", Истина);
		ДанныеОбъекта.Вставить("НомерИсправления", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления"));
		ДанныеОбъекта.Вставить("ДатаИсправления",  ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсправления"));
	Иначе
		ДанныеОбъекта.Вставить("ВидОперацииЭД", Перечисления.ВидыОперацийЭД.Корректировка);
		ДанныеОбъекта.Вставить("Исправление", Ложь);
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("Организация", ОрганизацияПоДаннымЭД(ДеревоДанных, "СведенияОПокупателе"));
	ДанныеОбъекта.Вставить("Контрагент",  КонтрагентПоДаннымЭД(ДеревоДанных, "СведенияОПродавце"));
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		ИдентификаторНоменклатуры = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ИдТовараУКонтрагента");
		НаименованиеНоменклатуры  = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре,
				"СведенияОТоварах.НомерСтроки.ТоварНаименование");
		Номенклатура = НоменклатураКонтрагента(ДанныеОбъекта.Контрагент, ИдентификаторНоменклатуры, НаименованиеНоменклатуры);
		
		Если ЗначениеЗаполнено(Номенклатура)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры") <> Перечисления.ТипыНоменклатуры.Запас Тогда
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.СодержаниеДоИзменения = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ТоварНаименование");
			НоваяСтрока.Содержание            = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ТоварНаименование");
		Иначе
			НоваяСтрока = Запасы.Добавить();
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = Номенклатура;
		
		НоваяСтрока.СтавкаНДС = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.НалоговаяСтавка");
		НоваяСтрока.СуммаНДСДоКорректировки = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СуммаНалогаДоКорректировки");
		НоваяСтрока.СуммаНДС                = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СуммаНалога");
		
		НоваяСтрока.КоличествоДоКорректировки = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.КоличествоДоКорректировки");
		НоваяСтрока.Количество = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Количество");
		НоваяСтрока.ЦенаДоКорректировки = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмеренияДоКорректировки");
		НоваяСтрока.Цена = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмерения");
		НоваяСтрока.СуммаДоКорректировки = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалогаДоКорректировки");
		НоваяСтрока.Сумма = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалога");
		
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("Шапка", ДанныеОбъекта);
	ДанныеДляЗаполнения.Вставить("Запасы", Запасы);
	ДанныеДляЗаполнения.Вставить("Расходы", Расходы);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

Функция КонтрагентПоДаннымЭД(ДеревоДанных, ВидУчастника)
	
	Если ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника") = "ЮЛ" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН
			|	И Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ЮридическоеЛицо)";
		Запрос.УстановитьПараметр("ИНН", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ЮЛ.ИНН"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника") = "ИП" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН
			|	И (Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
			|			ИЛИ Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо))";
		Запрос.УстановитьПараметр("ИНН", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ИП.ИНН"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника") = "ИЛ" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.НаименованиеПолное = &НаименованиеПолное";
		Запрос.УстановитьПараметр("НаименованиеПолное",
			ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ИЛ.НаименованиеОрганизации"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ОрганизацияПоДаннымЭД(ДеревоДанных, ВидУчастника)
	
	Если ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника") = "ЮЛ" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ИНН = &ИНН
			|	И Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)";
		Запрос.УстановитьПараметр("ИНН", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ЮЛ.ИНН"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника") = "ИП" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ИНН = &ИНН
			|	И Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)";
		Запрос.УстановитьПараметр("ИНН", ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ИП.ИНН"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
	
КонецФункции


// Находит документ ИБ по параметрам.
//
// Параметры:
//  ВидЭД - Перечисления.ВидыЭД - Вид электронного документа, по которому ищется документ ИБ,
//  Контрагент - Ссылка на контрагента,
//  РеквизитыИБ - структура параметров информационной базы,
//  РеквизитыИБКонтрагента - структура параметров контрагента в информационной базе.
//
Функция НайтиДокумент(ВидЭД, Контрагент, РеквизитыИБ = Неопределено, РеквизитыИБКонтрагента = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НайденныйДок	= Неопределено;
	Запрос 			= Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ДокументПоиска.Ссылка КАК Ссылка ИЗ &УказатьВидДокументаЗапроса КАК ДокументПоиска ГДЕ ДокументПоиска.Контрагент = &Контрагент");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Если ВидЭД = Перечисления.ВидыЭД.СчетНаОплату Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УказатьВидДокументаЗапроса", "Документ.СчетНаОплатуПоставщика");
		
	ИначеЕсли ВидЭД = Перечисления.ВидыЭД.ЗаказТовара Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УказатьВидДокументаЗапроса", "Документ.ЗаказПокупателя");
		
	ИначеЕсли ВидЭД = Перечисления.ВидыЭД.ОтветНаЗаказ Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УказатьВидДокументаЗапроса", "Документ.ЗаказПоставщику");
		
	КонецЕсли;
	
	НайденныйДок = ИскатьДокументПоРеквизитам(РеквизитыИБ, Запрос);
	
	Если НайденныйДок = Неопределено Тогда
		
		НайденныйДок = ИскатьДокументПоРеквизитам(РеквизитыИБКонтрагента, Запрос);
		
	КонецЕсли;
	
	Возврат НайденныйДок;
	
КонецФункции

Функция НайтиСоздатьПоступлениеТоваровУслуг(СтрокаДляЗагрузки, ДеревоРазбора, СсылкаНаВладельца = Неопределено, ЭтоАкт = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляЗагрузки = ПодготовитьСтруктуруДляПоступленияТоваровУслуг(СтрокаДляЗагрузки, ДеревоРазбора, ЭтоАкт);
	
	Документ = СсылкаНаВладельца;
	ЗаполнитьДокументПоступленияТоваровУслуг(Документ, ДанныеДляЗагрузки);
	
	Возврат Документ;
	
КонецФункции


Функция НайтиСоздатьКорректировкуПоступления(СтрокаДляЗагрузки, ДеревоРазбора, СсылкаНаВладельца = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляЗагрузки = ПодготовитьСтруктуруДляКорректировкиПоступления(СтрокаДляЗагрузки, ДеревоРазбора);
	
	Документ = СсылкаНаВладельца;
	ЗаполнитьДокументКорректировкиПоступления(Документ, ДанныеДляЗагрузки);
	
	Возврат Документ;
	
КонецФункции

Функция НайтиСоздатьСчетНаОплатуПоставщика(СтрокаДляЗагрузки, ДеревоРазбора, СсылкаНаВладельца = Неопределено) Экспорт

	ДанныеДляЗагрузки = ПодготовитьСтруктуруДляСчетНаОплатуПоставщика(СтрокаДляЗагрузки, ДеревоРазбора);
	
	ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Попытка
		
		Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда // получены изменения по существующему документу
			
			Если СсылкаНаВладельца.Проведен Тогда 
				ВызватьИсключение НСтр("ru='Заполнение на основании ЭД возможно только для непроведенного документа';uk='Заполнение на основании ЭД возможно только для непроведенного документа'");
			КонецЕсли;
			
			ДокументОбъект = СсылкаНаВладельца.ПолучитьОбъект();
			
		Иначе // попробуем найти по РеквизитыИБ и РеквизитыИБКонтрагента
			
			УстановитьПривилегированныйРежим(Истина);
			
			ДокументОбъект 				= Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			ДокументОбъект.Дата			= ТекущаяДатаСеанса();
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
				И ДанныеЗаполнения.Свойство("Организация") Тогда
				
				ДокументОбъект.Организация	= ДанныеЗаполнения.Организация;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Заполним значения реквизитов шапки
		ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
		
		// Загрузим табличные части
		ДокументОбъект.Запасы.Загрузить(ДанныеДляЗагрузки.Запасы);
		
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего");
		
		// Установим вручную некоторые реквизиты шапки
		ЗаполнитьДоговорКонтрагента(ДокументОбъект);
		
		Если ДанныеЗаполнения.Свойство("СуммаНалогаИтог") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.СуммаНалогаИтог) Тогда
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		Иначе
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
		КонецЕсли;
		
		// Заполним курс и кратность
		КурсВалюты					= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.Курс			= КурсВалюты.Курс;
		ДокументОбъект.Кратность	= КурсВалюты.Кратность;
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение на основании ЭД';uk='Заполнение на основании ЭД'"),
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Документы.ЗаказПоставщику, 
			СсылкаНаВладельца, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;

КонецФункции

Функция НайтиСоздатьЗаказПокупателя(СтрокаДляЗагрузки, ДеревоРазбора, СсылкаНаВладельца = Неопределено) Экспорт
	
	ДанныеДляЗагрузки = ПодготовитьСтруктуруДляЗаказаПокупателя(СтрокаДляЗагрузки, ДеревоРазбора);
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда 
		
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
		
	КонецЕсли; 
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Попытка
		
		Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда // получены изменения по существующему документу
			
			Если СсылкаНаВладельца.Проведен Тогда 
				ВызватьИсключение НСтр("ru='Заполнение на основании ЭД возможно только для непроведенного документа';uk='Заполнение на основании ЭД возможно только для непроведенного документа'");
			КонецЕсли;
			
			ДокументОбъект = СсылкаНаВладельца.ПолучитьОбъект();
			
		Иначе // попробуем найти по РеквизитыИБ и РеквизитыИБКонтрагента
			
			УстановитьПривилегированныйРежим(Истина);
			
			ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
			
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
			
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
		// Заполним значения реквизитов шапки
		ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
		
		// Установим вручную некоторые реквизиты шапки
		ЗаполнитьДоговорКонтрагента(ДокументОбъект);
		
		ДокументОбъект.Кратность	= 1;
		ДокументОбъект.ВидОперации	= Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
		
		// Загрузим табличные части
		ДокументОбъект.Запасы.Загрузить(ДанныеДляЗагрузки.Запасы);
		
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего") + ДокументОбъект.Работы.Итог("Всего");
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			
			ДокументОбъект.УстановитьНовыйНомер();
			
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение на основании ЭД';uk='Заполнение на основании ЭД'"), 
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Документы.ЗаказПокупателя, 
			СсылкаНаВладельца, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

Функция НайтиСоздатьЗаказПоставщику(СтрокаДляЗагрузки, ДеревоРазбора, СсылкаНаВладельца = Неопределено) Экспорт
	
	ДанныеДляЗагрузки = ПодготовитьСтруктуруДляЗаказаПоставщику(СтрокаДляЗагрузки, ДеревоРазбора);
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда 
		
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
		
	КонецЕсли;
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Попытка
		
		Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда // получены изменения по существующему документу
			
			Если СсылкаНаВладельца.Проведен Тогда 
				ВызватьИсключение НСтр("ru='Заполнение на основании ЭД возможно только для непроведенного документа';uk='Заполнение на основании ЭД возможно только для непроведенного документа'");
			КонецЕсли;
			
			ДокументОбъект = СсылкаНаВладельца.ПолучитьОбъект();
			
		Иначе // попробуем найти по РеквизитыИБ и РеквизитыИБКонтрагента
			
			УстановитьПривилегированныйРежим(Истина);
			
			ДокументОбъект 				= Документы.ЗаказПоставщику.СоздатьДокумент();
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			ДокументОбъект.Дата			= ТекущаяДатаСеанса();
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
				И ДанныеЗаполнения.Свойство("Организация") Тогда
				
				ДокументОбъект.Организация	= ДанныеЗаполнения.Организация;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Заполним значения реквизитов шапки
		ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
		
		ДокументОбъект.ВидОперации		= Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку;
		
		// Загрузим табличные части
		ДокументОбъект.Запасы.Загрузить(ДанныеДляЗагрузки.Запасы);
		
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего");
		
		// Установим вручную некоторые реквизиты шапки
		ЗаполнитьДоговорКонтрагента(ДокументОбъект);
		
		Если ДанныеЗаполнения.Свойство("СуммаНалогаИтог") 
			И ЗначениеЗаполнено(ДанныеЗаполнения.СуммаНалогаИтог) Тогда
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		Иначе
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
		КонецЕсли;
		
		// Заполним курс и кратность
		КурсВалюты					= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.Курс			= КурсВалюты.Курс;
		ДокументОбъект.Кратность	= КурсВалюты.Кратность;
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение на основании ЭД';uk='Заполнение на основании ЭД'"),
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Документы.ЗаказПоставщику, 
			СсылкаНаВладельца, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

Процедура СохранитьДанныеКаталогаТоваров(СтрокаЗагрузки, ДеревоРазбора, СсылкаНаВладельца = Неопределено) Экспорт
	
	СтрокиТЧ = СтрокаЗагрузки.Строки.НайтиСтроки(Новый Структура("Реквизит", "СтрокаТЧ"));
	ТабЗагрузки = Новый ТаблицаЗначений;
	ТабЗагрузки.Колонки.Добавить("ИдентификаторТовара");
	ТабЗагрузки.Колонки.Добавить("ЗначенияСвойств");
	
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		
		ИдентификаторТовара = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаСтрокиДереваРазбора(
																ДеревоРазбора,
																СтрокаТЧ,
																"НоменклатураПоставщика.Идентификатор");
		
		ЗначенияСвойств = ЭлектронноеВзаимодействиеСлужебный.ЗначениеРеквизитаСтрокиДереваРазбора(
																ДеревоРазбора,
																СтрокаТЧ,
																"НоменклатураПоставщика.ЗначенияСвойств");
		Если Не ЗначенияСвойств = Неопределено Тогда
			НовСтрока = ТабЗагрузки.Добавить();
			НовСтрока.ИдентификаторТовара = ИдентификаторТовара;
			НовСтрока.ЗначенияСвойств     = ЗначенияСвойств;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТабЗагрузки.Количество() > 0 Тогда
		
		ВедетсяУчетАлкогольнойПродукции = ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПоставщиков.Номенклатура,
		|	НоменклатураПоставщиков.Идентификатор
		|ИЗ
		|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|ГДЕ
		|	НоменклатураПоставщиков.Идентификатор В(&МассивИдентификаторов)
		|	И НЕ НоменклатураПоставщиков.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
		Запрос.УстановитьПараметр("МассивИдентификаторов", ТабЗагрузки.ВыгрузитьКолонку("ИдентификаторТовара"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Строка = ТабЗагрузки.Найти(Выборка.Идентификатор, "ИдентификаторТовара");
			Если ВедетсяУчетАлкогольнойПродукции Тогда
				ЗаполнитьРеквизитыНоменклатурыДляУчетаАлкогольнойПродукции(Выборка.Номенклатура, Строка.ЗначенияСвойств);
			КонецЕсли;
			
			Для Каждого Свойство Из Строка.ЗначенияСвойств Цикл
				Если Сред(Свойство.ИД, 1, 8) = "Свойство" Тогда
					СвойствоСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
																									Свойство.Наименование);
					Если НЕ ЗначениеЗаполнено(СвойствоСсылка) Тогда
						НоваяХарактеристика = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
						НоваяХарактеристика.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура;
						НоваяХарактеристика.Наименование = Свойство.Наименование;
						НоваяХарактеристика.Заголовок = Свойство.Наименование;
						НоваяХарактеристика.ТипЗначения = Тип("СправочникСсылка.ЗначенияСвойствОбъектов");
						НоваяХарактеристика.Записать();
						СвойствоСсылка = НоваяХарактеристика.Ссылка;
					КонецЕсли;
					
					Если СвойствоСсылка.ТипЗначения = Новый ОписаниеТипов("Строка") Тогда
						ЗначениеСвойства = Свойство.Значение[0];
					ИначеЕсли СвойствоСсылка.ТипЗначения = Новый ОписаниеТипов("Булево") Тогда
						ЗначениеСвойства = Булево(Свойство.Значение[0]);
					ИначеЕсли СвойствоСсылка.ТипЗначения = Новый ОписаниеТипов("Дата") Тогда
						ЗначениеСвойства = Дата(Свойство.Значение[0]);
					ИначеЕсли СвойствоСсылка.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
						ЗначениеСвойства = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Свойство.Значение[0]);
						Если НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
							НовоеЗначениеСвойства = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
							НовоеЗначениеСвойства.Наименование = Свойство.Значение[0];
							НовоеЗначениеСвойства.Владелец = СвойствоСсылка;
							НовоеЗначениеСвойства.Записать();
							ЗначениеСвойства = НовоеЗначениеСвойства.Ссылка;
						КонецЕсли;
					КонецЕсли;
					
					ТоварОбъект = Выборка.Номенклатура.ПолучитьОбъект();
					СтрокаСвойств = ТоварОбъект.ДополнительныеРеквизиты.Найти(СвойствоСсылка, "Свойство");
					Если СтрокаСвойств = Неопределено Тогда
						СтрокаСвойств = ТоварОбъект.ДополнительныеРеквизиты.Добавить();
					КонецЕсли;
					СтрокаСвойств.Свойство = СвойствоСсылка;
					СтрокаСвойств.Значение = ЗначениеСвойства;
					
					ТоварОбъект.Записать();
				ИначеЕсли Свойство.ИД = "Штрихкод" Тогда
					ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
					Если ЗначениеЗаполнено(Свойство.Наименование) Тогда
						ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоКоду(Свойство.Наименование);
					КонецЕсли;
					Для Каждого Штрихкод ИЗ Свойство.Значение Цикл
						МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.Штрихкод = Штрихкод;
						МенеджерЗаписи.Прочитать();
						Если Не МенеджерЗаписи.Выбран() Тогда
							МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
							МенеджерЗаписи.ЕдиницаИзмерения = ЕдиницаИзмерения;
							МенеджерЗаписи.Штрихкод = Штрихкод;
							МенеджерЗаписи.Записать();
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьРеквизитыНоменклатурыДляУчетаАлкогольнойПродукции(ТоварСсылка, ЗначенияСвойств)

	СтруктураСвойств = Новый Структура;
	
	СтруктураСвойств.Вставить("КодВидаАлкогольнойПродукции");
	СтруктураСвойств.Вставить("ИННПроизводителяИмпортера");
	СтруктураСвойств.Вставить("ОбъемДАЛ");
	
	СвойстваНаУдаление = Новый Массив;
	
	Для каждого Свойство Из ЗначенияСвойств Цикл
		Если Не ЗначениеЗаполнено(Свойство.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		Если СтруктураСвойств.Свойство(Свойство.Наименование) Тогда
			СтруктураСвойств[Свойство.Наименование] = Свойство.Значение[0];
			СвойстваНаУдаление.Добавить(Свойство);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Свойство Из СвойстваНаУдаление Цикл
		НайденныйЭлемент = ЗначенияСвойств.Найти(Свойство);
		Если НайденныйЭлемент <> Неопределено Тогда
			ЗначенияСвойств.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыАлкогольнойПродукции.Ссылка КАК ВидАлкогольнойПродукции
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	|ГДЕ
	|	ВидыАлкогольнойПродукции.Код = &КодВидаАлкогольнойПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК ПроизводительИмпортерАлкогольнойПродукции
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ИННПроизводителяИмпортера <> Неопределено И Контрагенты.ИНН = &ИННПроизводителяИмпортера";
	
	Запрос.УстановитьПараметр("КодВидаАлкогольнойПродукции", СтруктураСвойств.КодВидаАлкогольнойПродукции);
	Запрос.УстановитьПараметр("ИННПроизводителяИмпортера", ?(ЗначениеЗаполнено(СтруктураСвойств.ИННПроизводителяИмпортера), СтруктураСвойств.ИННПроизводителяИмпортера, Неопределено));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТоварОбъект = ТоварСсылка.ПолучитьОбъект();
	ДанныеМодифицированы = Ложь;
	
	Если ЗначениеЗаполнено(СтруктураСвойств.ОбъемДАЛ) Тогда
		ТоварОбъект.ОбъемДАЛ = СтруктураСвойств.ОбъемДАЛ;
		ДанныеМодифицированы = Истина;
	КонецЕсли;
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ТоварОбъект.ВидАлкогольнойПродукции = Выборка.ВидАлкогольнойПродукции;
		ДанныеМодифицированы = Истина;
	КонецЕсли;

	Выборка = МассивРезультатов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ТоварОбъект.ПроизводительИмпортерАлкогольнойПродукции = Выборка.ПроизводительИмпортерАлкогольнойПродукции;
		ДанныеМодифицированы = Истина;
	КонецЕсли;
	
	Если ДанныеМодифицированы Тогда
		ТоварОбъект.ОбменДанными.Загрузка = Истина;
		ТоварОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументПоступленияТоваровУслуг(Документ, ДанныеДляЗагрузки) Экспорт
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда 
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	КонецЕсли; 
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Попытка
		
		Если ЗначениеЗаполнено(Документ) Тогда // получены изменения по существующему документу
			
			Если Документ.Проведен Тогда 
				ВызватьИсключение НСтр("ru='Заполнение на основании ЭД возможно только для непроведенного документа';uk='Заполнение на основании ЭД возможно только для непроведенного документа'");
			КонецЕсли;
			
			ДокументОбъект = Документ.ПолучитьОбъект();
			
		Иначе // создаем новый
			
			УстановитьПривилегированныйРежим(Истина);
			ДокументОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
			
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
			
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			
		КонецЕсли;
		
		// Заполним реквизиты шапки на основании структуры данных заполнения
		ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
		
		// Загрузим табличные части
		ДокументОбъект.Запасы.Загрузить(ДанныеДляЗагрузки.Запасы);
		ДокументОбъект.Расходы.Загрузить(ДанныеДляЗагрузки.Расходы);
		
		// Заполним курс и кратность
		КурсВалюты					= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.Курс			= КурсВалюты.Курс;
		ДокументОбъект.Кратность	= КурсВалюты.Кратность;
		
		НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
		Если ДокументОбъект.ВалютаДокумента <> НациональнаяВалюта Тогда
			ПересчитатьЦеныТабличнойЧастиПоВалюте(ДокументОбъект, НациональнаяВалюта, "Запасы");
			ПересчитатьЦеныТабличнойЧастиПоВалюте(ДокументОбъект, НациональнаяВалюта, "Расходы");
		КонецЕсли;
		
		// Установим вручную некоторые реквизиты шапки
		ЗаполнитьДоговорКонтрагента(ДокументОбъект);
		
		Если ДанныеЗаполнения.Свойство("СуммаНДС")
			И ДанныеЗаполнения.СуммаНДС > 0
			ИЛИ ДокументОбъект.Запасы.Итог("СуммаНДС") > 0
			ИЛИ ДокументОбъект.Расходы.Итог("СуммаНДС") > 0 Тогда
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		Иначе
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
		КонецЕсли;
		
		ДокументОбъект.СуммаВключаетНДС = Истина;
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего") + ДокументОбъект.Расходы.Итог("Всего");
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
		КонецЕсли;
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписи);
		
		Документ = ДокументОбъект.Ссылка;
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение на основании ЭД';uk='Заполнение на основании ЭД'"),
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Документы.ЗаказПоставщику, 
			Документ, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДокументКорректировкиПоступления(Документ, ДанныеДляЗагрузки) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.НациональнаяВалюта.Получить();
	ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Попытка
	
		Если ЗначениеЗаполнено(Документ) Тогда // получены изменения по существующему документу
			
			Если Документ.Проведен Тогда 
				ВызватьИсключение НСтр("ru='Заполнение на основании ЭД возможно только для непроведенного документа';uk='Заполнение на основании ЭД возможно только для непроведенного документа'");
			КонецЕсли;
			
			ДокументОбъект = Документ.ПолучитьОбъект();
			
		Иначе // создаем новый
			
			ДокументОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			
		КонецЕсли;
		
		// Заполним реквизиты шапки на основании структуры данных заполнения
		ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
		Иначе
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
		КонецЕсли;
		
		ДокументОбъект.ЗаполнитьСвойстваШапки();
		
		Если ДанныеЗаполнения.ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление Тогда
			ДокументОбъект.НомерИсправления = ДанныеЗаполнения.НомерИсправления;
			ДокументОбъект.ДатаИсправления = ДанныеЗаполнения.ДатаИсправления;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("НомерИсходногоДокумента")
			И ЗначениеЗаполнено(ДанныеЗаполнения.НомерИсходногоДокумента) Тогда
			ДокументОбъект.НомерИсходногоДокумента = ДанныеЗаполнения.НомерИсходногоДокумента;
			ДокументОбъект.ДатаИсходногоДокумента  = ДанныеЗаполнения.ДатаИсходногоДокумента;
			Если ДанныеЗаполнения.Свойство("УчитыватьИсправлениеИсходногоДокумента")
				И ДанныеЗаполнения.УчитыватьИсправлениеИсходногоДокумента Тогда
				ДокументОбъект.НомерИсправленияИсходногоДокумента = ДанныеЗаполнения.НомерИсправленияИсходногоДокумента;
				ДокументОбъект.ДатаИсправленияИсходногоДокумента  = ДанныеЗаполнения.ДатаИсправленияИсходногоДокумента;
			КонецЕсли;
		КонецЕсли;
		
		ДокументОснование = ДокументОбъект.ДокументОснование;
		Если Не ЗначениеЗаполнено(ДокументОснование) И ДанныеЗаполнения.Свойство("Основание") Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;
		
		// Заполненим корректировку поступления данными основания
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ДокументОбъект.Заполнить(ДокументОснование);
		КонецЕсли;
		
		// Заполним табличные части данными корректировки
		ТабличныеЧастиДляЗаполения = Новый Структура("Запасы, Расходы");
		СтрокиТабличнойЧастиДляПерезаполнения = Новый Структура("Запасы, Расходы",
				"Количество, Цена, Сумма, СуммаНДС", 
				"Количество, Цена, Сумма, СуммаНДС, Содержание");
		Если ДанныеЗаполнения.ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление Тогда
			СтрокиТабличнойЧастиДляПерезаполненияНового = Новый Структура("Запасы, Расходы", "", "");
		Иначе
			СтрокиТабличнойЧастиДляПерезаполненияНового = Новый Структура("Запасы, Расходы",
					"КоличествоДоИзменения, ЦенаДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения", 
					"КоличествоДоИзменения, ЦенаДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, СодержаниеДоИзменения");
		КонецЕсли;
		Для Каждого ТабличнаяЧасть Из ТабличныеЧастиДляЗаполения Цикл
			
			ИмяТЧ = ТабличнаяЧасть.Ключ;
			
			Если ИмяТЧ = "Запасы" Тогда
				СтруктураПоиска = Новый Структура("Номенклатура, Характеристика");
			Иначе
				СтруктураПоиска = Новый Структура("Номенклатура");
			КонецЕсли;
			
			Для Каждого СтрокаДокумента Из ДокументОбъект[ИмяТЧ] Цикл
				
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
				РезультатПоискаДанныхЗаполнения = ДанныеДляЗагрузки[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
				
				Если РезультатПоискаДанныхЗаполнения.Количество() = 0 Тогда
					
					// Такой строки в данных корректировки нет - обнуляем данные строки документа.
					СтрокаДокумента.Количество = 0;
					СтрокаДокумента.Цена       = 0;
					СтрокаДокумента.Сумма      = 0;
					СтрокаДокумента.СуммаНДС   = 0;
					
				Иначе
					
					СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
					ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, СтрокиТабличнойЧастиДляПерезаполнения[ИмяТЧ]);
					
					// Удалим обработанную строку из данных заполнения
					ДанныеДляЗагрузки[ИмяТЧ].Удалить(СтрокаДанныхЗаполнения);
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Добавим новые строки в документ
			Если ДанныеДляЗагрузки[ИмяТЧ].Количество() > 0 Тогда
				
				Для Каждого СтрокаДанныхЗаполнения Из ДанныеДляЗагрузки[ИмяТЧ] Цикл
					Если Не ЗначениеЗаполнено(СтрокаДанныхЗаполнения.Номенклатура) Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ДокументОбъект[ИмяТЧ].Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения, , СтрокиТабличнойЧастиДляПерезаполненияНового[ИмяТЧ]);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеЗаполнения.Свойство("СуммаНДС")
			И ДанныеЗаполнения.СуммаНДС > 0
			ИЛИ ДокументОбъект.Запасы.Итог("СуммаНДС") > 0
			ИЛИ ДокументОбъект.Расходы.Итог("СуммаНДС") > 0 Тогда
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		Иначе
			ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
		КонецЕсли;
		
		ДокументОбъект.СуммаВключаетНДС = Истина;
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего") + ДокументОбъект.Расходы.Итог("Всего");
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
		КонецЕсли;
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписи);
		
		Документ = ДокументОбъект.Ссылка;
	Исключение
	
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение на основании ЭД';uk='Заполнение на основании ЭД'"),
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Документы.ЗаказПоставщику, 
			Документ, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

// Возвращает структуру для открытия формы сопоставления номенклатуры
//
// Параметры:
//  СсылкаНаЭД - СправочникСсылка.ЭДПрисоединенныеФайлы
//
// Возвращаемое значение:
//  Структура, содержащая ИмяФормы и ПараметрыОткрытияФормы
//
Функция ПолучитьПараметрыФормыСопоставленияНоменклатуры(СсылкаНаЭД) Экспорт
	
	СтруктураПарамеров = Неопределено;
	
	// Сопоставление номенклатуры вызывается 
	// 	- для входящих документов видов:
	// 		- ТОРГ12
	// 		- ТОРГ12Продавец
	// 		- ОтветНаЗаказ
	// 		- КаталогТоваров
	// 		- АктИсполнитель
	// 	- для исходящего документа 
	//		- ТОРГ12Покупатель 
	Если (СсылкаНаЭД.НаправлениеЭД = Перечисления.НаправленияЭД.Входящий 
		    И (СсылкаНаЭД.ВидЭД = Перечисления.ВидыЭД.ТОРГ12
				ИЛИ СсылкаНаЭД.ВидЭД = Перечисления.ВидыЭД.ТОРГ12Продавец
				ИЛИ СсылкаНаЭД.ВидЭД = Перечисления.ВидыЭД.ОтветНаЗаказ
				ИЛИ СсылкаНаЭД.ВидЭД = Перечисления.ВидыЭД.КаталогТоваров
				ИЛИ СсылкаНаЭД.ВидЭД = Перечисления.ВидыЭД.АктИсполнитель)) 
		 ИЛИ (СсылкаНаЭД.НаправлениеЭД = Перечисления.НаправленияЭД.Исходящий
			И СсылкаНаЭД.ВидЭД = Перечисления.ВидыЭД.ТОРГ12Покупатель) Тогда
		
		СтруктураПарамеров = Новый Структура();
		СтруктураПарамеров.Вставить("ИмяФормы", "ОбщаяФорма.СопоставлениеДанныхПоНоменклатуре");
		ПараметрыОткрытияФормы = Новый Структура("ЭлектронныйДокумент, НеОткрыватьФормуПриОтсутствииНесопоставленнойНоменклатуры", СсылкаНаЭД, Истина);
		СтруктураПарамеров.Вставить("ПараметрыОткрытияФормы", ПараметрыОткрытияФормы);
		
	КонецЕсли;
	
	Возврат СтруктураПарамеров;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Создание элементов справочников

// Получает реквизиты элемнта справочника "Организации".
//
// Параметры:
//  Организация - СправочникСсылка.Организации - элемент справочника организации;
//  СтруктураВозврата - струтура - перечень параметров организации.
//
Процедура ПолучитьРеквизитыОрганизации(Организация, СтруктураВозврата) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	Организации.Наименование 		КАК Наименование,
	|	Организации.НаименованиеПолное 	КАК НаименованиеПолное,
	|	Организации.ИНН 				КАК ИНН
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Наименование 			= Выборка.Наименование;
		СтруктураВозврата.НаименованиеПолное 	= Выборка.НаименованиеПолное;
		СтруктураВозврата.ИНН 					= Выборка.ИНН;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет выполняются ли необходимые автоматические условия для подписи документа.
// 
// Параметры:
//  ЭлектронныйДокумент - ссылка на присоединенный файл.
//
Функция ЭлектронныйДокументГотовКПодписи(ЭлектронныйДокумент) Экспорт
	
	Возврат Истина;
КонецФункции

// Процедура позволяет установить флаг принудительного запуска обработчика обновления.
//
// Параметры:
//  ВерсияОбрабочтика - строка - версия обработчика для запуска при обновлении;
//  ФлагПринудительногоЗапускаОбработчика - булево - признак запуска обработчика.
//
Процедура ОпределитьФлагЗапускаОбработчикаОбновления(ВерсияОбрабочтика, ФлагПринудительногоЗапускаОбработчика) Экспорт
	
	Если ВерсияОбрабочтика = "1.0.5" Тогда
		ФлагПринудительногоЗапускаОбработчика = Истина;
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// Получение данных для формирования электронных документов

Процедура ОбработатьТаблицуТоваров(ТаблицаТоваров) Экспорт
	
	Для Каждого Строка из ТаблицаТоваров Цикл
		
		Строка.БазоваяЕдиницаКод = СокрЛП(Строка.БазоваяЕдиницаКод);
		Строка.УпаковкаКод = СокрЛП(Строка.УпаковкаКод);
		
		// Cформируем идентификатор
		ИДТовара = Строка.Номенклатура.УникальныйИдентификатор();
		ИДХарактеристики = ?(ЗначениеЗаполнено(Строка.Характеристика), Строка.Характеристика.УникальныйИдентификатор(), "");
		
		Строка.ИД = Строка(ИДТовара) + "#" + Строка(ИДХарактеристики) + "#";
		
		// Сформируем наименование
		Строка.Наименование = Строка.Наименование + ?(ЗначениеЗаполнено(Строка.Характеристика), " (" + Строка.Характеристика + ")", "");
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в таблицу значений строки из другой таблицы значений и 
// в них значения колонок с совпадающими наименованиями.
//
// Параметры:
//  ТаблицаИсточник - таблица значений или массив строк таблицы значений, откуда берутся значения.
//  ТаблицаПриемник - таблица значений, куда добавляются строки.
//  ЗаполнятьНомераСтрокПоИсточнику - Булево - определяет необходимость сохранения информации
//		об индексах строк таблицы-источника в таблице-приемнике.
//		Используется в тех случаях, когда необходимо выполнить сопоставление строк приемника и источника.
//
Процедура ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник, ЗаполнятьНомераСтрокПоИсточнику = Ложь) Экспорт
	
	// Заполним значения в совпадающих колонках.
	Для Каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл
		
		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
		
		Если ЗаполнятьНомераСтрокПоИсточнику Тогда
			СтрокаТаблицыПриемника.НомерСтроки = СтрокаТаблицыИсточника.Владелец().Индекс(СтрокаТаблицыИсточника);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьВТаблицуЗначений()

Функция АдаптироватьПолученныйЭлемент(ИмяРеквизита) Экспорт
	
	Если ВРЕГ(ИмяРеквизита) = ВРЕГ("НомерПоДаннымПокупателя") 
		ИЛИ ВРЕГ(ИмяРеквизита) = ВРЕГ("НомерПоДаннымПоставщика")  Тогда
		
		ЗначениеКлюча = "НомерВходящегоДокумента";
		
	ИначеЕсли ВРЕГ(ИмяРеквизита) = ВРЕГ("ДатаПоДаннымПокупателя")
		ИЛИ ВРЕГ(ИмяРеквизита) = ВРЕГ("ДатаПоДаннымПоставщика") Тогда
		
		ЗначениеКлюча = "ДатаВходящегоДокумента";
		
	Иначе
		
		ЗначениеКлюча = ИмяРеквизита;
		
	КонецЕсли;
	
	Возврат ЗначениеКлюча;
	
КонецФункции

Функция ДобавитьВТекстЗапросаОтборПоРеквизитуСТипомДата(ТекстЗапроса, ИмяРеквизита) Экспорт
	
	Возврат ТекстЗапроса +
		" И КОНЕЦПЕРИОДА(ДокументПоиска." + ИмяРеквизита + ", ДЕНЬ) = КОНЕЦПЕРИОДА(&" + ИмяРеквизита + ", ДЕНЬ)";
	
КонецФункции

Функция ДобавитьВТекстЗапросаОтборПоПроизвольномуРеквизиту(ТекстЗапроса, ИмяРеквизита) Экспорт
	
	Возврат ТекстЗапроса +
		" И ДокументПоиска." + ИмяРеквизита + " = &" + ИмяРеквизита;
		
КонецФункции

Функция ИскатьДокументПоРеквизитам(СтруктураРеквизитов, Запрос) Экспорт
	
	Если СтруктураРеквизитов <> Неопределено
		И СтруктураРеквизитов.Количество() > 0 Тогда
		
		Для Каждого ТекущийЭлемент Из СтруктураРеквизитов Цикл
			
			ИмяРеквизита = АдаптироватьПолученныйЭлемент(ТекущийЭлемент.Ключ);
			
			Запрос.Текст = ?(СтрНайти(ВРег(ИмяРеквизита), ВРег("Дата")) > 0,
				ДобавитьВТекстЗапросаОтборПоРеквизитуСТипомДата(Запрос.Текст, ИмяРеквизита), // Для даты поведение отличается
				ДобавитьВТекстЗапросаОтборПоПроизвольномуРеквизиту(Запрос.Текст, ИмяРеквизита));
			
			Запрос.УстановитьПараметр(ИмяРеквизита, ТекущийЭлемент.Значение);
			
		КонецЦикла;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Возврат Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Для того, чтобы передать дополнительные данные в печатную форму, надо:
//
// 1. в функции подготовки данных (в переопределяемом модуле) создать структуру, где ключ - имя передаваемого
//  дополнительного параметра, а значение - соответственно, значение доп.параметра и передать в интерфейсную функцию
//  "ОбменСКонтрагентами.ДобавитьДанныеВДеревоДопДанных" (описание параметров в комментарии к ней).
//
// 2. в функции подготовки данных к печати "ПолучитьДанные...ДляПечати", прописать чтение передаваемых
//  доп.данных по имени (с которым доп параметр помещался в структуру на шаге 1) и присвоение требуемому реквизиту макета.
//
Функция ДеревоДопДанных() Экспорт
	
	ДеревоДанных = Новый ДеревоЗначений;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Структура"));
	МассивТипов.Добавить(Тип("Массив"));
	МассивТипов.Добавить(Тип("Строка"));
	ТипСтруктураМассивСтрока = Новый ОписаниеТипов(МассивТипов);
	
	ДеревоДанных.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ДеревоДанных.Колонки.Добавить("ЗначениеРеквизита", ТипСтруктураМассивСтрока);
	ДеревоДанных.Колонки.Добавить("ЮридическиЗначимый", Новый ОписаниеТипов("Булево"));
	ДеревоДанных.Колонки.Добавить("ТЧ", Новый ОписаниеТипов("Булево"));
	
	Возврат ДеревоДанных;
	
КонецФункции

Функция ПолучитьДанныеЗаказПокупателя(СсылкаНаОбъект) Экспорт

	ДанныеДокумента = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Номер КАК НомерДокумента,
	|	ЗаказПокупателя.Дата КАК ДатаДокумента,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПокупателя.ВалютаДокумента.Код КАК ВалютаКод,
	|	ЗаказПокупателя.Организация.Префикс КАК Префикс,
	|	ЗаказПокупателя.Курс КАК КурсВзаиморасчетов,
	|	ЗаказПокупателя.БанковскийСчет.НомерСчета КАК НомерСчета,
	|	ЗаказПокупателя.БанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	ЗаказПокупателя.БанковскийСчет.Банк.Код КАК МФО,
	|	ЗаказПокупателя.БанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	ЗаказПокупателя.БанковскийСчет.БанкРасчетов КАК БанкДляРасчетов,
	|	ЗаказПокупателя.Комментарий,
	|	ЗаказПокупателя.Договор.НомерДоговора КАК ДоговорНомер,
	|	ЗаказПокупателя.Договор.ДатаДоговора КАК ДоговорДата,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ЗаказПокупателя.НомерВходящегоДокумента КАК НомерПоДаннымКлиента,
	|	ЗаказПокупателя.ДатаВходящегоДокумента КАК ДатаПоДаннымКлиента,
	|	ЗаказПокупателя.Договор.Наименование
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ ПОДСТРОКА(ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное, 1, 50)
	|	КОНЕЦ КАК Наименование,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.Характеристика.Наименование КАК НаименованиеХарактеристики,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиница,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияКоэффициент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПокупателяЗапасы.Количество
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Количество * ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПокупателяЗапасы.Цена
	|		КОГДА ЗаказПокупателяЗапасы.Количество * ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент <> 0
	|			ТОГДА ЗаказПокупателяЗапасы.Сумма / (ЗаказПокупателяЗапасы.Количество * ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Ссылка.СуммаВключаетНДС КАК НДСУчтеноВСумме,
	|	0 КАК СуммаСкидки,
	|	0 КАК ПроцентСкидки,
	|	ЗаказПокупателяЗапасы.Сумма КАК СуммаСНДС,
	|	ЗаказПокупателяЗапасы.Номенклатура.Комментарий КАК Описание,
	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Результат = Запрос.ВыполнитьПакет();
	
	Шапка = Результат[0].Выбрать();
	Шапка.Следующий();
	
	ДанныеДокумента.Вставить("РеквизитыШапки", Шапка);
	
	ТаблицаТоваров = Результат[1].Выгрузить();
	ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаТоваров);
	
	Возврат ДанныеДокумента;

КонецФункции

Функция ПолучитьДанныеЗаказПоставщику(СсылкаНаОбъект) Экспорт

	ДанныеДокумента = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК Ссылка,
	|	ЗаказПоставщику.Номер КАК НомерДокумента,
	|	ЗаказПоставщику.Дата КАК ДатаДокумента,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПоставщику.ВалютаДокумента.Код КАК ВалютаКод,
	|	ЗаказПоставщику.Организация.Префикс КАК Префикс,
	|	ЗаказПоставщику.Курс КАК КурсВзаиморасчетов,
	|	ЗаказПоставщику.БанковскийСчет.НомерСчета КАК НомерСчета,
	|	ЗаказПоставщику.БанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	ЗаказПоставщику.БанковскийСчет.Банк.Код КАК МФО,
	|	ЗаказПоставщику.БанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	ЗаказПоставщику.БанковскийСчет.БанкРасчетов КАК БанкДляРасчетов,
	|	ЗаказПоставщику.Комментарий,
	|	ЗаказПоставщику.Договор.НомерДоговора КАК ДоговорНомер,
	|	ЗаказПоставщику.Договор.ДатаДоговора КАК ДоговорДата,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ЗаказПоставщику.Договор.Наименование
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НоменклатураПоставщиков.Ссылка, НЕОПРЕДЕЛЕНО) КАК НоменклатураПоставщика,
	|	ЕСТЬNULL(НоменклатураПоставщиков.Идентификатор, НЕОПРЕДЕЛЕНО) КАК ИдТовараУКонтрагента,
	|	ЕСТЬNULL(НоменклатураПоставщиков.Артикул, """") КАК Артикул,
	|	ЕСТЬNULL(НоменклатураПоставщиков.Наименование, """") КАК Наименование,
	|	ЗаказПоставщику.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщику.Характеристика КАК Характеристика,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиница,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|	ЗаказПоставщику.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияКоэффициент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщику.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщику.Количество
	|		ИНАЧЕ ЗаказПоставщику.Количество * ЗаказПоставщику.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщику.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщику.Цена
	|		КОГДА ЗаказПоставщику.Количество * ЗаказПоставщику.ЕдиницаИзмерения.Коэффициент <> 0
	|			ТОГДА ЗаказПоставщику.Сумма / (ЗаказПоставщику.Количество * ЗаказПоставщику.ЕдиницаИзмерения.Коэффициент)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ЗаказПоставщику.Сумма КАК Сумма,
	|	ЗаказПоставщику.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПоставщику.СуммаНДС КАК СуммаНДС,
	|	ЗаказПоставщику.Ссылка.СуммаВключаетНДС КАК НДСУчтеноВСумме,
	|	0 КАК СуммаСкидки,
	|	0 КАК ПроцентСкидки,
	|	ЗаказПоставщику.Сумма КАК СуммаСНДС,
	|	ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления,
	|	ЗаказПоставщику.Содержание КАК Содержание
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|		ПО (НоменклатураПоставщиков.Владелец = ЗаказПоставщику.Ссылка.Контрагент)
	|			И (НоменклатураПоставщиков.Номенклатура = ЗаказПоставщику.Номенклатура)
	|			И (НоменклатураПоставщиков.Характеристика = ЗаказПоставщику.Характеристика)
	|ГДЕ
	|	ЗаказПоставщику.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Результат = Запрос.ВыполнитьПакет();
	
	Шапка = Результат[0].Выбрать();
	Шапка.Следующий();
	
	ДанныеДокумента.Вставить("РеквизитыШапки", Шапка);
	
	ТаблицаТоваров = Результат[1].Выгрузить();
	ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаТоваров);
	
	Возврат ДанныеДокумента;

КонецФункции

Функция ПолучитьДанныеСчетНаОплату(СсылкаНаОбъект) Экспорт

	ДанныеДокумента = Новый Структура();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплату.Ссылка КАК Ссылка,
	|	СчетНаОплату.Номер КАК НомерДокумента,
	|	СчетНаОплату.Дата КАК ДатаДокумента,
	|	СчетНаОплату.Организация КАК Организация,
	|	СчетНаОплату.Контрагент КАК Контрагент,
	|	СчетНаОплату.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	СчетНаОплату.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетНаОплату.ВалютаДокумента.Код КАК ВалютаКод,
	|	СчетНаОплату.Организация.Префикс КАК Префикс,
	|	СчетНаОплату.Курс КАК КурсВзаиморасчетов,
	|	СчетНаОплату.БанковскийСчет.НомерСчета КАК НомерСчета,
	|	СчетНаОплату.БанковскийСчет.Банк.Наименование КАК БанкНаименование,
	|	СчетНаОплату.БанковскийСчет.Банк.Код КАК МФО,
	|	СчетНаОплату.БанковскийСчет.Банк.КоррСчет КАК КоррСчет,
	|	СчетНаОплату.БанковскийСчет.БанкРасчетов КАК БанкДляРасчетов
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуЗапасы.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуЗапасы.Номенклатура,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА СчетНаОплатуЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	СчетНаОплатуЗапасы.Номенклатура.Артикул КАК Артикул,
	|	СчетНаОплатуЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
	|	СчетНаОплатуЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетНаОплатуЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	СчетНаОплатуЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	СчетНаОплатуЗапасы.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	СчетНаОплатуЗапасы.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК ЕдиницаИзмеренияМеждународноеСокращение,
	|	СчетНаОплатуЗапасы.Количество КАК Количество,
	|	СчетНаОплатуЗапасы.Цена КАК Цена,
	|	СчетНаОплатуЗапасы.Сумма КАК Сумма,
	|	СчетНаОплатуЗапасы.СтавкаНДС,
	|	СчетНаОплатуЗапасы.СуммаНДС КАК СуммаНДС,
	|	СчетНаОплатуЗапасы.Всего КАК Всего,
	|	СчетНаОплатуЗапасы.Характеристика,
	|	СчетНаОплатуЗапасы.Содержание,
	|	СчетНаОплатуЗапасы.ПроцентСкидкиНаценки
	|ИЗ
	|	Документ.СчетНаОплату.Запасы КАК СчетНаОплатуЗапасы
	|ГДЕ
	|	СчетНаОплатуЗапасы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Результат = Запрос.ВыполнитьПакет();
	
	Шапка = Результат[0].Выбрать();
	Шапка.Следующий();
	
	ДанныеДокумента.Вставить("РеквизитыШапки", Шапка);
	
	ТаблицаРабот = Результат[1].Выгрузить();
	ДанныеДокумента.Вставить("ТаблицаРабот", ТаблицаРабот);
	
	Возврат ДанныеДокумента;

КонецФункции

Функция ПолучитьДанныеАктВыполненныхРабот(СсылкаНаОбъект) Экспорт
	
	ДанныеДокумента = Новый Структура();
	
	Запрос = Новый Запрос();
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Номер КАК НомерДокумента,
		|	РасходнаяНакладная.Дата КАК ДатаДокумента,
		|	РасходнаяНакладная.Организация КАК Организация,
		|	РасходнаяНакладная.Контрагент КАК Контрагент,
		|	РасходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	РасходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
		|	РасходнаяНакладная.ВалютаДокумента.Код КАК ВалютаКод,
		|	РасходнаяНакладная.Организация.Префикс КАК Префикс
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
		|	РасходнаяНакладнаяЗапасы.Номенклатура,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ КАК НоменклатураНаименование,
		|	РасходнаяНакладнаяЗапасы.Номенклатура.Артикул КАК Артикул,
		|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
		|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
		|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
		|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма,
		|	РасходнаяНакладнаяЗапасы.СтавкаНДС,
		|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
		|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
		|	РасходнаяНакладнаяЗапасы.Характеристика,
		|	РасходнаяНакладнаяЗапасы.Содержание,
		|	РасходнаяНакладнаяЗапасы.ПроцентСкидкиНаценки
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|ГДЕ
		|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
		|	И РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	ЗаказПокупателя.Номер КАК НомерДокумента,
		|	ЗаказПокупателя.Дата КАК ДатаДокумента,
		|	ЗаказПокупателя.Организация КАК Организация,
		|	ЗаказПокупателя.Контрагент КАК Контрагент,
		|	ЗаказПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
		|	ЗаказПокупателя.ВалютаДокумента.Код КАК ВалютаКод,
		|	ЗаказПокупателя.Организация.Префикс КАК Префикс
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяРаботы.НомерСтроки КАК НомерСтроки,
		|	ЗаказПокупателяРаботы.Номенклатура,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяРаботы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА ЗаказПокупателяРаботы.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяРаботы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ КАК НоменклатураНаименование,
		|	ЗаказПокупателяРаботы.Номенклатура.Артикул КАК Артикул,
		|	ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
		|	ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	ЗаказПокупателяРаботы.Количество КАК Количество,
		|	ЗаказПокупателяРаботы.Цена КАК Цена,
		|	ЗаказПокупателяРаботы.Сумма КАК Сумма,
		|	ЗаказПокупателяРаботы.СтавкаНДС,
		|	ЗаказПокупателяРаботы.СуммаНДС КАК СуммаНДС,
		|	ЗаказПокупателяРаботы.Всего КАК Всего,
		|	ЗаказПокупателяРаботы.Характеристика,
		|	ЗаказПокупателяРаботы.Содержание,
		|	ЗаказПокупателяРаботы.ПроцентСкидкиНаценки
		|ИЗ
		|	Документ.ЗаказПокупателя.Работы КАК ЗаказПокупателяРаботы
		|ГДЕ
		|	ЗаказПокупателяРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.НомерСтроки,
		|	ЗаказПокупателяЗапасы.Номенклатура,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА ЗаказПокупателяЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ,
		|	ЗаказПокупателяЗапасы.Номенклатура.Артикул,
		|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
		|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения,
		|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.Код,
		|	ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование,
		|	ЗаказПокупателяЗапасы.Количество,
		|	ЗаказПокупателяЗапасы.Цена,
		|	ЗаказПокупателяЗапасы.Сумма,
		|	ЗаказПокупателяЗапасы.СтавкаНДС,
		|	ЗаказПокупателяЗапасы.СуммаНДС,
		|	ЗаказПокупателяЗапасы.Всего,
		|	ЗаказПокупателяЗапасы.Характеристика,
		|	ЗаказПокупателяЗапасы.Содержание,
		|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка = &Ссылка
		|	И ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктВыполненныхРабот.Ссылка КАК Ссылка,
		|	АктВыполненныхРабот.Номер КАК НомерДокумента,
		|	АктВыполненныхРабот.Дата КАК ДатаДокумента,
		|	АктВыполненныхРабот.НомерИсправления КАК НомерИсправления,
		|	АктВыполненныхРабот.Дата КАК ДатаИсправления,
		|	АктВыполненныхРабот.Организация КАК Организация,
		|	АктВыполненныхРабот.Контрагент КАК Контрагент,
		|	АктВыполненныхРабот.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	АктВыполненныхРабот.ВалютаДокумента КАК ВалютаДокумента,
		|	АктВыполненныхРабот.ВалютаДокумента.Код КАК ВалютаКод,
		|	АктВыполненныхРабот.Организация.Префикс КАК Префикс
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
		|ГДЕ
		|	АктВыполненныхРабот.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктВыполненныхРаботРаботыИУслуги.НомерСтроки КАК НомерСтроки,
		|	АктВыполненныхРаботРаботыИУслуги.Номенклатура,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА АктВыполненныхРаботРаботыИУслуги.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(АктВыполненныхРаботРаботыИУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ КАК НоменклатураНаименование,
		|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.Артикул КАК Артикул,
		|	АктВыполненныхРаботРаботыИУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
		|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	АктВыполненныхРаботРаботыИУслуги.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	АктВыполненныхРаботРаботыИУслуги.Количество КАК Количество,
		|	АктВыполненныхРаботРаботыИУслуги.Цена КАК Цена,
		|	АктВыполненныхРаботРаботыИУслуги.Сумма КАК Сумма,
		|	АктВыполненныхРаботРаботыИУслуги.СтавкаНДС,
		|	АктВыполненныхРаботРаботыИУслуги.СуммаНДС КАК СуммаНДС,
		|	АктВыполненныхРаботРаботыИУслуги.Всего КАК Всего,
		|	АктВыполненныхРаботРаботыИУслуги.Характеристика,
		|	АктВыполненныхРаботРаботыИУслуги.Содержание
		|ИЗ
		|	Документ.АктВыполненныхРабот.РаботыИУслуги КАК АктВыполненныхРаботРаботыИУслуги
		|ГДЕ
		|	АктВыполненныхРаботРаботыИУслуги.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.АктВыполненныхРабот.РаботыИУслуги", "Документ.АктВыполненныхРабот.Запасы");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.АктВыполненныхРабот", "Документ.КорректировкаРеализации");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "АктВыполненныхРабот.Дата КАК ДатаИсправления,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "АктВыполненныхРабот.НомерИсправления КАК НомерИсправления,", "");
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Результат = Запрос.ВыполнитьПакет();
	
	Шапка = Результат[0].Выбрать();
	Шапка.Следующий();
	
	ДанныеДокумента.Вставить("РеквизитыШапки", Шапка);
	
	ТаблицаРабот = Результат[1].Выгрузить();
	ДанныеДокумента.Вставить("ТаблицаРабот", ТаблицаРабот);
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ПолучитьДанныеРеализацииТоваровИУслуг(СсылкаНаОбъект) Экспорт
	
	ДанныеДокумента = Новый Структура();
	
	// Подготовим данные шапки документа
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Номер КАК НомерПоДаннымКлиента,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.Дата КАК ДатаПоДаннымКлиента,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация КАК ЮрФизЛицо,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	РеализацияТоваровУслуг.Организация КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация КАК Руководители,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.БанковскийСчет КАК БанковскийСчет,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	РеализацияТоваровУслуг.Контрагент КАК Плательщик,
	|	NULL КАК Сделка,
	|	РеализацияТоваровУслуг.Договор.Наименование КАК ДокОснованиеНаименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Заказ.Номер
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокОснованиеНомер,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Заказ.Дата
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокОснованиеДата,
	|	NULL КАК ВедениеВзаиморасчетов,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.Курс КАК Курс,
	|	РеализацияТоваровУслуг.Кратность КАК Кратность,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.Ответственный КАК ОтпускРазрешил,
	|	РеализацияТоваровУслуг.СтруктурнаяЕдиница.МОЛ КАК ОтпускПроизвел
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", 	СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДатаСреза", 			СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", 		СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("Подразделение", 		СсылкаНаОбъект.Подразделение);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СсылкаНаОбъект.СтруктурнаяЕдиница);
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДанныеДокумента.Вставить("РеквизитыШапки", Шапка);
	
	// Подготовим данные табличных частей
	ВалютаРегламентированногоУчета = Константы.НациональнаяВалюта.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслуг.Номенклатура.Код КАК КодТовара,
	|	РеализацияТоваровУслуг.Номенклатура.Артикул КАК Артикул,
	|	РеализацияТоваровУслуг.Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатуры,
	|	РеализацияТоваровУслуг.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслуг.Количество КАК Количество,
	|	РеализацияТоваровУслуг.Сумма * &Курс / &Кратность КАК Сумма,
	|	РеализацияТоваровУслуг.Всего * &Курс / &Кратность - РеализацияТоваровУслуг.СуммаНДС * &Курс / &Кратность КАК СуммаБезНДС,
	|	РеализацияТоваровУслуг.Всего * &Курс / &Кратность КАК СуммаСНДС,
	|	РеализацияТоваровУслуг.Цена * &Курс / &Кратность КАК Цена,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Характеристика) КАК НаименованиеХарактеристики,
	|	РеализацияТоваровУслуг.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиница,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	РеализацияТоваровУслуг.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеализацияТоваровУслуг.ЕдиницаИзмерения КАК Упаковка,
	|	РеализацияТоваровУслуг.ЕдиницаИзмерения.Код КАК УпаковкаКод,
	|	РеализацияТоваровУслуг.ЕдиницаИзмерения.Наименование КАК УпаковкаНаименование,
	|	РеализацияТоваровУслуг.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслуг.СуммаНДС * &Курс / &Кратность КАК СуммаНДС,
	|	"""" КАК ВидУпаковки,
	|	0 КАК СуммаСкидки,
	|	1 КАК Коэффициент,
	|	0 КАК КоличествоМест,
	|	0 КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Заказ.Номер
	|		КОГДА РеализацияТоваровУслуг.Ссылка.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Ссылка.Заказ.Номер
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НомерЗаказаПокупателя,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Заказ.Дата
	|		КОГДА РеализацияТоваровУслуг.Ссылка.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Ссылка.Заказ.Дата
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДатаЗаказаПокупателя,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Заказ.НомерВходящегоДокумента
	|		КОГДА РеализацияТоваровУслуг.Ссылка.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Ссылка.Заказ.НомерВходящегоДокумента
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НомерЗаказаПоДаннымПокупателя,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Заказ.ДатаВходящегоДокумента
	|		КОГДА РеализацияТоваровУслуг.Ссылка.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И РеализацияТоваровУслуг.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	|			ТОГДА РеализацияТоваровУслуг.Ссылка.Заказ.ДатаВходящегоДокумента
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДатаЗаказаПоДаннымПокупателя
	
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, СсылкаНаОбъект.Дата);
	
	Запрос.УстановитьПараметр("Курс",		КурсВалюты.Курс);
	Запрос.УстановитьПараметр("Кратность",	КурсВалюты.Кратность);
	Запрос.УстановитьПараметр("Ссылка",		СсылкаНаОбъект);
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	// Вычислим курс документа для печати
	
	ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаТоваров);
	
	Возврат ДанныеДокумента;
	
КонецФункции

Процедура ЗаполнитьФИОиДолжность(СтруктураПриемник, ИсточникДанных, Должность = Неопределено) Экспорт
	
	Если ТипЗнч(ИсточникДанных) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПриемник, ИсточникДанных);
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("Строка") Тогда
		Фамилия = ""; 
		Имя = ""; 
		Отчество = "";
		ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(ИсточникДанных, Фамилия, Имя, Отчество);
		СтруктураПриемник.Вставить("Фамилия", Фамилия);
		СтруктураПриемник.Вставить("Имя", Имя);
		СтруктураПриемник.Вставить("Отчество", Отчество);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Должность) Тогда
		СтруктураПриемник.Вставить("Должность", Должность);
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавляет новую строку в таблицы данных структуры параметров
//
Процедура ДобавитьСтрокуТаблицуДанных(ТаблицаДанных, ДанныеСтроки, СтруктураПараметров, ИмяЭлементаВладельцаДопДанных) Экспорт
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
	
	НоваяСтрока.МассаНетто = ДанныеСтроки.Количество;
	
	// Сформируем доп. параметры
	СтруктураДопДанных = ПолучитьСтруктуруДопДанныхНоменклатуры(
		ДанныеСтроки.Номенклатура, 
		ДанныеСтроки.Характеристика, 
		ДанныеСтроки.НаименованиеНоменклатуры);
	
	Если ЗначениеЗаполнено(ДанныеСтроки.НомерЗаказаПокупателя)
		И ЗначениеЗаполнено(ДанныеСтроки.ДатаЗаказаПокупателя) Тогда
		
		СтруктураДопДанных.Вставить("НомерПоДаннымПоставщика", ДанныеСтроки.НомерЗаказаПокупателя);
		СтруктураДопДанных.Вставить("ДатаПоДаннымПоставщика", ДанныеСтроки.ДатаЗаказаПокупателя);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.НомерЗаказаПоДаннымПокупателя)
		И ЗначениеЗаполнено(ДанныеСтроки.ДатаЗаказаПоДаннымПокупателя) Тогда
		
		СтруктураДопДанных.Вставить("НомерЗаказаПоДаннымПокупателя", ДанныеСтроки.НомерЗаказаПоДаннымПокупателя);
		СтруктураДопДанных.Вставить("ДатаЗаказаПоДаннымПокупателя", ДанныеСтроки.ДатаЗаказаПоДаннымПокупателя);
		
	КонецЕсли;
	
	// Из-за особенностей в схеме ФНС некоторые ставки НДС необходимо передавать в доп. параметрах.
	Если ТаблицаДанных.Колонки.Найти("СтавкаНДС") <> Неопределено Тогда
		// В ТОРГ12 не предусмотрена передача "дробных" ставок НДС
		
		СоответствиеСтавокНДС = Новый Соответствие;
		СоответствиеСтавокНДС.Вставить(ОбменСКонтрагентамиПереопределяемый.ЗначениеПеречисленияСтавкаНДС("18% / 118%#"), 
			ОбменСКонтрагентамиПереопределяемый.ЗначениеПеречисленияСтавкаНДС("18%#"));
		СоответствиеСтавокНДС.Вставить(ОбменСКонтрагентамиПереопределяемый.ЗначениеПеречисленияСтавкаНДС("10% / 110%#"), 
			ОбменСКонтрагентамиПереопределяемый.ЗначениеПеречисленияСтавкаНДС("10%#"));
		
		Если СоответствиеСтавокНДС[НоваяСтрока.СтавкаНДС] <> Неопределено Тогда
			
			// "Дробную" ставку НДС передадим в структуре доп. параметров
			СтруктураДопДанных.Вставить("СтавкаНДС", НоваяСтрока.СтавкаНДС);
			
			// В схему передадим соответствующую ставку НДС "числом"
			НоваяСтрока.СтавкаНДС = СоответствиеСтавокНДС[НоваяСтрока.СтавкаНДС];
			
		КонецЕсли;
		
	Иначе
		
		// В Акте не предусмотрена передача ставки НДС
		СтруктураДопДанных.Вставить("СтавкаНДС", ДанныеСтроки.СтавкаНДС);
		
	КонецЕсли;
	
	ОбменСКонтрагентами.ДобавитьДанныеВДеревоДопДанных(СтруктураПараметров, СтруктураДопДанных, ИмяЭлементаВладельцаДопДанных, Истина, НоваяСтрока.НомерСтроки);
	
КонецПроцедуры

Функция СтруктураИтоговыеСуммы(ТаблицаТоваров) Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("КоличествоМест", ТаблицаТоваров.Итог("КоличествоМест"));
	Структура.Вставить("МассаБрутто",    ТаблицаТоваров.Итог("МассаБрутто"));
	Структура.Вставить("МассаНетто",     ТаблицаТоваров.Итог("МассаНетто"));
	Структура.Вставить("СуммаБезНДС",    ТаблицаТоваров.Итог("СуммаБезНДС"));
	Структура.Вставить("СуммаНДС",       ТаблицаТоваров.Итог("СуммаНДС"));
	Структура.Вставить("СуммаСНДС",      ТаблицаТоваров.Итог("СуммаБезНДС") + ТаблицаТоваров.Итог("СуммаНДС"));
	Структура.Вставить("КоличествоПорядковыхНомеровЗаписей", ТаблицаТоваров.Количество());
	
	Возврат Структура;
	
КонецФункции

Процедура ЗаполнитьРеквизитыУчастниковТОРГ12(ДанныеПечати, СтруктураПараметров) Экспорт
	
	СведенияОПоставщике			= ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеПечати.Организация);
	СведенияОПокупателе			= ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеПечати.Покупатель);
	СведенияОГрузополучателе	= ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеПечати.Грузополучатель);
	СведенияОГрузоотправителе	= ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеПечати.Грузоотправитель);
	
	//ЗаполнитьСведенияУчастникаОбмена(СтруктураПараметров.Поставщик, СведенияОПоставщике);
	
	Если ДанныеПечати.Организация <> ДанныеПечати.Грузоотправитель Тогда
		
		ЗаполнитьСведенияУчастникаОбмена(СтруктураПараметров.СведенияОГрузоотправителе.Грузоотправитель, СведенияОГрузоотправителе, "Факт");
		СтруктураПараметров.СведенияОГрузоотправителе.СтруктурноеПодразделение = ДанныеПечати.Подразделение;
		
	КонецЕсли;
	
	//ЗаполнитьСведенияУчастникаОбмена(СтруктураПараметров.Плательщик,      СведенияОПокупателе);
	//ЗаполнитьСведенияУчастникаОбмена(СтруктураПараметров.Грузополучатель, СведенияОГрузополучателе, "Факт");
	
КонецПроцедуры

Процедура ЗаполнитьСведенияУчастникаОбмена(СтруктураУчастника, Участник, СведенияОбУчастнике, ВидАдреса = "Юр") Экспорт
	
	СтруктураУчастника.Вставить("КодОКПО",					СведенияОбУчастнике.КодПоОКПО);
	СтруктураУчастника.Вставить("НаименованиеОрганизации",	СведенияОбУчастнике.ПолноеНаименование);
	СтруктураУчастника.Вставить("ИНН",						СведенияОбУчастнике.ИНН);
	СтруктураУчастника.Вставить("КодОКОПФ",					"");
	СтруктураУчастника.Вставить("ЭтоФизЛицо",				СведенияОбУчастнике.ЮрФизЛицо <> Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	
	Если СведенияОбУчастнике.ЮрФизЛицо <> Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		ЗаполнитьФИОиДолжность(СтруктураУчастника, СведенияОбУчастнике.ПолноеНаименование);
		
	КонецЕсли;
	
	// Типы адресов представлены списком значений, в котором Представление элемента - описание типа (Структурированный,
	// Произвольный, Иностранный), значение элемента - структура описывающая поля адреса, пометка - указывает, из какого
	// элемента списка брать данные при заполнении ЭД.
	СтруктураАдреса = Новый Структура;
	ТекстОшибки = "";
	
	ОбменСКонтрагентамиПереопределяемый.ПолучитьАдресСтруктурой(СтруктураАдреса, СведенияОбУчастнике, "Ссылка", ВидАдреса, ТекстОшибки);
	ЗаполнитьАдресВСпискеТиповАдресов(СтруктураУчастника.Адрес, СтруктураАдреса, "Структурированный");
	
	СтруктураУчастника.Вставить("Телефон", СведенияОбУчастнике.Телефоны);
	СтруктураУчастника.Вставить("Факс");
	
	СтруктураБанковскийСчет = СтруктураУчастника.БанковскийСчет;
	СтруктураБанковскийСчет.Вставить("МФО", СведенияОбУчастнике.МФО);
	СтруктураБанковскийСчет.Вставить("НаимБанк", ?(ЗначениеЗаполнено(СведенияОбУчастнике.Банк), СведенияОбУчастнике.Банк.Наименование, ""));
	СтруктураБанковскийСчет.Вставить("НомерСчета ", СведенияОбУчастнике.НомерСчета);
	
КонецПроцедуры

// Заполняет соответствующий тип адреса переданными данными.
// Параметры:
//  СписокТиповАдресов - СписокЗначений - Представление элемента - описание типа (Структурированный,
//    Произвольный, Иностранный), значение элемента - структура описывающая поля адреса, пометка - указывает, из какого
//    элемента списка брать данные при заполнении ЭД.
//  АдресУчастника - Структура - содержит данные адреса участника обмена. Имена полей структуры должны совпадать с
//    именами полей структуры выбранного типа адреса:
//    Структурированный - "Индекс, КодРегион, Район, Город, НаселПункт, Улица, Дом, Корпус, Кварт";
//    Произвольный/Иностранный - "КодСтраны, АдресСтрокой" (вынесены в разные элементы списка для того,
//      чтобы правильно заполнить ЭД).
//  ТипАдреса - Строка - один из 3-х вариантов: Структурированный, Произвольный, Иностранный.
//
Процедура ЗаполнитьАдресВСпискеТиповАдресов(СписокТиповАдресов, АдресУчастника, ТипАдреса = "Структурированный") Экспорт
	
	// Типы адресов представлены списком значений, в котором Представление элемента - описание типа (Структурированный,
	// Произвольный, Иностранный), значение элемента - структура описывающая поля адреса, пометка - указывает, из какого
	// элемента списка брать данные при заполнении ЭД.
	СписокТиповАдресов.ЗаполнитьПометки(Ложь);
	ВыбранныйТипАдреса = Неопределено;
	Для Каждого Элемент Из СписокТиповАдресов Цикл
		Если Элемент.Представление = ТипАдреса Тогда
			ВыбранныйТипАдреса = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ВыбранныйТипАдреса <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ВыбранныйТипАдреса.Значение, АдресУчастника);
		ВыбранныйТипАдреса.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует структуру с данными номенклатуры для передачи ее в доп. данных
//
Функция ПолучитьСтруктуруДопДанныхНоменклатуры(Номенклатура, Характеристика, НаименованиеНоменклатуры = "") Экспорт
	
	СтруктураДополнительныхДанных = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) 
		ИЛИ ПустаяСтрока(НаименованиеНоменклатуры) Тогда
		
		Возврат СтруктураДополнительныхДанных;
		
	КонецЕсли;
	
	ИДТовара 			= Номенклатура.УникальныйИдентификатор();
	ИДХарактеристики	= "";
	НаименованиеЗапаса	= НаименованиеНоменклатуры;
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		
		ИДХарактеристики	= Характеристика.УникальныйИдентификатор();
		НаименованиеЗапаса	= НаименованиеЗапаса + " (" + Характеристика + ")";
		
	КонецЕсли;
	
	СтруктураДополнительныхДанных.Вставить("ИД", 			 Строка(ИДТовара) + "#" + Строка(ИДХарактеристики) + "#");
	СтруктураДополнительныхДанных.Вставить("Наименование", 	 НаименованиеЗапаса);
	Если ЗначениеЗаполнено(Характеристика) Тогда
		СтруктураДополнительныхДанных.Вставить("Характеристика", Характеристика);
	КонецЕсли;
	
	Возврат СтруктураДополнительныхДанных;
	
КонецФункции // ПолучитьСтруктуруДопДанныхНоменклатуры()

// При копирировании документов ключевые поля ЭДО требуют отчистки
//
Процедура ОчиститьДатуНомерВходящегоДокумента(ДокументОбъект) Экспорт
	
	МассивИменРеквизитов	= ПолучитьМассивИменРеквизитовКОчистке();
	МетаданныеДокумента 	= ДокументОбъект.Метаданные();
	
	Для каждого ЭлементМассива Из МассивИменРеквизитов Цикл
		
		Если НЕ МетаданныеДокумента.Реквизиты.Найти(ЭлементМассива) = Неопределено Тогда
			
			ДокументОбъект[ЭлементМассива] = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОчиститьДатуНомерВходящегоДокумента()

Функция ПолучитьМассивИменРеквизитовКОчистке() Экспорт
	
	МассивИмен = Новый Массив;
	
	МассивИмен.Добавить("НомерВходящегоДокумента");
	МассивИмен.Добавить("ДатаВходящегоДокумента");
	
	МассивИмен.Добавить("НомерИсходногоДокумента");
	МассивИмен.Добавить("ДатаИсходногоДокумента");
	
	Возврат МассивИмен;
	
КонецФункции

// Функция получает данные для формирования структуры электронного документа ТОРГ - 12
//
Функция ПолучитьДанныеДляТОРГ12(ТекущийДокумент, БезУслуг = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Дата КАК ДатаДокумента,
		|	ЗаказПокупателя.Номер КАК НомерДокумента,
		|	ЗаказПокупателя.Дата КАК ДатаИсправления,
		|	"""" КАК НомерИсправления,
		|	ЗаказПокупателя.Организация КАК Руководители,
		|	ЗаказПокупателя.Организация.Префикс КАК Префикс,
		|	ЗаказПокупателя.Организация КАК Организация,
		|	ЗаказПокупателя.БанковскийСчет КАК БанковскийСчет,
		|	ЗаказПокупателя.Контрагент КАК Контрагент,
		|	ЗаказПокупателя.Организация КАК Поставщик,
		|	ЗаказПокупателя.Организация КАК Грузополучатель,
		|	ЗаказПокупателя.Контрагент КАК Грузоотправитель,
		|	ЗаказПокупателя.Контрагент КАК Плательщик,
		|	ЗаказПокупателя.Договор.Представление КАК Основание,
		|	ЗаказПокупателя.Договор.ДатаДоговора КАК ОснованиеДата,
		|	ЗаказПокупателя.Договор.НомерДоговора КАК ОснованиеНомер,
		|	ЗаказПокупателя.ВалютаДокумента,
		|	ЗаказПокупателя.СуммаВключаетНДС,
		|	ЗаказПокупателя.НДСВключатьВСтоимость,
		|	ЗаказПокупателя.Курс,
		|	ЗаказПокупателя.Кратность,
		|	ЗаказПокупателя.ВалютаДокумента.Код КАК ВалютаКод
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &ТекущийДокумент";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Дата КАК ДатаДокумента,
		|	РасходнаяНакладная.Номер КАК НомерДокумента,
		|	РасходнаяНакладная.Дата КАК ДатаИсправления,
		|	РасходнаяНакладная.НомерИсправления КАК НомерИсправления,
		|	РасходнаяНакладная.Организация КАК Руководители,
		|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
		|	РасходнаяНакладная.Организация КАК Организация,
		|	РасходнаяНакладная.БанковскийСчет КАК БанковскийСчет,
		|	РасходнаяНакладная.Контрагент КАК Контрагент,
		|	РасходнаяНакладная.Организация КАК Поставщик,
		|	ВЫБОР
		|		КОГДА РасходнаяНакладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА РасходнаяНакладная.Контрагент
		|		ИНАЧЕ РасходнаяНакладная.Грузополучатель
		|	КОНЕЦ КАК Грузополучатель,
		|	ВЫБОР
		|		КОГДА РасходнаяНакладная.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА РасходнаяНакладная.Организация
		|		ИНАЧЕ РасходнаяНакладная.Грузоотправитель
		|	КОНЕЦ КАК Грузоотправитель,
		|	РасходнаяНакладная.Контрагент КАК Плательщик,
		|	РасходнаяНакладная.Договор.Представление КАК Основание,
		|	РасходнаяНакладная.Договор.ДатаДоговора КАК ОснованиеДата,
		|	РасходнаяНакладная.Договор.НомерДоговора КАК ОснованиеНомер,
		|	РасходнаяНакладная.ВалютаДокумента,
		|	РасходнаяНакладная.СуммаВключаетНДС,
		|	РасходнаяНакладная.НДСВключатьВСтоимость,
		|	РасходнаяНакладная.Курс,
		|	РасходнаяНакладная.Кратность,
		|	РасходнаяНакладная.ВалютаДокумента.Код КАК ВалютаКод,
		|	РасходнаяНакладная.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &ТекущийДокумент";
		
		Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РасходнаяНакладная", "Документ.КорректировкаРеализации");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасходнаяНакладная.ДатаДокумента КАК ДатаИсправления,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасходнаяНакладная.НомерИсправления КАК НомерИсправления,", "");
		КонецЕсли;
	КонецЕсли;
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ИспользоватьПересчет = (НЕ Шапка.ВалютаДокумента = Константы.НациональнаяВалюта.Получить());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА ВложенныйЗапрос.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ КАК НаименованиеНоменклатуры,
		|	ВложенныйЗапрос.Номенклатура.Код КАК КодТовара,
		|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Наименование КАК БазоваяЕдиницаНаименование,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Код КАК БазоваяЕдиницаКод,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Наименование КАК ЕдиницаИзмерения,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДокумент КАК ЕдиницаИзмеренияДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
		|	0 КАК КоличествоВОдномМесте,
		|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
		|	ВложенныйЗапрос.СтавкаНДС.Ставка КАК СтавкаНДСЧислом,
		|	&Цена_Параметр КАК Цена,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	0 КАК КоличествоМест,
		|	&Сумма_Параметр КАК Сумма,
		|	&СуммаНДС_Параметр КАК СуммаНДС,
		|	&Всего_Параметр КАК СуммаСНДС,
		|	1 КАК ID,
		|	0 КАК МассаНетто,
		|	0 КАК МассаБрутто,
		|	НЕОПРЕДЕЛЕНО КАК Упаковка,
		|	ВложенныйЗапрос.Содержание
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|		ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДляПечати,
		|		ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
		|		ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
		|		ЗаказПокупателяЗапасы.Цена КАК Цена,
		|		СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
		|		СУММА(ЗаказПокупателяЗапасы.Сумма) КАК Сумма,
		|		СУММА(ЗаказПокупателяЗапасы.СуммаНДС) КАК СуммаНДС,
		|		СУММА(ЗаказПокупателяЗапасы.Всего) КАК Всего,
		|		МИНИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки,
		|		ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		|		ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание,
		|		ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Номенклатура.Комментарий КАК СТРОКА(1000)) КАК Описание
		|	ИЗ
		|		Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|	ГДЕ
		|		ЗаказПокупателяЗапасы.Ссылка = &ТекущийДокумент
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказПокупателяЗапасы.Номенклатура,
		|		ЗаказПокупателяЗапасы.Номенклатура.ЕдиницаИзмерения,
		|		ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
		|		ЗаказПокупателяЗапасы.СтавкаНДС,
		|		ЗаказПокупателяЗапасы.Цена,
		|		ЗаказПокупателяЗапасы.Характеристика,
		|		ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Содержание КАК СТРОКА(1000)),
		|		ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Номенклатура.Комментарий КАК СТРОКА(1000))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказПокупателяРаботы.Номенклатура,
		|		ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения,
		|		ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения,
		|		ЗаказПокупателяРаботы.СтавкаНДС,
		|		ЗаказПокупателяРаботы.Цена,
		|		СУММА(ЗаказПокупателяРаботы.Количество),
		|		СУММА(ЗаказПокупателяРаботы.Сумма),
		|		СУММА(ЗаказПокупателяРаботы.СуммаНДС),
		|		СУММА(ЗаказПокупателяРаботы.Всего),
		|		МИНИМУМ(ЗаказПокупателяРаботы.НомерСтроки),
		|		ЗаказПокупателяРаботы.Характеристика,
		|		ВЫРАЗИТЬ(ЗаказПокупателяРаботы.Содержание КАК СТРОКА(1000)),
		|		ВЫРАЗИТЬ(ЗаказПокупателяРаботы.Номенклатура.Комментарий КАК СТРОКА(1000))
		|	ИЗ
		|		Документ.ЗаказПокупателя.Работы КАК ЗаказПокупателяРаботы
		|	ГДЕ
		|		ЗаказПокупателяРаботы.Ссылка = &ТекущийДокумент
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказПокупателяРаботы.Номенклатура,
		|		ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения,
		|		ЗаказПокупателяРаботы.СтавкаНДС,
		|		ЗаказПокупателяРаботы.Цена,
		|		ЗаказПокупателяРаботы.Характеристика,
		|		ВЫРАЗИТЬ(ЗаказПокупателяРаботы.Содержание КАК СТРОКА(1000)),
		|		ВЫРАЗИТЬ(ЗаказПокупателяРаботы.Номенклатура.Комментарий КАК СТРОКА(1000)),
		|		ЗаказПокупателяРаботы.Номенклатура.ЕдиницаИзмерения) КАК ВложенныйЗапрос
		|ГДЕ
		|	&УсловиеФильтраУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	ID";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Содержание КАК Содержание,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА ВложенныйЗапрос.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ КАК НаименованиеНоменклатуры,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.Характеристика.Код КАК КодХарактеристики,
		|	ВложенныйЗапрос.Характеристика.Наименование КАК НаименованиеХарактеристики,
		|	ВложенныйЗапрос.Номенклатура.Код КАК КодТовара,
		|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Наименование КАК БазоваяЕдиницаНаименование,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Код КАК БазоваяЕдиницаКод,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Наименование КАК ЕдиницаИзмерения,
		|	ВложенныйЗапрос.ЕдиницаИзмеренияДокумент КАК ЕдиницаИзмеренияДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
		|	0 КАК КоличествоВОдномМесте,
		|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
		|	ВложенныйЗапрос.СтавкаНДС.Ставка КАК СтавкаНДСЧислом,
		|	&Цена_Параметр КАК Цена,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	0 КАК КоличествоМест,
		|	&Сумма_Параметр КАК Сумма,
		|	&СуммаНДС_Параметр КАК СуммаНДС,
		|	&Всего_Параметр КАК СуммаСНДС,
		|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		|	1 КАК ID,
		|	0 КАК МассаНетто,
		|	0 КАК МассаБрутто,
		|	НЕОПРЕДЕЛЕНО КАК Упаковка,
		|	ВложенныйЗапрос.Описание КАК Описание
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|		РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДляПечати,
		|		РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
		|		РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
		|		РасходнаяНакладнаяЗапасы.Цена КАК Цена,
		|		СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество,
		|		СУММА(РасходнаяНакладнаяЗапасы.Сумма) КАК Сумма,
		|		СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС,
		|		СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Всего,
		|		МИНИМУМ(РасходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки,
		|		РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|		ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание,
		|		ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.Комментарий КАК СТРОКА(1000)) КАК Описание
		|	ИЗ
		|		Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|	ГДЕ
		|		РасходнаяНакладнаяЗапасы.Ссылка = &ТекущийДокумент
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РасходнаяНакладнаяЗапасы.Номенклатура,
		|		РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения,
		|		РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
		|		РасходнаяНакладнаяЗапасы.СтавкаНДС,
		|		РасходнаяНакладнаяЗапасы.Цена,
		|		РасходнаяНакладнаяЗапасы.Характеристика,
		|		ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Содержание КАК СТРОКА(1000)),
		|		ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.Комментарий КАК СТРОКА(1000))) КАК ВложенныйЗапрос
		|ГДЕ
		|	&УсловиеФильтраУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	ID,
		|	НомерСтроки";
		
		Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РасходнаяНакладная.Запасы", "Документ.КорректировкаРеализации.Запасы");
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьПересчет Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Цена_Параметр", 		"Выразить(ВложенныйЗапрос.Цена * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма_Параметр", 	"Выразить(ВложенныйЗапрос.Сумма * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДС_Параметр", 	"Выразить(ВложенныйЗапрос.СуммаНДС * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Всего_Параметр", 	"Выразить(ВложенныйЗапрос.Всего * &Курс / &Кратность КАК Число(15,2))");
		
		Запрос.УстановитьПараметр("Курс",		Шапка.Курс);
		Запрос.УстановитьПараметр("Кратность",	Шапка.Кратность);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Цена_Параметр", 		"ВложенныйЗапрос.Цена");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма_Параметр", 	"ВложенныйЗапрос.Сумма");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДС_Параметр", 	"ВложенныйЗапрос.СуммаНДС");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Всего_Параметр", 	"ВложенныйЗапрос.Всего");
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеФильтраУслуг", 
	?(БезУслуг, "НЕ ВложенныйЗапрос.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)", "ИСТИНА"));
	
	ТаблицаПоТоварам = Запрос.Выполнить().Выгрузить();
	
	ДанныеТОРГ12 = Новый Структура();
	ДанныеТОРГ12.Вставить("ДанныеШапки", Шапка);
	ДанныеТОРГ12.Вставить("ТаблицаДокумента", ТаблицаПоТоварам);
	
	Возврат ДанныеТОРГ12;

КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыСоглашениеОбИзмененииСтоимости(ТекущийДокумент, БезУслуг = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорректировкаРеализации.Дата КАК ДатаДокумента,
	|	КорректировкаРеализации.Номер КАК Номер,
	|	КорректировкаРеализации.Организация КАК Руководители,
	|	КорректировкаРеализации.Организация.Префикс КАК Префикс,
	|	КорректировкаРеализации.Организация КАК Организация,
	|	КорректировкаРеализации.БанковскийСчет КАК БанковскийСчет,
	|	КорректировкаРеализации.Контрагент КАК Контрагент,
	|	КорректировкаРеализации.Организация КАК Поставщик,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализации.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаРеализации.Контрагент
	|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализации.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА КорректировкаРеализации.Организация
	|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	КорректировкаРеализации.Контрагент КАК Плательщик,
	|	КорректировкаРеализации.Договор.Представление КАК Основание,
	|	КорректировкаРеализации.Договор.ДатаДоговора КАК ОснованиеДата,
	|	КорректировкаРеализации.Договор.НомерДоговора КАК ОснованиеНомер,
	|	КорректировкаРеализации.ВалютаДокумента,
	|	КорректировкаРеализации.СуммаВключаетНДС,
	|	КорректировкаРеализации.НДСВключатьВСтоимость,
	|	КорректировкаРеализации.Курс,
	|	КорректировкаРеализации.Кратность,
	|	КорректировкаРеализации.ВалютаДокумента.Код КАК ВалютаКод,
	|	КорректировкаРеализации.ИсправляемыйДокументРеализации,
	|	КорректировкаРеализации.ВидОперации,
	|	КорректировкаРеализации.НомерИсходногоДокумента,
	|	КорректировкаРеализации.ДатаИсходногоДокумента,
	|	КорректировкаРеализации.НомерИсправленияИсходногоДокумента,
	|	КорректировкаРеализации.ДатаИсправленияИсходногоДокумента,
	|	КорректировкаРеализации.НомерИсправления,
	|	КорректировкаРеализации.Дата КАК ДатаИсправления,
	|	КорректировкаРеализации.ИсправляемыйДокументРеализации КАК ИсправляемыйДокумент,
	|	КорректировкаРеализации.ИсправляемыйДокументРеализации.Номер КАК НомерИсправляемогоДокумента,
	|	КорректировкаРеализации.ИсправляемыйДокументРеализации.Дата КАК ДатаИсправляемогоДокумента,
	|	КорректировкаРеализации.ДокументОснование
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ИспользоватьПересчет = (НЕ Шапка.ВалютаДокумента = Константы.НациональнаяВалюта.Получить());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Содержание КАК Содержание,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА ВложенныйЗапрос.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК НаименованиеНоменклатуры,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Характеристика.Наименование КАК НаименованиеХарактеристики,
	|	ВложенныйЗапрос.Номенклатура.Код КАК КодТовара,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Наименование КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Код КАК БазоваяЕдиницаКод,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияДляПечати.Наименование КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияДокумент КАК ЕдиницаИзмеренияДокумент,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.СтавкаНДС.Ставка КАК СтавкаНДСЧислом,
	|	&Цена_Параметр КАК Цена,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	0 КАК КоличествоМест,
	|	&Сумма_Параметр КАК Сумма,
	|	&СуммаНДС_Параметр КАК СуммаНДС,
	|	&Всего_Параметр КАК СуммаСНДС,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	0 КАК МассаНетто,
	|	0 КАК МассаБрутто,
	|	НЕОПРЕДЕЛЕНО КАК Упаковка,
	|	ВложенныйЗапрос.Описание КАК Описание,
	|	&ЦенаДоКорректировки_Параметр КАК ЦенаДоКорректировки,
	|	ВложенныйЗапрос.КоличествоДоКорректировки КАК КоличествоДоКорректировки,
	|	&СуммаДоКорректировки_Параметр КАК СуммаДоКорректировки,
	|	&СуммаНДСДоКорректировки_Параметр КАК СуммаНДСДоКорректировки,
	|	&ВсегоДоКорректировки_Параметр КАК СуммаСНДСДоКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииЗапасы.Номенклатура КАК Номенклатура,
	|		КорректировкаРеализацииЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДляПечати,
	|		КорректировкаРеализацииЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
	|		КорректировкаРеализацииЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииЗапасы.Цена КАК Цена,
	|		СУММА(КорректировкаРеализацииЗапасы.Количество) КАК Количество,
	|		СУММА(КорректировкаРеализацииЗапасы.Сумма) КАК Сумма,
	|		СУММА(КорректировкаРеализацииЗапасы.СуммаНДС) КАК СуммаНДС,
	|		СУММА(КорректировкаРеализацииЗапасы.Всего) КАК Всего,
	|		МИНИМУМ(КорректировкаРеализацииЗапасы.НомерСтроки) КАК НомерСтроки,
	|		КорректировкаРеализацииЗапасы.Характеристика КАК Характеристика,
	|		ВЫРАЗИТЬ(КорректировкаРеализацииЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|		ВЫРАЗИТЬ(КорректировкаРеализацииЗапасы.Номенклатура.Комментарий КАК СТРОКА(1000)) КАК Описание,
	|		СУММА(КорректировкаРеализацииЗапасы.ЦенаДоИзменения) КАК ЦенаДоКорректировки,
	|		СУММА(КорректировкаРеализацииЗапасы.КоличествоДоИзменения) КАК КоличествоДоКорректировки,
	|		СУММА(КорректировкаРеализацииЗапасы.СуммаДоИзменения) КАК СуммаДоКорректировки,
	|		СУММА(КорректировкаРеализацииЗапасы.СуммаНДСДоИзменения) КАК СуммаНДСДоКорректировки,
	|		СУММА(КорректировкаРеализацииЗапасы.ВсегоДоИзменения) КАК ВсегоДоКорректировки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Запасы КАК КорректировкаРеализацииЗапасы
	|	ГДЕ
	|		КорректировкаРеализацииЗапасы.Ссылка = &ТекущийДокумент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КорректировкаРеализацииЗапасы.Номенклатура,
	|		КорректировкаРеализацииЗапасы.Номенклатура.ЕдиницаИзмерения,
	|		КорректировкаРеализацииЗапасы.ЕдиницаИзмерения,
	|		КорректировкаРеализацииЗапасы.СтавкаНДС,
	|		КорректировкаРеализацииЗапасы.Цена,
	|		КорректировкаРеализацииЗапасы.Характеристика,
	|		ВЫРАЗИТЬ(КорректировкаРеализацииЗапасы.Содержание КАК СТРОКА(1000)),
	|		ВЫРАЗИТЬ(КорректировкаРеализацииЗапасы.Номенклатура.Комментарий КАК СТРОКА(1000))) КАК ВложенныйЗапрос
	|ГДЕ
	|	&УсловиеФильтраУслуг
	|
	|УПОРЯДОЧИТЬ ПО
	|	ID,
	|	НомерСтроки";
	
	Если ИспользоватьПересчет Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Цена_Параметр", 		"Выразить(ВложенныйЗапрос.Цена * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма_Параметр", 	"Выразить(ВложенныйЗапрос.Сумма * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДС_Параметр", 	"Выразить(ВложенныйЗапрос.СуммаНДС * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Всего_Параметр", 	"Выразить(ВложенныйЗапрос.Всего * &Курс / &Кратность КАК Число(15,2))");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЦенаДоКорректировки_Параметр", 		"Выразить(ВложенныйЗапрос.ЦенаДоКорректировки * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаДоКорректировки_Параметр", 	"Выразить(ВложенныйЗапрос.СуммаДоКорректировки * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДСДоКорректировки_Параметр", 	"Выразить(ВложенныйЗапрос.СуммаНДСДоКорректировки * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсегоДоКорректировки_Параметр", 	"Выразить(ВложенныйЗапрос.ВсегоДоКорректировки * &Курс / &Кратность КАК Число(15,2))");
		
		Запрос.УстановитьПараметр("Курс",		Шапка.Курс);
		Запрос.УстановитьПараметр("Кратность",	Шапка.Кратность);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Цена_Параметр", 		"ВложенныйЗапрос.Цена");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма_Параметр", 	"ВложенныйЗапрос.Сумма");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДС_Параметр", 	"ВложенныйЗапрос.СуммаНДС");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Всего_Параметр", 	"ВложенныйЗапрос.Всего");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЦенаДоКорректировки_Параметр", 		"ВложенныйЗапрос.ЦенаДоКорректировки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаДоКорректировки_Параметр", 	"ВложенныйЗапрос.СуммаДоКорректировки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДСДоКорректировки_Параметр", 	"ВложенныйЗапрос.СуммаНДСДоКорректировки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсегоДоКорректировки_Параметр", 	"ВложенныйЗапрос.ВсегоДоКорректировки");
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеФильтраУслуг", 
		?(БезУслуг, "НЕ ВложенныйЗапрос.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)", "ИСТИНА"));
	
	ТаблицаПоТоварам = Запрос.Выполнить().Выгрузить();
	
	ДанныеСоглашения = Новый Структура();
	ДанныеСоглашения.Вставить("ДанныеШапки", Шапка);
	ДанныеСоглашения.Вставить("ТаблицаДокумента", ТаблицаПоТоварам);
	
	Возврат ДанныеСоглашения;
	
КонецФункции

Процедура ЗаполнитьРеквизитыФизЛица(ДеревоДанных, ИсточникДанных, ТипЛица, Должность = Неопределено) Экспорт
	
	Фамилия = ""; Имя = ""; Отчество = "";
	ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(ИсточникДанных, Фамилия, Имя, Отчество);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ТипЛица + ".Фамилия", Фамилия);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ТипЛица + ".Имя", Имя);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ТипЛица + ".Отчество", Отчество);
	Если Должность <> Неопределено Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ТипЛица + ".Должность", Должность);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеУчастника(ДеревоДанных, СведенияОбУчастнике, ВидУчастника, ВидАдреса = "Структурированный", КорневойЭлементДерева = "") Экспорт
	
	Если СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ЮЛ.ИНН",
									СведенияОбУчастнике.ИНН);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ЮЛ.НаименованиеОрганизации",
									СведенияОбУчастнике.ПолноеНаименование);
	Иначе
		ПолныйПуть = ВидУчастника + ".ТипУчастника.ФЛ.ПолноеНаименование";
		Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПолныйПуть, СведенияОбУчастнике.ПолноеНаименование, КорневойЭлементДерева);
		КонецЕсли;
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ФЛ.ИНН",
									СведенияОбУчастнике.ИНН, КорневойЭлементДерева);
		Фамилия = ""; Имя = ""; Отчество = "";
		ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(СведенияОбУчастнике.ПолноеНаименование, Фамилия, Имя, Отчество);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ФЛ.Фамилия",
									Фамилия, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ФЛ.Имя",
									Имя, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ФЛ.Отчество",
									Отчество, КорневойЭлементДерева);
	КонецЕсли;
	
	АдресУчастника = Новый Структура;
	ВидАдреса = ?(ВидУчастника = "Продавец" ИЛИ ВидУчастника = "Поставщик" ИЛИ ВидУчастника = "Плательщик" ИЛИ ВидУчастника = "Заказчик", "Юр", "Факт");
	ОбменСКонтрагентамиПереопределяемый.ПолучитьАдресСтруктурой(АдресУчастника, СведенияОбУчастнике.Ссылка, "Ссылка", ВидАдреса, "");
	
	Если ЗначениеЗаполнено(АдресУчастника) Тогда
		ПолныйПуть = ВидУчастника + ".Адрес.Структурированный";
		Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть) Тогда
			ТипАдреса = ?(АдресУчастника.АдресРФ, "Структурированный", "Иностранный");
		Иначе
			ТипАдреса = "Произвольный";
		КонецЕсли;
		ЗаполнитьАдресВДереве(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника);
	КонецЕсли;
	
	ПолныйПуть = ВидУчастника + ".Контакт.Телефон";
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных,
								ВидУчастника + ".Контакт.Телефон",
								СведенияОбУчастнике.Телефоны, КорневойЭлементДерева);
	КонецЕсли;
	
	ПолныйПуть = ВидУчастника + ".БанковскийСчет";
	НомерСчета = "";
	Если СведенияОбУчастнике.Свойство("НомерСчета", НомерСчета) И ЗначениеЗаполнено(НомерСчета)
		И ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть) Тогда
		Банк = "";
		МФО = "";
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскийСчет.НомерСчета",
				НомерСчета, КорневойЭлементДерева);
		Если СведенияОбУчастнике.Свойство("Банк", Банк) И ЗначениеЗаполнено(Банк) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
										ДеревоДанных,
										ВидУчастника + ".БанковскийСчет.НаимБанк",
										Банк.Наименование, КорневойЭлементДерева);
		КонецЕсли;
		Если СведенияОбУчастнике.Свойство("МФО", МФО) И ЗначениеЗаполнено(МФО) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
										ДеревоДанных,
										ВидУчастника + ".БанковскийСчет.МФО",
										МФО, КорневойЭлементДерева);
		КонецЕсли;
	КонецЕсли;
	
	ПолныйПуть = ВидУчастника + ".Руководитель";
	Значение = "";
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть)
		И СведенияОбУчастнике.Свойство("Руководитель", Значение) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПолныйПуть + ".Фамилия", Значение.Фамилия, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПолныйПуть + ".Имя", Значение.Имя, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПолныйПуть + ".Отчество", Значение.Отчество, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПолныйПуть + ".Должность", Значение.Должность, КорневойЭлементДерева);
	КонецЕсли;
	
	ПолныйПуть = ВидУчастника + ".Комментарий";
	Значение = "";
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть)
		И СведенияОбУчастнике.Свойство("Комментарий", Значение) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПолныйПуть, Значение, КорневойЭлементДерева);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОбУчастнике, ВидУчастника, ВидАдреса = "АдресРФ", КорневойЭлементДерева = "") Экспорт
	
	Если СведенияОбУчастнике.Свойство("СтранаРегистрации")
		И СведенияОбУчастнике.СтранаРегистрации <> Справочники.СтраныМира.Украина Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ИЛ.НаименованиеОрганизации",
									СведенияОбУчастнике.ПолноеНаименование, КорневойЭлементДерева);
		
	ИначеЕсли СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ЮЛ.НаименованиеОрганизации",
									СведенияОбУчастнике.ПолноеНаименование, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ЮЛ.ИНН",
									СведенияОбУчастнике.ИНН, КорневойЭлементДерева);
		
	Иначе
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ИП.ИНН",
									СведенияОбУчастнике.ИНН, КорневойЭлементДерева);
		
		Если ЗначениеЗаполнено(СведенияОбУчастнике.СвидетельствоСерияНомер) Тогда
			Свидетельство = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru='Свидетельство №%1 от %2';uk='Свидетельство №%1 от %2'"),
							СведенияОбУчастнике.СвидетельствоСерияНомер,
							Формат(СведенияОбУчастнике.СвидетельствоДатаВыдачи, "ДЛФ=D"));
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
										ДеревоДанных,
										ВидУчастника + ".ТипУчастника.ИП.СвидетельствоОГосРегистрации",
										Свидетельство, КорневойЭлементДерева);
		КонецЕсли;
		
		ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СведенияОбУчастнике.ПолноеНаименование);
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ИП.Фамилия",
									ФИО.Фамилия, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ИП.Имя",
									ФИО.Имя, КорневойЭлементДерева);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".ТипУчастника.ИП.Отчество",
									ФИО.Отчество, КорневойЭлементДерева);
	КонецЕсли;
	
	АдресУчастника = Новый Структура;
	ОбменСКонтрагентамиПереопределяемый.ПолучитьАдресСтруктурой(АдресУчастника, СведенияОбУчастнике.Ссылка, "Ссылка", ВидАдреса, "");
	
	ТипАдреса = ?(АдресУчастника.АдресРФ, "АдресРФ", "АдресИнформация");
	ЗаполнитьАдресВДеревеУПД(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника, КорневойЭлементДерева);
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.Телефоны) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".КонтактныеСведения.Телефон",
									СведенияОбУчастнике.Телефоны, КорневойЭлементДерева);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.ЭлектроннаяПочта) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".КонтактныеСведения.ЭлектроннаяПочта",
									СведенияОбУчастнике.ЭлектроннаяПочта, КорневойЭлементДерева);
	КонецЕсли;
	
	
	НомерСчета = "";
	Если СведенияОбУчастнике.Свойство("НомерСчета", НомерСчета) И ЗначениеЗаполнено(НомерСчета) Тогда
		Банк = "";
		МФО = "";
		КоррСчет = "";
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскиеРеквизиты.НомерСчета",
				НомерСчета, КорневойЭлементДерева);
				
		Если СведенияОбУчастнике.Свойство("Банк", Банк) И ЗначениеЗаполнено(Банк) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
										ДеревоДанных,
										ВидУчастника + ".БанковскиеРеквизиты.НаименованиеБанка",
										Банк, КорневойЭлементДерева);
		КонецЕсли;
		Если СведенияОбУчастнике.Свойство("МФО", МФО) И ЗначениеЗаполнено(МФО) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
										ДеревоДанных,
										ВидУчастника + ".БанковскиеРеквизиты.МФОбанка",
										МФО, КорневойЭлементДерева);
		КонецЕсли;
		Если СведенияОбУчастнике.Свойство("КоррСчет", КоррСчет) И ЗначениеЗаполнено(КоррСчет) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
										ДеревоДанных,
										ВидУчастника + ".БанковскиеРеквизиты.КорреспондентскийСчетБанка",
										КоррСчет, КорневойЭлементДерева);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.КодПоОКПО) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ВидУчастника + ".КодОКПО", СведенияОбУчастнике.КодПоОКПО, КорневойЭлементДерева);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеГрузоОтправителяПолучателя(ДеревоДанных, СведенияОбУчастнике, ВидУчастника, ВидАдреса = "Структурированный") Экспорт
	
	Если СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".Наименование.НаименованиеОрганизации",
			СведенияОбУчастнике.ПолноеНаименование);
	Иначе
		Фамилия = ""; Имя = ""; Отчество = "";
		ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(СведенияОбУчастнике.ПолноеНаименование, Фамилия, Имя, Отчество);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".Наименование.ФИОИП.Фамилия",
			Фамилия);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".Наименование.ФИОИП.Имя",
			Имя);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".Наименование.ФИОИП.Отчество",
			Отчество);
	КонецЕсли;
	
	АдресУчастника = Новый Структура;
	ВидАдреса = "Факт";
	ОбменСКонтрагентамиПереопределяемый.ПолучитьАдресСтруктурой(АдресУчастника, СведенияОбУчастнике.Ссылка, "Ссылка", ВидАдреса, "");
	
	Если ЗначениеЗаполнено(АдресУчастника) Тогда
		ТипАдреса = ?(АдресУчастника.АдресРФ, "Структурированный", "Иностранный");
		ЗаполнитьАдресВДереве(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет соответствующий тип адреса переданными данными.
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Строка дерева, содержащая данные участника
//  АдресУчастника - Структура - содержит данные адреса участника обмена. Имена полей структуры должны совпадать с
//    именами полей структуры выбранного типа адреса:
//    Структурированный - "Индекс, КодРегион, Район, Город, НаселПункт, Улица, Дом, Корпус, Кварт";
//    Произвольный/Иностранный - "КодСтраны, АдресСтрокой" (вынесены в разные элементы списка для того,
//      чтобы правильно заполнить ЭД).
//  ТипАдреса - Строка - один из 3-х вариантов: Структурированный, Произвольный, Иностранный.
//  ВидУчастника - Строка - вид участника как он представлен в дереве данных.
//  КорневойЭлементДерева - Строка - необходимо использовать в случае, если в таблице надо заполнить
//    сложный тип данных (группа, выбор). Например: "Товары.НомерСтроки.Покупатель", Покупатель -
//    является сложным типом данных, тогда КорневойЭлементДерева = "Товары.НомерСтроки".
//
Процедура ЗаполнитьАдресВДереве(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника, КорневойЭлементДерева = "")
	
	Если ТипАдреса = "Произвольный" Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".Адрес.Произвольный",
									АдресУчастника.АдрТекст, КорневойЭлементДерева);
	Иначе
		Если АдресУчастника.АдресРФ Тогда
			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("КодСтр");
			АдресУчастника.Удалить("КодРегиона");
			АдресУчастника.Удалить("КодСтраны");
			АдресУчастника.Удалить("НаселенныйПункт");
			АдресУчастника.Удалить("АдрТекст");
			АдресУчастника.Удалить("АдресТекст");
			АдресУчастника.Удалить("Квартира");
			АдресУчастника.Удалить("КодГАР");
		Иначе
			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("ПочтовыйИндекс");
			АдресУчастника.Удалить("Индекс");
			АдресУчастника.Удалить("Регион");
			АдресУчастника.Удалить("КодРегион");
			АдресУчастника.Удалить("КодРегиона");
			АдресУчастника.Удалить("Район");
			АдресУчастника.Удалить("Город");
			АдресУчастника.Удалить("НаселенныйПункт");
			АдресУчастника.Удалить("НаселПункт");
			АдресУчастника.Удалить("Улица");
			АдресУчастника.Удалить("Дом");
			АдресУчастника.Удалить("Корпус");
			АдресУчастника.Удалить("Квартира");
			АдресУчастника.Удалить("Кварт");
			АдресУчастника.Удалить("КодСтраны");
			АдресУчастника.Удалить("АдресТекст");
			АдресУчастника.Удалить("КодГАР");
		КонецЕсли;
		Для Каждого Элемент Из АдресУчастника Цикл
			
			ИмяПоля = ВидУчастника + ".Адрес." + ТипАдреса + "." + Элемент.Ключ;
			
			Если Не ДеревоДанных.Строки.Найти(ИмяПоля, "ПолныйПуть", Истина) = Неопределено Тогда
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
							ДеревоДанных,
							ИмяПоля,
							Элемент.Значение, КорневойЭлементДерева);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет соответствующий тип адреса переданными данными.
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Строка дерева, содержащая данные участника
//  АдресУчастника - Структура - содержит данные адреса участника обмена. Имена полей структуры должны совпадать с
//    именами полей структуры выбранного типа адреса:
//    Структурированный - "Индекс, КодРегиона, Район, Город, НаселенныйПункт, Улица, Дом, Корпус, Квартира";
//    Произвольный/Иностранный - "КодСтраны, АдресСтрокой" (вынесены в разные элементы списка для того,
//      чтобы правильно заполнить ЭД).
//  ТипАдреса - Строка - один из 3-х вариантов: Структурированный, Произвольный, Иностранный.
//  ВидУчастника - Строка - вид участника как он представлен в дереве данных.
//  КорневойЭлементДерева - Строка - необходимо использовать в случае, если в таблице надо заполнить
//    сложный тип данных (группа, выбор). Например: "Товары.НомерСтроки.Покупатель", Покупатель -
//    является сложным типом данных, тогда КорневойЭлементДерева = "Товары.НомерСтроки".
//
Процедура ЗаполнитьАдресВДеревеУПД(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника, КорневойЭлементДерева = "")
	
	Если ТипАдреса = "АдресРФ" Тогда
			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("КодСтр");
			АдресУчастника.Удалить("КодСтраны");
			АдресУчастника.Удалить("АдрТекст");
			АдресУчастника.Удалить("АдресТекст");
			АдресУчастника.Удалить("Регион");
			АдресУчастника.Удалить("КодРегион");
			АдресУчастника.Удалить("НаселПункт");
			АдресУчастника.Удалить("Кварт");
			АдресУчастника.Удалить("КодГАР");
			
		Для Каждого Элемент Из АдресУчастника Цикл
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".Адрес." + ТипАдреса + "." + Элемент.Ключ,
									Элемент.Значение, КорневойЭлементДерева);
		КонецЦикла;
	ИначеЕсли ТипАдреса = "АдресИнформация" Тогда
			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("ПочтовыйИндекс");
			АдресУчастника.Удалить("Индекс");
			АдресУчастника.Удалить("Регион");
			АдресУчастника.Удалить("КодРегиона");
			АдресУчастника.Удалить("КодРегион");
			АдресУчастника.Удалить("Район");
			АдресУчастника.Удалить("Город");
			АдресУчастника.Удалить("НаселенныйПункт");
			АдресУчастника.Удалить("НаселПункт");
			АдресУчастника.Удалить("Улица");
			АдресУчастника.Удалить("Дом");
			АдресУчастника.Удалить("Корпус");
			АдресУчастника.Удалить("Квартира");
			АдресУчастника.Удалить("Кварт");
			АдресУчастника.Удалить("КодСтр");
			АдресУчастника.Удалить("АдрТекст");
			АдресУчастника.Удалить("КодГАР");
	
		Для Каждого Элемент Из АдресУчастника Цикл
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".Адрес." + ТипАдреса + "." + Элемент.Ключ,
									Элемент.Значение, КорневойЭлементДерева);
		КонецЦикла;
	ИначеЕсли ТипАдреса = "КодГАР" Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
									ДеревоДанных,
									ВидУчастника + ".Адрес.КодГАР",
									Элемент.Значение, КорневойЭлементДерева);
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСсылкуНаНоменклатуруПоставщикаПоИдентификатору(Идентификатор, Контрагент, ТипВозвращаемогоЗначения = "Номенклатура") Экспорт
	
	НайденныйЭлемент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрНоменклатура.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Идентификатор = &Идентификатор
	|	И (&Контрагент = НЕОПРЕДЕЛЕНО
	|			ИЛИ СпрНоменклатура.Владелец = &Контрагент)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ТипВозвращаемогоЗначения = "Номенклатура" Тогда
				НайденныйЭлемент = Выборка.Номенклатура;
			Иначе
				НайденныйЭлемент = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НайденныйЭлемент;
	
КонецФункции

Процедура ЗаполнитьФИОПодписантаВДереве(ДеревоДанных, ТипПодписанта, ИсточникДанных) Экспорт
	
	Фамилия = ""; Имя = ""; Отчество = "";
	ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(ИсточникДанных, Фамилия, Имя, Отчество);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных,
								"Подписант." + ТипПодписанта + ".Фамилия",
								Фамилия);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "Подписант." + ТипПодписанта + ".Имя", Имя);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных,
								"Подписант." + ТипПодписанта + ".Отчество",
								Отчество);
	
КонецПроцедуры

Функция СоздатьПерезаполнитьНоменклатуруПоставщика(СтрокаОбъекта, ДеревоРазбора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(СтрокаОбъекта.СсылкаНаОбъект) Тогда
		НовЭл = СтрокаОбъекта.СсылкаНаОбъект.ПолучитьОбъект();
		СсылкаНаОбъектНоменклатура = СтрокаОбъекта.СсылкаНаОбъект.Номенклатура;
	Иначе
		НовЭл = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		СсылкаНаОбъектНоменклатура = Неопределено;
	КонецЕсли;
	
	ЗаполнитьРеквизитыОбъектаПоСоответствиюИмен(СтрокаОбъекта, НовЭл);
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектНоменклатура) Тогда
		НайденнаяСтрока = СтрокаОбъекта.Строки.Найти("Номенклатура", "Реквизит", Истина);
		Если НайденнаяСтрока <> Неопределено Тогда
			Если ЗначениеЗаполнено(НайденнаяСтрока.СсылкаНаОбъект) Тогда
				СсылкаНаОбъектНоменклатура = НайденнаяСтрока.СсылкаНаОбъект;
			Иначе
				ИндексИскомойСтроки = НайденнаяСтрока.ЗначениеРеквизита;	
				НайденнаяСтрока = ДеревоРазбора.Строки.Найти(ИндексИскомойСтроки, "ИндексСтроки", Истина);
				Если НайденнаяСтрока <> Неопределено Тогда
					Если ЗначениеЗаполнено(НайденнаяСтрока.СсылкаНаОбъект) Тогда
						СсылкаНаОбъектНоменклатура = НайденнаяСтрока.СсылкаНаОбъект;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НовЭл.Номенклатура = СсылкаНаОбъектНоменклатура;
		// Заполняем идентификатор номенклатуры поставщика, если он получен в реквизите Ид
		СтрокаИд = СтрокаОбъекта.Строки.Найти("Ид", "Реквизит", Истина);
		Если НЕ ЗначениеЗаполнено(НовЭл.Идентификатор) И ЗначениеЗаполнено(СтрокаИд) Тогда
			НовЭл.Идентификатор = СтрокаИд.ЗначениеРеквизита;
		КонецЕсли;
		// Заполнение найденного поставщика (владельца, тип Справочник.Контрагент)
		СтрокиКонтрагенты = ДеревоРазбора.Строки.Найти("Контрагенты", "ТипОбъекта", Истина);
		Если Не ЗначениеЗаполнено(НовЭл.Владелец) И СтрокиКонтрагенты.Строки.Количество() = 1 Тогда
			НовЭл.Владелец = СтрокиКонтрагенты.Строки[0].СсылкаНаОбъект;
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовЭл.Код) Тогда
		НовЭл.УстановитьНовыйКод();
	КонецЕсли;
	
	НовЭл.ОбменДанными.Загрузка = Истина;
	Попытка
		НовЭл.Записать();
	Исключение
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создание элемента справочника %1.';uk='Создание элемента справочника %1.'"),
			"Номенклатура поставщиков") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(Текст, 2, УровеньЖурналаРегистрации.Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
	СсылкаНаОбъект = НовЭл.Ссылка;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

// Заполняет реквизиты объекта по соответствию наименований
//
// Параметры:
//  СтрокаМассива - СтрокаДереваЗначений, набор параметров, по которому будет происходить заполнение
//  ОбъектМетаданных - Объект ИБ, реквизиты которого необходимо заполнить.
//
Процедура ЗаполнитьРеквизитыОбъектаПоСоответствиюИмен(СтрокаМассива, ОбъектМетаданных)
	
	Для Каждого ТекСтрока Из СтрокаМассива.Строки Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ЗначениеРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(ОбъектМетаданных.Метаданные().СтандартныеРеквизиты, ТекСтрока.Реквизит) Тогда
			ОбъектМетаданных[ТекСтрока.Реквизит] = ТекСтрока.ЗначениеРеквизита;
		ИначеЕсли ОбъектМетаданных.Метаданные().Реквизиты.Найти(ТекСтрока.Реквизит) <> Неопределено Тогда
			Если ЗначениеЗаполнено(ТекСтрока.СсылкаНаОбъект) Тогда
				ОбъектМетаданных[ТекСтрока.Реквизит] = ТекСтрока.СсылкаНаОбъект;
			Иначе
				ОбъектМетаданных[ТекСтрока.Реквизит] = ТекСтрока.ЗначениеРеквизита;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Перезаполняет реквизиты шапки объекта.
//
// Параметры:
//  ТекущийОбъект    - Объект ИБ, реквизиты шапки которого необходимо заполнить,
//  ДанныеЗаполнения - Структура значений, которые необходимо подставить в объект ИБ.
//
Процедура ПерезаполнениеЗначенийРеквизитовШапки(ТекущийОбъект, ДанныеЗаполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Строка Из ДанныеЗаполнения Цикл
		
		Если ЗначениеЗаполнено(Строка.Ключ) И ТекущийОбъект.Метаданные().Реквизиты.Найти(Строка.Ключ) <> Неопределено Тогда
			Если ТекущийОбъект[Строка.Ключ] <> Строка.Значение Тогда
				ТекущийОбъект[Строка.Ключ] = Строка.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КодРегионаПоНазванию(Название) Экспорт
	
	Если ПустаяСтрока(Название) Тогда
		Возврат "";
	КонецЕсли;
	
	КодСубъектаРФ = АдресныйКлассификатор.КодРегионаПоНаименованию(Название);
	Если КодСубъектаРФ <> Неопределено Тогда
		Возврат Формат(КодСубъектаРФ, "ЧЦ=2; ЧВН=")
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает адрес в виде структуры полей. Если адрес нужного вида не задан, то будет возвращена структура с пустыми полями.
//
// Параметры:
//    Ссылка                  - ссылка на объект, который содержит контактную информацию.
//    ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации, структуру которого нужно получить.
//
// Возвращаемое значение:
//  Структура - Структура со значениями полей адреса.
//
Функция АдресСтруктурой(Ссылка, ВидКонтактнойИнформации) Экспорт
	
	СтруктураАдреса = Новый Структура();
	СтруктураАдреса.Вставить("АдресРФ", Истина);
	СтруктураАдреса.Вставить("КодСтраны", "");
	СтруктураАдреса.Вставить("Страна", "");
	СтруктураАдреса.Вставить("Индекс", "");
	СтруктураАдреса.Вставить("Регион", "");
	СтруктураАдреса.Вставить("КодРегиона", "");
	СтруктураАдреса.Вставить("Район", "");
	СтруктураАдреса.Вставить("Город", "");
	СтруктураАдреса.Вставить("НаселенныйПункт", "");
	СтруктураАдреса.Вставить("Улица", "");
	СтруктураАдреса.Вставить("Дом", "");
	СтруктураАдреса.Вставить("Корпус", "");
	СтруктураАдреса.Вставить("Квартира", "");
	СтруктураАдреса.Вставить("Представление", "");
	СтруктураАдреса.Вставить("ЗначенияПолей", "");
	
	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
							ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка),
							Перечисления.ТипыКонтактнойИнформации.Адрес, 
							ВидКонтактнойИнформации);
	Если Адрес.Количество() = 0 Тогда
		Возврат СтруктураАдреса;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("НаименованиеВключаетСокращение", Истина);
	СведенияОбАдресе = УправлениеКонтактнойИнформацией.СведенияОбАдресе(Адрес[0].ЗначенияПолей, ДополнительныеПараметры);
	СтруктураАдреса.Представление = Адрес[0].Представление;
	СтруктураАдреса.ЗначенияПолей = Адрес[0].ЗначенияПолей;
	
	СтруктураАдреса.Страна    = СведенияОбАдресе.Страна;
	СтруктураАдреса.КодСтраны = СведенияОбАдресе.КодСтраны;
	Если СтруктураАдреса.Свойство("Страна") 
		И СтрСравнить(СтруктураАдреса.Страна, Справочники.СтраныМира.Украина.Наименование) = 0 Тогда
		СтруктураАдреса.АдресРФ = Истина;
	Иначе
		СтруктураАдреса.АдресРФ = Ложь;
	КонецЕсли;
	
	СтруктураАдреса.Индекс = СведенияОбАдресе.Индекс;
	СтруктураАдреса.Регион = СведенияОбАдресе.Регион;
	СтруктураАдреса.КодРегиона = ?(СведенияОбАдресе.Свойство("КодРегиона"), СведенияОбАдресе.КодРегиона, "");
	СтруктураАдреса.Район = СведенияОбАдресе.Район;
	СтруктураАдреса.Город = СведенияОбАдресе.Город;
	СтруктураАдреса.НаселенныйПункт = СведенияОбАдресе.НаселенныйПункт;
	СтруктураАдреса.Улица = СведенияОбАдресе.Улица;
	СтруктураАдреса.Дом = СведенияОбАдресе.Здание.Номер;
	
	Если СведенияОбАдресе.Корпуса.Количество() > 0 Тогда
		СтруктураАдреса.Корпус = СведенияОбАдресе.Корпуса[0].Номер;
	КонецЕсли;
	
	Если СведенияОбАдресе.Помещения.Количество() > 0 Тогда
		СтруктураАдреса.Квартира = СведенияОбАдресе.Помещения[0].Номер;
	КонецЕсли;
	
	Возврат СтруктураАдреса;
	
КонецФункции

Процедура ЗаполнитьДоговорКонтрагента(ДокументОбъект)

	Если Не ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		Возврат;
	ИначеЕсли Не ДокументОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		ДокументОбъект.Договор = ДокументОбъект.Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	ВидОперации = ?(ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика"), Неопределено, ДокументОбъект.ВидОперации);
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(ДокументОбъект.Ссылка, ВидОперации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
	|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)";
	
	Запрос.УстановитьПараметр("Контрагент", ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговоров);
	Запрос.УстановитьПараметр("ВалютаРасчетов", ДокументОбъект.ВалютаДокумента);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		НовыйДоговор.Владелец = ДокументОбъект.Контрагент;
		НовыйДоговор.Наименование = "Основной договор (" + Строка(ДокументОбъект.ВалютаДокумента) + ")";
		НовыйДоговор.ВидДоговора = ?(СписокВидовДоговоров.Количество() > 0, СписокВидовДоговоров[0].Значение, Перечисления.ВидыДоговоров.СПокупателем);
		НовыйДоговор.Организация = ДокументОбъект.Организация;
		НовыйДоговор.ВалютаРасчетов = ДокументОбъект.ВалютаДокумента;
		НовыйДоговор.СрокОплатыПоставщику = Константы.СрокОплатыПоставщику.Получить();
		НовыйДоговор.СрокОплатыПокупателя = Константы.СрокОплатыПокупателя.Получить();
		НовыйДоговор.Записать();
		
		ДокументОбъект.Договор = НовыйДоговор.Ссылка;
		Возврат;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ДокументОбъект.Договор = Выборка.Ссылка;

КонецПроцедуры

Функция ПолучитьАдресДоставки(Контрагент) Экспорт

	АдресДоставки = "";
	
	НазначениеКИ = Справочники.ВидыКонтактнойИнформации.СправочникКонтрагенты;
	АдресДоставкиВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес доставки", Истина, НазначениеКИ);
	Если ЗначениеЗаполнено(АдресДоставкиВидКИ) Тогда
		АдресДоставки = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(Контрагент, АдресДоставкиВидКИ);
	КонецЕсли;
	
	Возврат АдресДоставки;

КонецФункции // ПолучитьАдресДоставки()

Функция ПолучитьАдресИзКонтактнойИнформации(Владелец, ТипАдреса = "Юр") Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Страна,
	|	КонтактнаяИнформация.Регион,
	|	КонтактнаяИнформация.ЗначенияПолей,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.%ИмяСправочника%.КонтактнаяИнформация КАК КонтактнаяИнформация 
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Владелец
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &ВидАдреса";
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") Тогда
		ВидАдреса = Справочники.ВидыКонтактнойИнформации[ТипАдреса + "АдресОрганизации"].Ссылка;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяСправочника%", "Организации");
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидАдреса = Справочники.ВидыКонтактнойИнформации[ТипАдреса + "АдресКонтрагента"].Ссылка;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяСправочника%", "Контрагенты");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Владелец",  Владелец);
	Запрос.УстановитьПараметр("Тип",       Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидАдреса", ВидАдреса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТелефонИзКонтактнойИнформации(Владелец) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Телефон
	|ИЗ
	|	Справочник.%ИмяСправочника%.КонтактнаяИнформация КАК КонтактнаяИнформация 
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Владелец
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &ВидТелефона";
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") Тогда
		ВидТелефона = Справочники.ВидыКонтактнойИнформации["ТелефонОрганизации"].Ссылка;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяСправочника%", "Организации");
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидТелефона = Справочники.ВидыКонтактнойИнформации["ТелефонКонтрагента"].Ссылка;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяСправочника%", "Контрагенты");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Владелец",    Владелец);
	Запрос.УстановитьПараметр("Тип",         Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидТелефона", ВидТелефона);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Телефон;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПересчитатьЦеныТабличнойЧастиПоВалюте(Документ, ПредыдущаяВалюта, ИмяТабличнойЧасти)
	
	СтруктураКурсы = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(ПредыдущаяВалюта, Документ.ВалютаДокумента, Документ.Дата);
																   
	Для каждого СтрокаТабличнойЧасти Из Документ[ИмяТабличнойЧасти] Цикл
		
		СтрокаТабличнойЧасти.Цена = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Цена, 
																								СтруктураКурсы.КурсНач, 
																								СтруктураКурсы.Курс, 
																								СтруктураКурсы.КратностьНач, 
																								СтруктураКурсы.Кратность);
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		Если Документ.СуммаВключаетНДС Тогда
			СтрокаТабличнойЧасти.СуммаНДС = ?(
				Документ.СуммаВключаетНДС, 
				СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
				СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100
			);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Документ.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		Иначе
			СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100;
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РассчитатьИтоговыеСуммыДокумента(ТаблицаДокумента) Экспорт
	
	ИтоговыеСуммы = ИтоговыеСуммыДокумента();
	
	Для Каждого Строка ИЗ ТаблицаДокумента Цикл
		
		ИтоговыеСуммы.ИтогоМест        = ИтоговыеСуммы.ИтогоМест        + ?(ЗначениеЗаполнено(Строка.КоличествоМест),Строка.КоличествоМест, 0);
		ИтоговыеСуммы.ИтогоСуммаБезНДС = ИтоговыеСуммы.ИтогоСуммаБезНДС + Строка.СуммаБезНДС;
		ИтоговыеСуммы.ИтогоНДС         = ИтоговыеСуммы.ИтогоНДС         + Строка.СуммаНДС;
		ИтоговыеСуммы.ИтогоСуммаСНДС   = ИтоговыеСуммы.ИтогоСуммаСНДС   + Строка.СуммаБезНДС + Строка.СуммаНДС;
		
	КонецЦикла;
	
	ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписей = ТаблицаДокумента.Количество();
	
	Возврат ИтоговыеСуммы;
	
КонецФункции

Функция РассчитатьИтоговыеСуммыКорректировочногоДокумента(ТаблицаДокумента) Экспорт
	
	ИтоговыеСуммы = ИтоговыеСуммыДокумента();
	
	Для Каждого Строка ИЗ ТаблицаДокумента Цикл
		
		ИтоговыеСуммы.ИтогоСуммаБезНДС = ИтоговыеСуммы.ИтогоСуммаБезНДС + Строка.СуммаБезНДС;
		ИтоговыеСуммы.ИтогоНДС         = ИтоговыеСуммы.ИтогоНДС         + Строка.СуммаНДС;
		ИтоговыеСуммы.ИтогоСуммаСНДС   = ИтоговыеСуммы.ИтогоСуммаСНДС   + Строка.СуммаБезНДС + Строка.СуммаНДС;
		
		ИтоговыеСуммы.ИтогоСуммаДоКорректировки     = ИтоговыеСуммы.ИтогоСуммаДоКорректировки     + Строка.СуммаБезНДСДоКорректировки;
		ИтоговыеСуммы.ИтогоНДСДоКорректировки       = ИтоговыеСуммы.ИтогоНДСДоКорректировки       + Строка.СуммаНДСДоКорректировки;
		ИтоговыеСуммы.ИтогоСуммаСНДСДоКорректировки = ИтоговыеСуммы.ИтогоСуммаСНДСДоКорректировки + Строка.СуммаСНДСДоКорректировки;
		
	КонецЦикла;
	
	ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписей = ТаблицаДокумента.Количество();
	
	Возврат ИтоговыеСуммы;
	
КонецФункции

Функция ИтоговыеСуммыДокумента()
	
	Структура = Новый Структура;
	
	// Инициализация итогов по документу.
	Структура.Вставить("ИтогоМест", 0);
	Структура.Вставить("ИтогоСуммаСНДС", 0);
	Структура.Вставить("ИтогоСуммаБезНДС", 0);
	Структура.Вставить("ИтогоНДС", 0);
	Структура.Вставить("ИтогоСуммаСНДСДоКорректировки", 0);
	Структура.Вставить("ИтогоСуммаДоКорректировки", 0);
	Структура.Вставить("ИтогоНДСДоКорректировки", 0);
	Структура.Вставить("ИтогоМассаБрутто", 0);
	Структура.Вставить("ИтогоМассаНетто", 0);
	
	Структура.Вставить("КоличествоПорядковыхНомеровЗаписей", 0);
	Структура.Вставить("СуммаПрописью", "");
	
	Возврат Структура;
	
КонецФункции

Функция ОпределитьТипДокументаОснованияДляЗаголовка(ВидОперации, ИсправляемыйДокументРеализации) Экспорт
	
	СоглашениеКСоглашению = Ложь;
	Если ЗначениеЗаполнено(ИсправляемыйДокументРеализации) И ТипЗнч(ИсправляемыйДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			СоглашениеКСоглашению = Истина;	
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			СоглашениеКСоглашению = ТипЗнч(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсправляемыйДокументРеализации, 
										"ИсправляемыйДокументРеализации")) = Тип("ДокументСсылка.КорректировкаРеализации");
		КонецЕсли;
	КонецЕсли;
	
	Если СоглашениеКСоглашению Тогда
		ЗаголовокДокументаОснования = НСтр("ru='к соглашению';uk='к соглашению'");
	ИначеЕсли ТипЗнч(ИсправляемыйДокументРеализации) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		ЗаголовокДокументаОснования = НСтр("ru='к акту об оказании услуг';uk='к акту об оказании услуг'");
	Иначе
		ЗаголовокДокументаОснования = НСтр("ru='к накладной';uk='к накладной'");
	КонецЕсли;
	
	Возврат ЗаголовокДокументаОснования;
	
КонецФункции

Процедура ВставитьЗначениеВДерево(ДеревоДанных, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	НовСтрока = ДеревоДанных.Строки.Найти(ИмяРеквизита, "ПолныйПуть", Истина);
	Если НовСтрока = Неопределено Тогда
		НовСтрока = ДеревоДанных.Строки.Добавить();
		НомерУровня = СтрЧислоВхождений(ИмяРеквизита, ".") + 1;
		НовСтрока.ПолныйПуть = ИмяРеквизита;
		НовСтрока["Уровень" + НомерУровня] = ЭлектронноеВзаимодействие.НазваниеКолонки(ИмяРеквизита);
	КонецЕсли;
	НовСтрока.Значение = ЗначениеРеквизита;

КонецПроцедуры

// Получает текстовое представление версии электронного документа.
//
// Параметры:
//  СсылкаНаВладельца - Ссылка на объект ИБ, состояние версии электронного документа которого необходимо получить.
//
Функция ПолучитьТекстСостоянияЭД(СсылкаНаВладельца, Форма = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьНастройка = Ложь;
	Если ЗначениеЗаполнено(СсылкаНаВладельца)
		И ТипЗнч(СсылкаНаВладельца) <> Тип("СправочникСсылка.СоглашенияОбИспользованииЭД") Тогда
		ПараметрыЭД = Неопределено;
		Если ОбменСКонтрагентамиСлужебныйВызовСервера.ОпределитьДействующуюНастройкуЭДО(СсылкаНаВладельца, ПараметрыЭД) 
			И ПараметрыЭД <> Неопределено Тогда
			СостояниеСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЭД.НастройкаЭДО, "СостояниеСоглашения");
			Если СостояниеСоглашения = Перечисления.СостоянияСоглашенийЭД.Действует Тогда
				ЕстьНастройка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекстСостоянияЭД = ОбменСКонтрагентамиКлиентСервер.ПолучитьТекстСостоянияЭД(СсылкаНаВладельца, Форма);
	
	Если Форма.Элементы.Найти("ГруппаЭД") <> Неопределено Тогда
		ТекстЗаголовка = "ЭД";
		Если ЕстьНастройка Тогда
			ТекстЗаголовка = ТекстЗаголовка + " (" + ТекстСостоянияЭД + ")";
		КонецЕсли;
		Форма.Элементы.ГруппаЭД.Заголовок = ТекстЗаголовка;
	КонецЕсли;
	
	Возврат ТекстСостоянияЭД;
	
КонецФункции

// Возвращает ссылку старого объекта или ссылку нового объекта.
//
// Параметры:
//  Объект       - СправочникОбъект, ...
//  ЭтоНовый     - Булево (Возвращаемое значение).
//
Функция СсылкаОбъекта(Знач Объект) Экспорт
	
	Ссылка = Объект.Ссылка;
	ЭтоНовый = НЕ ЗначениеЗаполнено(Ссылка);
	
	Если ЭтоНовый Тогда
		Ссылка = Объект.ПолучитьСсылкуНового();
		
		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
			
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
			Ссылка = Менеджер.ПолучитьСсылку();
			Объект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ПолучитьКорректныйКодСтраны(КодСтраны) Экспорт
	
	Если КодСтраны = NULL Тогда
		Возврат "";
	КонецЕсли;
	
	Для К=1 По СтрДлина(КодСтраны) Цикл
		
		СимволКода = Сред(КодСтраны, К, 1);
		Если Найти("0123456789", СимволКода)=0 Тогда
			//Код страны в электронном документе должен содеражать только цифры
			Возврат "";
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КодСтраны;
	
КонецФункции

Функция ПризнакТовара(Товар) Экспорт
	
	Если ТипЗнч(Товар) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если ЗначениеЗаполнено(Товар)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "ТипНоменклатуры") = Перечисления.ТипыНоменклатуры.Запас Тогда
			Возврат "1"; // Имущество
		Иначе
			Возврат "3"; // Услуга
		КонецЕсли;
	Иначе
		Возврат "5"; // Иное
	КонецЕсли;
	
КонецФункции

Функция ВидЭлектронногоДокументаРеализации(Источник) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ВидЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидЭлектронногоДокумента");
		Если Не ЗначениеЗаполнено(ВидЭД) Тогда
			ВидЭД = Перечисления.ВидыЭД.ТОРГ12Продавец;
		КонецЕсли;
		Возврат ВидЭД;
	Иначе
		Возврат Источник.ВидЭлектронногоДокумента;
	КонецЕсли;
	
КонецФункции

Функция ВидЭлектронногоДокументаКорректировки(Источник) Экспорт
	
	ИсходныйИсправляемыйДокумент = Документы.КорректировкаРеализации.ПолучитьИсправляемыйДокументРеализации(Источник.ДокументОснование, Истина);
	ИсправляемыйДокумент = Документы.КорректировкаРеализации.ПолучитьИсправляемыйДокументРеализации(Источник.ДокументОснование);
	
	Если Источник.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение
		 ИЛИ (ТипЗнч(ИсправляемыйДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") 
		     И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсправляемыйДокумент, "ВидОперации") = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение) Тогда
		 
		// Выполняется согласованное изменение или исправление согласованного изменения
		Возврат Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель;
		
	ИначеЕсли ТипЗнч(ИсходныйИсправляемыйДокумент) = Тип("ДокументСсылка.РасходнаяНакладная")
		 ИЛИ ТипЗнч(ИсходныйИсправляемыйДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Возврат ВидЭлектронногоДокументаРеализации(ИсходныйИсправляемыйДокумент);
		
	ИначеЕсли ТипЗнч(ИсходныйИсправляемыйДокумент) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			
		Возврат Перечисления.ВидыЭД.АктИсполнитель;
		
	КонецЕсли;
	
	Возврат Перечисления.ВидыЭД.ПустаяСсылка();
	
КонецФункции

Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru='Загрузка электронных документов';uk='Загрузка электронных документов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

Функция НоменклатураКонтрагента(Контрагент, Идентификатор, Наименование)
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		// Заполним номенклатуру поставщика
		РеквизитыНоменклатурыПоставщика = Новый Структура;
		РеквизитыНоменклатурыПоставщика.Вставить("Владелец", Контрагент);
		РеквизитыНоменклатурыПоставщика.Вставить("Идентификатор", Идентификатор);
		НоменклатураПоставщикаСсылка = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("НоменклатураПоставщиков", ,
			РеквизитыНоменклатурыПоставщика);
		Если ЗначениеЗаполнено(НоменклатураПоставщикаСсылка) Тогда
			Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураПоставщикаСсылка, "Номенклатура");
		Иначе
			НоменклатураПоставщика = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
			НоменклатураПоставщика.Идентификатор = Идентификатор;
			НоменклатураПоставщика.Владелец     = Контрагент;
			НоменклатураПоставщика.Наименование = Наименование;
			
			НоменклатураПоставщика.Записать();
			Номенклатура = НоменклатураПоставщика.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Номенклатура;
	
КонецФункции

Процедура ЗаполнитьДокументыСделки(ДеревоДокумента, ДанныеШапки, Идентификатор = "договор") Экспорт
	
	ДоговорНаименование = ДанныеШапки.ДоговорНаименование;
	ДоговорНомер = ДанныеШапки.ДоговорНомер;
	ДоговорДата = ДанныеШапки.ДоговорДата;
	
	Если Не ЗначениеЗаполнено(ДоговорНаименование)
		ИЛИ (Не ЗначениеЗаполнено(ДоговорНомер) И Не ЗначениеЗаполнено(ДоговорДата)) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыСделки = Новый ТаблицаЗначений;
	ДокументыСделки.Колонки.Добавить("Наименование");
	ДокументыСделки.Колонки.Добавить("Номер");
	ДокументыСделки.Колонки.Добавить("Дата");
	ДокументыСделки.Колонки.Добавить("Идентификатор");
	
	НоваяСтрока = ДокументыСделки.Добавить();
	НоваяСтрока.Наименование = ДоговорНаименование;
	НоваяСтрока.Номер = ДоговорНомер;
	НоваяСтрока.Дата = ДоговорДата;
	НоваяСтрока.Идентификатор = Идентификатор;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ДокументыСделки, "ДокументыСделки");
	
КонецПроцедуры

Процедура ЗаполнитьОснования(ДеревоДокумента, ДанныеШапки) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.Основание) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОснования = Новый ТаблицаЗначений;
	ДокументыОснования.Колонки.Добавить("ДокОснованиеНаименование");
	ДокументыОснования.Колонки.Добавить("ДокОснованиеНомер");
	ДокументыОснования.Колонки.Добавить("ДокОснованиеДата");
	
	СтрокаДокументыОснования = ДокументыОснования.Добавить();
	СтрокаДокументыОснования.ДокОснованиеНаименование = ДанныеШапки.Основание;
	СтрокаДокументыОснования.ДокОснованиеНомер = ДанныеШапки.ОснованиеДата;
	СтрокаДокументыОснования.ДокОснованиеДата = ДанныеШапки.ОснованиеНомер;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ДокументыОснования, "Основание");
	
КонецПроцедуры

Процедура ЗаполнитьТранспортнуюНакладную(ДеревоДокумента, ДанныеШапки) Экспорт
	
	ТранспортнаяНакладная = Новый ТаблицаЗначений;
	ТранспортнаяНакладная.Колонки.Добавить("ТранспортнаяНакладнаяНомер");
	ТранспортнаяНакладная.Колонки.Добавить("ТранспортнаяНакладнаяДата");
	
	НоваяСтрока = ТранспортнаяНакладная.Добавить();
	НоваяСтрока.ТранспортнаяНакладнаяНомер = ДанныеШапки.НомерДокумента;
	НоваяСтрока.ТранспортнаяНакладнаяДата = ДанныеШапки.ДатаДокумента;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ТранспортнаяНакладная, "ТранспортнаяНакладная");
	
КонецПроцедуры




