////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы (УНФ)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                  Обработчики обновления таких библиотек должны быть вызваны ранее
//                                  обработчиков обновления данной библиотеки.
//                                  При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                  порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                  в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя	= "УправлениеНебольшойФирмойДляУкраины";
	Описание.Версия = "1.6.4.1";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей 
//                                  см. в процедуре ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.0.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//  Обработчик.Опциональный        = Истина;
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_РазделенныеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.0.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПервыйЗапуск_ОбщиеДанные";
	Обработчик.ОбщиеДанные = Истина;
	
	// Эквайринг
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьФлагВестиУчетРасчетовСБанкомЭквайрером";
	// Конец Эквайринг
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьОстаткиВзаиморасчетовКонтрагентовМонопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьРегистрНакопленияПродажиМонопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.6";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалениеДублейДвиженийПоРегиструЗапасы";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d50e5f0e-51c4-45de-9811-96c534941c20");
	Обработчик.Комментарий = НСтр("ru='Удаление дублей движений по регистру ""Запасы"".';uk='Видалення дублів рухів по регістру ""Запаси"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьПризнакАлкогольнойПродуции";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("98cfcf5d-8ae5-4b6e-9afa-12018bac86d7");
	Обработчик.Комментарий = НСтр("ru='Заполнение признака алкогольной продукции для номенклатуры.';uk='Заповнення ознаки алкогольної продукції для номенклатури.'");
	
    Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.8";
	Обработчик.Процедура = "КалендарныеГрафики.ОбновитьДанныеПроизводственныхКалендарей";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.9";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "РегистрыСведений.ОстаткиВзаиморасчетов.ОбновитьОстаткиВзаиморасчетов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.10";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьНаименованияДляПечатиХарактеристикНоменклатуры";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b79daca0-a1cd-4f7b-8b17-2ea00a2afca7");
	Обработчик.Комментарий = НСтр("ru='Заполнение наименований для печати для характеристик номенклатуры';uk='Заповнення найменувань для друку для характеристик номенклатури'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.11";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.СоздатьШаблоныНаименованийДляКатегорийНоменклатуры";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1322896b-6801-425c-aece-b23b0641f520");
	Обработчик.Комментарий = НСтр("ru='Создание шаблонов наименований для категорий';uk='Створення шаблонів найменувань для категорій'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Версия = "1.6.2.12";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИзменитьРасписаниеОчередиЦен";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("505900d3-0ae1-419b-addb-2460768eeb75");
	Обработчик.Комментарий = НСтр("ru='Изменяем расписание регламетного задания Очередь цен';uk='Змінюємо розклад регламетного завдання Черга цін'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.13";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Процедура = "КонтактнаяИнформацияУНФ.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fcf911c8-c029-4b50-b16f-94c0341a4324");
	Обработчик.Комментарий = НСтр("ru='Установка свойств поставляемых видов контактной информации.';uk='Установка властивостей видів контактної інформації, що поставляються.'");
	
	// Включение флага УказыватьОКТМО для вида контактной информации по торговым точкам
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.14";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Процедура = "КонтактнаяИнформацияУНФ.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fcf911c8-c029-4b50-b16f-94c0311a4324");
	Обработчик.Комментарий = НСтр("ru='Установка свойств поставляемых видов контактной информации.';uk='Установка властивостей видів контактної інформації, що поставляються.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.15";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОтключитьПроверкуКорректностиАдресовОрганизаций";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.16";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ВключитьМногострочноеПолеДляВидовКонтактнойИнформации";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.17";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОтчетыУНФ.Обновить";
	Обработчик.Идентификатор	= Новый УникальныйИдентификатор("23786b26-e726-4457-8318-53a72438dcce");
	Обработчик.Комментарий = НСтр("ru='Обновление дополнительных настроек отчетов.';uk='Оновлення додаткових налаштувань звітів.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.18";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОтчетыУНФ.ОбновитьТегиОтчетов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("98cfcf5d-8ae5-4b6e-9afa-12018bac85d6");
	Обработчик.Комментарий = НСтр("ru='Восстановление актуальности справочника тегов отчетов.';uk='Відновлення актуальності довідника тегів звітів.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.19";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновлениеБПО";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("829c88d0-a5a6-4d0a-acfd-5714e648fe83");
	Обработчик.Комментарий = НСтр("ru='Обновление драйверов библиотеки подключаемого оборудования';uk='Оновлення драйверів бібліотеки підключаємого обладнання'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.ОбщиеДанные                  = Ложь;
	Обработчик.УправлениеОбработчиками      = Ложь;
	Обработчик.РежимВыполнения              = "Оперативно";
	Обработчик.Версия    = "1.6.2.20";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалитьУстаревшиеОбработчики";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.21";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОчиститьЗначенияДлаЗаполненияРеквизитов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("45458ad8-036b-4ea8-b1bb-24e746db4ea6");
	Обработчик.Комментарий = НСтр("ru='Очистка значений для заполнения реквизитов.';uk='Очищення значень для заповнення реквізитів.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "1.6.2.22";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыУНФ.УстановитьПараметрыНабораСвойствСправочникаПроекты";
	Обработчик.Комментарий     = НСтр("ru='Подключение дополнительных реквизитов к справочнику Проекты';uk='Підключення додаткових реквізитів до довідника Проекти'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.23";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьРеквизитыСценариевПланирования";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.24";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПроверитьИспользованиеФактическогоСценария";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.25";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыПланПродаж";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e1fd15eb-fe3e-474b-81e7-027e8e4eefcb");
	Обработчик.Комментарий = НСтр("ru='Перенос дат начала и окончания планирования из справочника в документы ""План продаж""';uk='Перенесення дат початку і закінчення планування з довідника в документи ""План продажів""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.26";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыБюджета";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c3660265-4bef-470d-b8af-2f3455a70b31");
	Обработчик.Комментарий = НСтр("ru='Перенос дат начала и окончания планирования из справочника в документы ""Бюджет""';uk='Перенесення дат початку і закінчення планування з довідника в документи ""Бюджет""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия			= "1.6.2.27";
	Обработчик.Процедура		= "ОбновлениеИнформационнойБазыУНФ.УстановитьПараметрыНабораСвойствСправочникаПроекты";
	Обработчик.Комментарий		= НСтр("ru='Подключение дополнительных реквизитов к справочнику Проекты';uk='Підключення додаткових реквізитів до довідника Проекти'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.28";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьНастройкиОтчетов_1_6_5";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4a38548b-24a9-4b42-b69f-df427efb9bff");
	Обработчик.Комментарий = НСтр("ru='Обновление настроек отчетов';uk='Оновлення налаштувань звітів'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.29";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОчиститьЗаписиДублейСПустымИНН";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.ОбщиеДанные                  = Ложь;
	Обработчик.УправлениеОбработчиками      = Ложь;
	Обработчик.РежимВыполнения              = "Оперативно";
	Обработчик.Версия    = "1.6.2.30";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УдалитьУстаревшиеОбработчики";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Версия      = "1.6.2.31";
	Обработчик.Процедура   = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьРеквизитыКлючевыхОпераций";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.32";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.ПравилаРабочегоПроцесса.ЗаполнитьПоставляемыеПравила";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.33";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьВходящееИсходящееСобытие";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1af561da-a528-490a-9530-944824b1f578");
	Обработчик.Комментарий = НСтр("ru='Заполнение признака события ""Входящее/Исходящее""';uk='Заповнення ознаки події ""Вхідне/Вихідне""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.34";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИнициализироватьНовыеВозможностиПодсистемыИмпорта";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия      = "1.6.2.35";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия      = "1.6.2.36";
	Обработчик.Процедура   = "ОбновлениеИнформационнойБазыУНФ.ДобавитьВКалендарьЗадачуПоАлкогольнойДекларации12";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.37";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ДобавитьОграничениеДоступаПоВидуДоговоровКредитаИЗайма";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.38";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИнициализироватьНовыйСчетУчетаПодсистемыИмпорта";
	
	// МобильноеПриложение
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.39";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьКонстантуЭтоОбычноеПриложение";
	// Конец МобильноеПриложение
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия			= "1.6.2.40";
	Обработчик.Процедура		= "ОбновлениеИнформационнойБазыУНФ.УстановитьПараметрыНабораСвойствСправочникаСерийныеНомера";
	Обработчик.Комментарий		= НСтр("ru='Подключение дополнительных реквизитов к справочнику Серийные номера';uk='Підключення додаткових реквізитів до довідника Серійні номери'");

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.41";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьНастройкиОтчетов_1_6_6";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1afede5f-3c06-4646-a897-adfc32178313");
	Обработчик.Комментарий = НСтр("ru='Обновление настроек отчетов';uk='Оновлення налаштувань звітів'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия			= "1.6.2.42";
	Обработчик.Процедура		= "ОбновлениеИнформационнойБазыУНФ.УстановитьПараметрыНабораСвойствДокументаПриемИПередачаВРемонт";
	Обработчик.Комментарий		= НСтр("ru='Подключение дополнительных реквизитов к документу Прием и передача в ремонт';uk='Підключення додаткових реквізитів до документу Прийом і передача в ремонт'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.43";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.СинхронизироватьКонстантыИспользованияОрганизаций";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия      = "1.6.2.44";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИнициализироватьНовыйСпособХраненияПаролейОбменаССайтом";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.2.45";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьКИ_ФизическиеЛица_Email";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.46";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьСправочникиСостояний";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.47";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ЗаполнитьОсновныеВидыЗаказов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.48";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьЦветЗавершенныхСостоянийЗаказов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.49";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьВсеЗаказы";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a6850ce5-4bd3-4723-bfb6-5f211e36018d");
	Обработчик.Комментарий = НСтр("ru='Заполняет виды заказов и состояния в заказах покупателей, заказ-нарядах, заказах поставщикам, заказах на производство';uk='Заповнює види замовлень і стан в замовленнях покупців, замовленнях-нарядах, замовленнях постачальникам, замовленнях на виробництво'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.50";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОбновитьНастройкиОтчетов_1_6_7";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("eeefe3a3-d584-4cf8-9cb2-6875220436a2");
	Обработчик.Комментарий = НСтр("ru='Обновление настроек отчетов';uk='Оновлення налаштувань звітів'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.2.51";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИсправлениеЗаписейОЦенахДинамическихВидовЦен";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("87623a3f-d658-4895-bc65-f93d42103c4b");
	Обработчик.Комментарий = НСтр("ru='Исправление записей о ценах динамических видов цен';uk='Виправлення записів про ціни динамічних видів цін'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.52";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.УстановитьДатуПоследнейСинхронизацииСМобильнымПРиложением";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Версия = "1.6.2.53";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ОчиститьОчередьРасчетаЦенОтСтатическихВидовЦен";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Версия = "1.6.3.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУНФ.ИсправлениеЗаписейОЦенахДинамическихВидовЦен";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0a7221e8-063b-4af9-a658-e7224ff2f1ce");
	Обработчик.Комментарий = НСтр("ru='Исправление записей о ценах динамических видов цен';uk='Виправлення записів про ціни динамічних видів цін'");
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	
	
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

Процедура ЗагрузитьОКУН() Экспорт
	
	Справочники.ОКУН.ЗагрузитьКлассификатор();
	Справочники.ОКУН.ПроставитьВидДеятельностиОКУН();
	
КонецПроцедуры

// заполняет РС КоэффициентДефлятор
//
Процедура ЗаполнитьКоэффициентДефлятор() Экспорт
	
	// переписываем сразу весь набор
	Набор = РегистрыСведений.КоэффициентДефлятор.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20030101';
	Запись.Значение = 1;
	
	Запись = Набор.Добавить();
	Запись.Период = '20040101';
	Запись.Значение = 1.133;
	
	Запись = Набор.Добавить();
	Запись.Период = '20050101';
	Запись.Значение = 1.104;
	
	Запись = Набор.Добавить();
	Запись.Период = '20060101';
	Запись.Значение = 1.132;
	
	Запись = Набор.Добавить();
	Запись.Период = '20070101';
	Запись.Значение = 1.096;
	
	Запись = Набор.Добавить();
	Запись.Период = '20080101';
	Запись.Значение = 1.081;
	
	Запись = Набор.Добавить();
	Запись.Период = '20090101';
	Запись.Значение = 1.148;
	
	Запись = Набор.Добавить();
	Запись.Период = '20100101';
	Запись.Значение = 1.295;
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.Значение = 1.372;
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.Значение = 1.4942;
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.Значение = 1.569;
	
	Запись = Набор.Добавить();
	Запись.Период = '20140101';
	Запись.Значение = 1.672;
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.Значение = 1.798;
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.Значение = 1.798;
	
	Набор.Записать();
	
КонецПроцедуры

// Заполнять РС МРОТ
//
Процедура ЗагрузитьМРОТ() Экспорт
	
	
	//Набор = РегистрыСведений.МРОТ.СоздатьНаборЗаписей();
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20000701';
	//Запись.Значение = 132;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20010101';
	//Запись.Значение = 200;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20010701';
	//Запись.Значение = 300;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20020501';
	//Запись.Значение = 450;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20031001';
	//Запись.Значение = 600;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20050101';
	//Запись.Значение = 720;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20050901';
	//Запись.Значение = 800;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20060501';
	//Запись.Значение = 1100;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20070901';
	//Запись.Значение = 2300;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20090101';
	//Запись.Значение = 4330;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20110601';
	//Запись.Значение = 4611;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20130101';
	//Запись.Значение = 5205;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20140101';
	//Запись.Значение = 5554;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20150101';
	//Запись.Значение = 5965;
	//
	//Запись = Набор.Добавить();
	//
	//Запись.Период = '20160101';
	//Запись.Значение = 6204;
	//
	//Набор.Записать();
	
	ЗагрузитьМРОТИзМакета("НачальноеЗаполнение,Заполнение2011,Заполнение2015");
	
КонецПроцедуры

Процедура ЗагрузитьМРОТИзМакета(ИмяМакета)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МРОТ.Период
	|ИЗ
	|	РегистрСведений.МРОТ КАК МРОТ");
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивМакетов = СтрРазделить(ИмяМакета, ",");
	
	Набор = РегистрыСведений.МРОТ.СоздатьНаборЗаписей();
	
	Для каждого НаимМакет Из МассивМакетов Цикл
		
		Макет = РегистрыСведений.МРОТ.ПолучитьМакет(НаимМакет);
		
		КоличествоЗаписей = Макет.ВысотаТаблицы;
		
		Для Сч = 2 по КоличествоЗаписей Цикл
			
			Период  = СокрЛП(Макет.Область(Сч, 1).Текст);
			Сумма	= СокрЛП(Макет.Область(Сч, 3).Текст);
			
			МассивЧастейДаты = СтрРазделить(Период, ".");
						
			Запись = Набор.Добавить();
			
			Запись.Период = МассивЧастейДаты[2] + МассивЧастейДаты[1] + МассивЧастейДаты[0];
			Запись.Значение = Число(Сумма);
			
			Набор.Записать();
			
		КонецЦикла;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗагрузитьНДФЛСтавкиНалогов() Экспорт
	
	ЗагрузитьНДФЛСтавкиНалоговИзМакета("НачальноеЗаполнение,Заполнение2011,Заполнение2015");
	
КонецПроцедуры

Процедура ЗагрузитьНДФЛСтавкиНалоговИзМакета(ИмяМакета)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НДФЛСтавкиНалогов.Период
	|ИЗ
	|	РегистрСведений.НДФЛСтавкиНалогов КАК НДФЛСтавкиНалогов");
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивМакетов = СтрРазделить(ИмяМакета, ",");
	
	Набор = РегистрыСведений.НДФЛСтавкиНалогов.СоздатьНаборЗаписей();
	
	Для каждого НаимМакет Из МассивМакетов Цикл
		
		Макет = РегистрыСведений.НДФЛСтавкиНалогов.ПолучитьМакет(НаимМакет);
		
		КоличествоЗаписей = Макет.ВысотаТаблицы;
		
		Для Сч = 2 по КоличествоЗаписей Цикл
			
			Период  = СокрЛП(Макет.Область(Сч, 1).Текст);
			Налог   = СокрЛП(Макет.Область(Сч, 2).Текст);
			Ставка1	= СокрЛП(Макет.Область(Сч, 4).Текст);
			Ставка2	= СокрЛП(Макет.Область(Сч, 5).Текст);
			Порог	= СокрЛП(Макет.Область(Сч, 6).Текст);
			
			МассивЧастейДаты = СтрРазделить(Период, ".");
						
			Запись = Набор.Добавить();
			
			Запись.Период = МассивЧастейДаты[2] + МассивЧастейДаты[1] + МассивЧастейДаты[0];
			Запись.Налог = Справочники.ВидыНачисленийИУдержаний[Налог];
			Запись.Порог = Число(Порог);
			Запись.Ставка1 = Число(Ставка1);
			Запись.Ставка2 = Число(Ставка2);
			
			Набор.Записать();
			
		КонецЦикла;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗагрузитьПрожиточныйМинимум() Экспорт
	
	ЗагрузитьПрожиточныйМинимумИзМакета("НачальноеЗаполнение,Заполнение2011,Заполнение2015");

КонецПроцедуры

Процедура ЗагрузитьПрожиточныйМинимумИзМакета(ИмяМакета)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрожиточныйМинимум.Период
	|ИЗ
	|	РегистрСведений.ПрожиточныйМинимум КАК ПрожиточныйМинимум");
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивМакетов = СтрРазделить(ИмяМакета, ",");
	
	Набор = РегистрыСведений.ПрожиточныйМинимум.СоздатьНаборЗаписей();
	
	Для каждого НаимМакет Из МассивМакетов Цикл
		
		Макет = РегистрыСведений.ПрожиточныйМинимум.ПолучитьМакет(НаимМакет);
		
		КоличествоЗаписей = Макет.ВысотаТаблицы;
		
		Для Сч = 2 по КоличествоЗаписей Цикл
			
			Период  = СокрЛП(Макет.Область(Сч, 1).Текст);
			Сумма	= СокрЛП(Макет.Область(Сч, 3).Текст);
			
			МассивЧастейДаты = СтрРазделить(Период, ".");
						
			Запись = Набор.Добавить();
			
			Запись.Период = МассивЧастейДаты[2] + МассивЧастейДаты[1] + МассивЧастейДаты[0];
			Запись.Значение = Число(Сумма);
			
			Набор.Записать();
			
		КонецЦикла;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьВидДоговораПоГК()

	ВидБартер 	= Справочники.ВидыДоговоровПоГК.Бартер;
	ВидКомиссии = Справочники.ВидыДоговоровПоГК.Комиссия;
	ВидПрочее 	= Справочники.ВидыДоговоровПоГК.Поставка;
	
	Выборка = Справочники.ДоговорыКонтрагентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;	
		
		Дог = Выборка.ПолучитьОбъект();
		
		Если Дог.ВидДоговора = Перечисления.ВидыДоговоров.Бартерный Тогда
			Дог.ВидДоговораПоГК = ВидБартер;
		ИначеЕсли Дог.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером
			ИЛИ Дог.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом Тогда
			Дог.ВидДоговораПоГК = ВидКомиссии;
		Иначе
			Дог.ВидДоговораПоГК = ВидПрочее;
		КонецЕсли;
		
		Попытка
			Дог.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

// Выполняет начальное заполнение плана счетов
//
Процедура ЗаполнитьПланСчетов()
	
	ТаблицаСчетов = Новый ТаблицаЗначений;
	ТаблицаСчетов.Колонки.Добавить("Имя");
	ТаблицаСчетов.Колонки.Добавить("Ссылка");
	
	
	Менеджер = ПланыСчетов["Управленческий"];
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСправочника.Ссылка
	|ИЗ
	|	ПланСчетов.Управленческий КАК ТаблицаСправочника
	|ГДЕ
	|	ТаблицаСправочника.Предопределенный = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Имя = Менеджер.ПолучитьИмяПредопределенного(Выборка.Ссылка);
		Если НЕ ПустаяСтрока(Имя) Тогда
			 Результат.Добавить(Имя,Имя);
			 НоваяСтрока = ТаблицаСчетов.Добавить();
			 НоваяСтрока.Имя = Имя;
			 НоваяСтрока.Ссылка = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла; 

	
	Сч = 100;
	Выборка = ПланыСчетов.Управленческий.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектПС = Выборка.ПолучитьОбъект();
		ОбъектПС.Код = Строка(Сч);
		ОбъектПС.Записать();
		Сч = Сч + 1;
	КонецЦикла;
		
	ИмяМакета = "НачальноеЗаполнение";
		
	Макет = ПланыСчетов.Управленческий.ПолучитьМакет(ИмяМакета);
		
	КоличествоЗаписей = Макет.ВысотаТаблицы;
	
	Для Сч = 3 по КоличествоЗаписей Цикл
		
		//Предопределенные реквизиты
		Имя 			= Макет.Область(Сч, 1).Текст;
		Код 			= Макет.Область(Сч, 2).Текст;
		Наименование	= Макет.Область(Сч, 3).Текст;
		КодУкр 			= Макет.Область(Сч, 4).Текст;
		
		НайденнаяСтрока = ТаблицаСчетов.Найти(СокрЛП(Имя), "Имя");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;			
		КонецЕсли;
		
		ОбъектПС = НайденнаяСтрока.Ссылка.ПолучитьОбъект();
		
		ОбъектПС.Код = КодУкр;
		ОбъектПС.Порядок = КодУкр;
		
		ОбъектПС.Записать();
		
	КонецЦикла;
 	
КонецПроцедуры // ЗаполнитьПланСчетов(ИмяОбъекта)

Процедура ЗаполнитьПроизводственныйКалендарь() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ПроизводственныйКалендарь = ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			ОрганизацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
			Если ОрганизацияОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ОрганизацияОбъект.ПроизводственныйКалендарь = УправлениеНебольшойФирмойСервер.ПолучитьКалендарьПоПроизводственномуКалендарюУкраины();
			
			// Запись обработанного объекта.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрганизацияОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСправочникВидыДоговоровПоГК(ИмяМакета)

	Макет = Справочники.ВидыДоговоровПоГК.ПолучитьМакет(ИмяМакета);
	
	КоличествоЗаписей = Макет.ВысотаТаблицы;
	
	Для Сч = 2 по КоличествоЗаписей Цикл
		
		Имя 			= Макет.Область(Сч, 1).Текст;
		Код 			= Макет.Область(Сч, 2).Текст;
		Наименование	= Макет.Область(Сч, 3).Текст;
		
		Элемент = Справочники.ВидыДоговоровПоГК.НайтиПоНаименованию(Имя); 
		
		Если Элемент.Пустая() Тогда
			
			НовыйЭлемент = Справочники.ВидыДоговоровПоГК.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Записать();
			
		Иначе
			
			Объект = Элемент.ПолучитьОбъект();
			Объект.Наименование = Наименование;
			Объект.Записать();
		
		КонецЕсли; 
		
	КонецЦикла;
	

КонецПроцедуры

Процедура ОбновитьВидыСтатейНалоговыхДеклараций() Экспорт
	
	ОбновитьВидыСтатейНалоговыхДекларацийИзМакета("НачальноеЗаполнение");
	
КонецПроцедуры

Процедура ОбновитьВидыСтатейНалоговыхДекларацийИзМакета(ИмяМакета)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатьиНалоговыхДеклараций.ВидНалоговойДекларации,
	|	СтатьиНалоговыхДеклараций.ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.СтатьиНалоговыхДеклараций КАК СтатьиНалоговыхДеклараций
	|ГДЕ
	|	СтатьиНалоговыхДеклараций.ВидНалоговойДекларации = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхДеклараций.ПустаяСсылка)");
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Справочники.СтатьиНалоговыхДеклараций.ПолучитьМакет(ИмяМакета);
	
	КоличествоЗаписей = Макет.ВысотаТаблицы;
	
	Для Сч = 2 по КоличествоЗаписей Цикл
		
		Имя  = СокрЛП(Макет.Область(Сч, 1).Текст);
		Вид	= СокрЛП(Макет.Область(Сч, 4).Текст);
		
		РедактируемаяСтатья = Справочники.СтатьиНалоговыхДеклараций[Имя].ПолучитьОбъект();
		
		Если Не ЗначениеЗаполнено(РедактируемаяСтатья.ВидНалоговойДекларации) Тогда
			
			Попытка
				РедактируемаяСтатья.ВидНалоговойДекларации = Перечисления.ВидыНалоговыхДеклараций[Вид];
				РедактируемаяСтатья.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПервогоЗапуска

// Процедуры обслуживающие первый запуск (<номер шага при первом запуске>)

//(1) Процедура загружает управленческий план счетов из макета.
//
Процедура ЗагрузитьУправленческийПланСчетовПервыйЗапуск()
	
	// 00.
	Счет = ПланыСчетов.Управленческий.Служебный.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 01.
	Счет = ПланыСчетов.Управленческий.ВнеоборотныеАктивы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ВнеоборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 02.
	Счет = ПланыСчетов.Управленческий.АмортизацияВнеоборотныхАктивов.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.АмортизацияВнеоборотныхАктивов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 08.
	Счет = ПланыСчетов.Управленческий.ВложенияВоВнеоборотныеАктивы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеВнеоборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 10.
	Счет = ПланыСчетов.Управленческий.СырьеИМатериалы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Запасы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 20.
	Счет = ПланыСчетов.Управленческий.НезавершенноеПроизводство.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство;
	Счет.СчетЗакрытия = ПланыСчетов.Управленческий.ТоварыПродукция;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 25.
	Счет = ПланыСчетов.Управленческий.КосвенныеЗатраты.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты;
	Счет.СчетЗакрытия = ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска;
	Счет.Записать();
	
	// 41.
	Счет = ПланыСчетов.Управленческий.ТоварыПродукция.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Запасы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 42.
	Счет = ПланыСчетов.Управленческий.ТорговаяНаценка.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ТорговаяНаценка;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 50.
	Счет = ПланыСчетов.Управленческий.Касса.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 51.
	Счет = ПланыСчетов.Управленческий.Банк.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 57.
	Счет = ПланыСчетов.Управленческий.ПереводыВПути.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 58.
	Счет = ПланыСчетов.Управленческий.ФинансовыеВложения.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДенежныеСредства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 60.
	Счет = ПланыСчетов.Управленческий.РасчетыСПоставщикамиИПодрядчиками.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 60.01
		Счет = ПланыСчетов.Управленческий.РасчетыСПоставщиками.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПоставщикамиИПодрядчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 60.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПоставщикамиИПодрядчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
	// 62.
	Счет = ПланыСчетов.Управленческий.РасчетыСПокупателямиИЗаказчиками.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 62.01
		Счет = ПланыСчетов.Управленческий.РасчетыСПокупателями.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПокупателямиИЗаказчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 62.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПокупателямиИЗаказчиками;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
	// 66.
	Счет = ПланыСчетов.Управленческий.РасчетыПоКраткосрочнымКредитамИЗаймам.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.КредитыИЗаймы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 67.
	Счет = ПланыСчетов.Управленческий.РасчетыПоДолгосрочнымКредитамИЗаймам.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ДолгосрочныеОбязательства;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 68.
	Счет = ПланыСчетов.Управленческий.РасчетыПоНалогам.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 68.01
		Счет = ПланыСчетов.Управленческий.Налоги.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыПоНалогам;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 68.02
		Счет = ПланыСчетов.Управленческий.НалогиКВозмещению.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыПоНалогам;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	
	// 70.
	Счет = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоОплатеТруда.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 71.
	Счет = ПланыСчетов.Управленческий.РасчетыСПодотчетнымиЛицами.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 71.01
		Счет = ПланыСчетов.Управленческий.РасчетыСПодотчетниками.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПодотчетнымиЛицами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 71.02
		Счет = ПланыСчетов.Управленческий.ПерерасходПодотчетников.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПодотчетнымиЛицами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
	// Прочие расчеты
	// 73
	Счет = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоПрочимОперациям.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 73.01
		Счет = ПланыСчетов.Управленческий.РасчетыПоПредоставленнымЗаймам.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоПрочимОперациям;
		Счет.ТипСчета = Перечисления.ТипыСчетов.КредитыИЗаймы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 73.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоВозмещениюМатериальногоУщерба.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСПерсоналомПоПрочимОперациям;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	
	// 75
	Счет = ПланыСчетов.Управленческий.РасчетыСУчредителями.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 75.01
		Счет = ПланыСчетов.Управленческий.РасчетыПоВкладамВУставныйКапитал.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСУчредителями;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 75.02
		Счет = ПланыСчетов.Управленческий.РасчетыПоВыплатеДоходов.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСУчредителями;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	
	// 76
	Счет = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 76.01
		Счет = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторами.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Дебиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 76.02
		Счет = ПланыСчетов.Управленческий.РасчетыСРазнымиКредиторами.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.РасчетыСРазнымиДебиторамиИКредиторами;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
	// Конец Прочие расчеты
	
	// 80.
	Счет = ПланыСчетов.Управленческий.УставныйКапитал.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.Капитал;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 82.
	Счет = ПланыСчетов.Управленческий.РезервныйИДобавочныйКапитал.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.РезервныйИДобавочныйКапитал;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 84.
	Счет = ПланыСчетов.Управленческий.НераспределеннаяПрибыль.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.НераспределеннаяПрибыль;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();

	// 90.
	Счет = ПланыСчетов.Управленческий.Продажи.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 90.01
		Счет = ПланыСчетов.Управленческий.ВыручкаОтПродаж.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Доходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 90.02
		Счет = ПланыСчетов.Управленческий.СебестоимостьПродаж.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.СебестоимостьПродаж;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 90.07
		Счет = ПланыСчетов.Управленческий.КоммерческиеРасходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Расходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
		// 90.08
		Счет = ПланыСчетов.Управленческий.УправленческиеРасходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.Продажи;
		Счет.ТипСчета = Перечисления.ТипыСчетов.Расходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
	// 91.
	Счет = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 91.01
		Счет = ПланыСчетов.Управленческий.ПрочиеДоходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеДоходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
		// 91.02
		Счет = ПланыСчетов.Управленческий.ПрочиеРасходы.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
		// 91.03
		Счет = ПланыСчетов.Управленческий.ПроцентыПоКредитам.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрочиеДоходыИРасходы;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПроцентыПоКредитам;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж;
		Счет.Записать();
		
	// 94.
	Счет = ПланыСчетов.Управленческий.НедостачиИПотериОтПорчиЦенностей.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 97.
	Счет = ПланыСчетов.Управленческий.РасходыБудущихПериодов.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
	// 99.
	Счет = ПланыСчетов.Управленческий.ПрибылиИУбытки.ПолучитьОбъект();
	Счет.ТипСчета = Перечисления.ТипыСчетов.ГруппаСчетов;
	Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	Счет.Записать();
	
		// 99.01
		Счет = ПланыСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрибылиИУбытки;
		Счет.ТипСчета = Перечисления.ТипыСчетов.ПрибылиУбытки;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();
		
		// 99.02
		Счет = ПланыСчетов.Управленческий.ПрибылиИУбытки_НалогНаПрибыль.ПолучитьОбъект();
		Счет.Родитель = ПланыСчетов.Управленческий.ПрибылиИУбытки;
		Счет.ТипСчета = Перечисления.ТипыСчетов.НалогНаПрибыль;
		Счет.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
		Счет.Записать();		
		
КонецПроцедуры // ЗагрузитьУправленческийПланСчетовПервыйЗапуск()

//(3) Процедура заполняет в ИБ справочник "Виды налогов".
//
Процедура ЗаполнитьВидыНалоговПервыйЗапуск()
	
	// 1. НДС.
	ВидНалога = Справочники.ВидыНалогов.СоздатьЭлемент();
	ВидНалога.Наименование = НСтр("ru='НДС';uk='ПДВ'");
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	// 2. Налог на прибыль.
	ВидНалога = Справочники.ВидыНалогов.СоздатьЭлемент();
	ВидНалога.Наименование = НСтр("ru='Налог на прибыль';uk='Податок на прибуток'");
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.Взносы.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ВоенныйСбор.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ОплатаТруда.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ЕСВ.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
КонецПроцедуры // ЗаполнитьВидыНалоговПервыйЗапуск()

//(5) Функция заполняет в ИБ спрвочник "Ставки НДС" и возвращает
// ссылку на ставку НДС 18% для дальнейшего использования.
//
Функция ЗаполнитьСтавкиНДСПервыйЗапуск()

	// НДС 0
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "0%";
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.Записать();
	
	// Без НДС
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = НСтр("ru='Без НДС';uk='Без ПДВ'");
	СтавкаНДС.НеОблагается = Истина;
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.Записать(); 
						 	
	// Не НДС
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = НСтр("ru='Не НДС';uk='Не ПДВ'");
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.НеОблагается = Истина;
	СтавкаНДС.Записать();
	
	// НДС 7
	СтавкаНДС = Справочники.СтавкиНДС.СоздатьЭлемент();
	СтавкаНДС.Наименование = "7%";
	СтавкаНДС.Ставка = 7;
	СтавкаНДС.Записать();
	
	// НДС 20
	СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.ПолучитьОбъект();
	СтавкаНДС.Ставка = 20;
	СтавкаНДС.Записать();

	Возврат СтавкаНДС.Ссылка;

КонецФункции // ЗаполнитьСтавкиНДСПервыйЗапуск()

//(7) Процедура создает график работы на основе производственного календаря 
// Украины по шаблону "Пятидневка"
//
Процедура СоздатьКалендарьПятидневкаУкраины() Экспорт
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ПроизводственныйКалендарьУкраины();
	Если ПроизводственныйКалендарь = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Справочники.Календари.НайтиПоРеквизиту("ПроизводственныйКалендарь", ПроизводственныйКалендарь).Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	НовыйГрафикРаботы = Справочники.Календари.СоздатьЭлемент();
	НовыйГрафикРаботы.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроизводственныйКалендарь, "Наименование");
	НовыйГрафикРаботы.ПроизводственныйКалендарь = ПроизводственныйКалендарь;
	НовыйГрафикРаботы.СпособЗаполнения = Перечисления.СпособыЗаполненияГрафикаРаботы.ПоНеделям;
	НовыйГрафикРаботы.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	НовыйГрафикРаботы.УчитыватьПраздники = Истина;
	
	// Заполняем недельный цикл как пятидневку
	Для НомерДня = 1 По 7 Цикл
		НовыйГрафикРаботы.ШаблонЗаполнения.Добавить().ДеньВключенВГрафик = НомерДня <= 5;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйГрафикРаботы, Истина, Истина);
	
КонецПроцедуры // СоздатьКалендарьПятидневкаУкраины()

//(14) Процедура заполняет классификатор использования рабочего времени.
//
Процедура ЗаполнитьКлассификаторИспользованияРабочегоВремени()

	//
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ВыходныеДни;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Выходные (еженедельного отдыха), праздничные и нерабочие дни";
	ВидыРабочегоВремени.Записать();
	
	// БЗ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Другие отпуска без сохранения заработной платы";
	ВидыРабочегоВремени.Записать();
	
	// В.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОсновнойОтпуск;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Отпуск основной ежегодный (ст. 6 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// ВД.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Командировка;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Командировки";
	ВидыРабочегоВремени.Записать();
	
	// ВП.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускПоБеременностиИРодам;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Отпуск в связи с беременностью и родами (ст. 17 Закона Украины Об отпусках) и отпуск по уходу за ребенком до 3 лет (ст. 18 Закона Украины Об отпусках)";
	ВидыРабочегоВремени.Записать();
	
	// ВЧ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.РаботаВечерниеЧасы;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Вечерние часы работы";
	ВидыРабочегоВремени.Записать();
	
	// Д.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ДополнительныйОтпуск;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Ежегодный дополнительный отпуск (ст. 7, 8 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// ДБ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Дополнительный отпуск без сохранения заработной платы (ст. 25 кроме п. 3, 12, 13, 17 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// ДД.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускПоУходуЗаРебенком;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Отпуск по уходу за ребенком до 6 лет (ст. 25 п. 3 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// ДО.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускДополнительныйНаДетей;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Дополнительный оплачиваемый отпуск работникам имеющим детей (ст. 19 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// І.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ДругиеНеявки;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Другие виды неявок";
	ВидыРабочегоВремени.Записать();
	
	// ІВ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ДругиеНеявкиПоКолДоговору;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Другие виды неявок, предусмотренных коллективным договором";
	ВидыРабочегоВремени.Записать();
	
	// ІН.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.НеотработанноеВремяПоЗаконодательству;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Другое неотработанное время, предусмотренное законодательством";
	ВидыРабочегоВремени.Записать();
	
	// Н.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускНаОбучение;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Дополнительный отпуск в связи с обучением (ст. 13, 14, 15 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// НА.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Отпуск без сохранения заработной платы по соглашению сторон (ст. 26 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// НБ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Отпуск без сохранения заработной платы в связи с обучением (п. 12, 13, 17 ст. 25  Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// НД.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ПереводНаНеполныйДень;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Неявки по причине перевода по инициативе работодалея на неполный рабочий день (неделю)";
	ВидыРабочегоВремени.Записать();
	
	// НЗ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.НеявкиПоНевыясненнымПричинам;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Неявки по невыясненным причинам";
	ВидыРабочегоВремени.Записать();
	
	// НН.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.БолезньБезОплаты;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Неоплачиваемая временная нетрудоспособность в случаях, предусмотренных законодательством (бытовая травма и т.п.)";
	ВидыРабочегоВремени.Записать();
	
	// НП.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ПереводНаДругуюРаботу;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Неявки в связи с временным переводом на другое предприятие";
	ВидыРабочегоВремени.Записать();
	
	// НУ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Сверхурочные;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Сверхурочные часы работы";
	ВидыРабочегоВремени.Записать();
	
	// П.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Простой;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Простои";
	ВидыРабочегоВремени.Записать();
	
	// ПР.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Прогулы;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Прогулы";
	ВидыРабочегоВремени.Записать();
	
	// Р.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Работа;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Часы работы, предусмотренные колдоговором";
	ВидыРабочегоВремени.Записать();
	
	// РВ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.РаботаВыходныеИПраздничные;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Часы работы в выходные и праздничные дни";
	ВидыРабочегоВремени.Записать();
	
	// РН.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.РаботаНочныеЧасы;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Ночные часы работы";
	ВидыРабочегоВремени.Записать();
	
	// РС.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.РаботаНеполныйРабочийДень;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Часы работы работникам, которым установлен неполный рабочий день (неделя) согласно законодательства";
	ВидыРабочегоВремени.Записать();
	
	// С.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Забастовка;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Массовые невыходы на работу (забастовки)";
	ВидыРабочегоВремени.Записать();
	
	// ТВ.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускТворческий;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Творческий отпуск (ст. 16 Закона Украины Про отпуска)";
	ВидыРабочегоВремени.Записать();
	
	// ТН.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.Болезнь;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Оплачиваемая временная нетрудоспособность";
	ВидыРабочегоВремени.Записать();
	
	// Ч.
	ВидыРабочегоВремениСсылка = Справочники.ВидыРабочегоВремени.ОтпускЧернобыльский;
	ВидыРабочегоВремени = ВидыРабочегоВремениСсылка.ПолучитьОбъект();
	ВидыРабочегоВремени.ПолноеНаименование = "Дополнительный отпуск (ст. 20, 21, 30 Закона Украины Про статус и социальную защиту граждан пострадавших в результате Чорнобыльской катастрофы)";
	ВидыРабочегоВремени.Записать();

КонецПроцедуры // ЗаполнитьКлассификаторИспользованияРабочегоВремени()

//(15) Процедура заполняет справочники "Параметры расчетов" и "Виды начислений и удержаний".
//
Процедура ЗаполнитьПараметрыРасчетовИВидыНачислений()
	
	// Параметры расчетов.
	
	// Сумму продаж по ответственному (СПО)
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("СуммуПродажПоОтветственному") Тогда
		
		ПараметрРасчетовСПО = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		
		ПараметрРасчетовСПО.Наименование 		 = "Сумму продаж по ответственному";
		ПараметрРасчетовСПО.Идентификатор 	 = "СуммуПродажПоОтветственному"; 
		ПараметрРасчетовСПО.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовСПО.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаУчетаКурс";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаУчетаКурс";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаДокументаКратность";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаДокументаКратность";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаДокументаКурс";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаДокументаКурс";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ВалютаУчетаКратность";
		НовыйПараметрЗапроса.Представление 			 = "ВалютаУчетаКратность";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "НачалоПериода";
		НовыйПараметрЗапроса.Представление 			 = "НачалоПериода";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "КонецПериода";
		НовыйПараметрЗапроса.Представление 			 = "КонецПериода";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Организация";
		НовыйПараметрЗапроса.Представление 			 = "Организация";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Подразделение";
		НовыйПараметрЗапроса.Представление 			 = "Подразделение";
		
		НовыйПараметрЗапроса 						 = ПараметрРасчетовСПО.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Сотрудник";
		НовыйПараметрЗапроса.Представление 			 = "Сотрудник";
		
		ПараметрРасчетовСПО.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(Продажи.Сумма * &ВалютаУчетаКурс * &ВалютаДокументаКратность / (&ВалютаДокументаКурс * &ВалютаУчетаКратность), 0)) КАК СуммаПродаж
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Сумма >= 0
		|	И Продажи.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Продажи.Организация = &Организация
		|	И Продажи.Подразделение = &Подразделение
		|	И Продажи.Ответственный = &Сотрудник
		|	И (ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.АктВыполненныхРабот) ССЫЛКА Документ.АктВыполненныхРабот
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ЗаказПокупателя) ССЫЛКА Документ.ЗаказПокупателя
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ОтчетОПереработке) ССЫЛКА Документ.ОтчетОПереработке
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ОтчетОРозничныхПродажах) ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.РасходнаяНакладная) ССЫЛКА Документ.РасходнаяНакладная
		|			ИЛИ ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ЧекККМ) ССЫЛКА Документ.ЧекККМ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Продажи.Ответственный";
		
		ПараметрРасчетовСПО.Записать();
		
	КонецЕсли;
	
	// Фиксированная сумма
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ФиксированнаяСумма") Тогда
		
		ПараметрРасчетовФиксированнаяСумма = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовФиксированнаяСумма.Наименование 				= "Фиксированная сумма";
		ПараметрРасчетовФиксированнаяСумма.Идентификатор 	 			= "ФиксированнаяСумма";
		ПараметрРасчетовФиксированнаяСумма.ПроизвольныйЗапрос 			= Ложь;
		ПараметрРасчетовФиксированнаяСумма.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовФиксированнаяСумма.Записать();
		
	КонецЕсли;
	
	// Норма дней
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("НормаДней") Тогда
		
		ПараметрРасчетовНормаДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаДней.Наименование 		 = "Норма дней";
		ПараметрРасчетовНормаДней.Идентификатор 	 = "НормаДней";
		ПараметрРасчетовНормаДней.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаДней.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Организация";
		НовыйПараметрЗапроса.Представление 			 = "Организация";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаДней.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		ПараметрРасчетовНормаДней.Запрос 			 = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК НормаДней
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КалендарныеГрафики.Календарь = Организации.ПроизводственныйКалендарь
		|			И (Организации.Ссылка = &Организация)
		|ГДЕ
		|	КалендарныеГрафики.Год = ГОД(&ПериодРегистрации)
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И КалендарныеГрафики.ДеньВключенВГрафик";
		
		ПараметрРасчетовНормаДней.Записать();
		
	КонецЕсли;
	
	// Норма часов
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("НормаЧасов") Тогда
		
		ПараметрРасчетовНормаЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаЧасов.Наименование 	  = "Норма часов";
		ПараметрРасчетовНормаЧасов.Идентификатор 	  = "НормаЧасов";
		ПараметрРасчетовНормаЧасов.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовНормаЧасов.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "Организация";
		НовыйПараметрЗапроса.Представление 			 = "Организация";
		НовыйПараметрЗапроса 						 = ПараметрРасчетовНормаЧасов.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя 					 = "ПериодРегистрации";
		НовыйПараметрЗапроса.Представление 			 = "Период регистрации";
		ПараметрРасчетовНормаЧасов.Запрос 			 = 
		"ВЫБРАТЬ
		|	СУММА(8) КАК НормаЧасов
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КалендарныеГрафики.Календарь = Организации.ПроизводственныйКалендарь
		|			И (Организации.Ссылка = &Организация)
		|ГДЕ
		|	КалендарныеГрафики.Год = ГОД(&ПериодРегистрации)
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И КалендарныеГрафики.ДеньВключенВГрафик";
		ПараметрРасчетовНормаЧасов.Записать();
		
	КонецЕсли;
	
	// Отработано дней
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ОтработаноДней") Тогда
		
		ПараметрРасчетовОтработаноДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовОтработаноДней.Наименование 	  = "Отработано дней";
		ПараметрРасчетовОтработаноДней.Идентификатор	  = "ОтработаноДней";
		ПараметрРасчетовОтработаноДней.ПроизвольныйЗапрос = Ложь;
		ПараметрРасчетовОтработаноДней.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовОтработаноДней.Записать();
		
	КонецЕсли;
	
	// Отработано часов
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ОтработаноЧасов") Тогда
		
		ПараметрРасчетовОтработаноЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовОтработаноЧасов.Наименование 	   = "Отработано часов";
		ПараметрРасчетовОтработаноЧасов.Идентификатор 	   = "ОтработаноЧасов";
		ПараметрРасчетовОтработаноЧасов.ПроизвольныйЗапрос = Ложь;
		ПараметрРасчетовОтработаноЧасов.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовОтработаноЧасов.Записать();
		
	КонецЕсли;
	
	// Тарифная ставка
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ТарифнаяСтавка") Тогда
		
		ПараметрРасчетовТарифнаяСтавка = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовТарифнаяСтавка.Наименование 	  = "Тарифная ставка";
		ПараметрРасчетовТарифнаяСтавка.Идентификатор 	  = "ТарифнаяСтавка";
		ПараметрРасчетовТарифнаяСтавка.ПроизвольныйЗапрос = Ложь;
		ПараметрРасчетовТарифнаяСтавка.ЗадаватьЗначениеПриРасчетеЗП = Истина;
		ПараметрРасчетовТарифнаяСтавка.Записать();
		
	КонецЕсли;
	
	// Отработано по заданиям
	Если НЕ УправлениеНебольшойФирмойСервер.ПараметрРасчетаСуществует("ОтработаноЧасовПоЗаданиям") Тогда
		
		ПараметрРасчетовСдельнаяВыработка = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовСдельнаяВыработка.Наименование 	= "Отработано часов по заданиям";
		ПараметрРасчетовСдельнаяВыработка.Идентификатор = "ОтработаноЧасовПоЗаданиям";
		ПараметрРасчетовСдельнаяВыработка.ПроизвольныйЗапрос = Истина;
		ПараметрРасчетовСдельнаяВыработка.ЗадаватьЗначениеПриРасчетеЗП = Ложь;
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "НачалоПериода"; 
		НовыйПараметрЗапроса.Представление = "Начало периода"; 
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "КонецПериода";
		НовыйПараметрЗапроса.Представление = "Конец периода";
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "Сотрудник";
		НовыйПараметрЗапроса.Представление = "Сотрудник";
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "Организация"; 
		НовыйПараметрЗапроса.Представление = "Организация"; 
		
		НовыйПараметрЗапроса = ПараметрРасчетовСдельнаяВыработка.ПараметрыЗапроса.Добавить();
		НовыйПараметрЗапроса.Имя = "Подразделение";
		НовыйПараметрЗапроса.Представление = "Подразделение";
		
		ПараметрРасчетовСдельнаяВыработка.Запрос =
		"ВЫБРАТЬ
		|	Источник.ЗагрузкаФактОборот
		|ИЗ
		|	РегистрНакопления.ЗаданияНаРаботу.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК Источник
		|ГДЕ
		|	Источник.Сотрудник = &Сотрудник
		|	И Источник.СтруктурнаяЕдиница = &Подразделение
		|	И Источник.Организация = &Организация";
		
		ПараметрРасчетовСдельнаяВыработка.Записать();
		
	КонецЕсли;
	
	// Виды начислений
	Если НЕ УправлениеНебольшойФирмойСервер.НачальноеЗаполнениеВидовНачисленийУдержанийПроизводилось() Тогда
		
		// Группы
		НовоеНачисление 			 = Справочники.ВидыНачисленийИУдержаний.СоздатьГруппу();
		НовоеНачисление.Наименование = "Начисления";
		НовоеНачисление.Записать(); 
		
		ГруппаНачисление 			 = НовоеНачисление.Ссылка;
		
		НовоеНачисление 			 = Справочники.ВидыНачисленийИУдержаний.СоздатьГруппу();
		НовоеНачисление.Наименование = "Удержания";
		НовоеНачисление.Записать();

		ГруппаУдержание 			 = НовоеНачисление.Ссылка;
		
		// Оклад по дням
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оклад по дням";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДней]";
		НовоеНачисление.Записать();
		
		// Оклад по часам
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оклад по часам";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
		НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасов]";
		НовоеНачисление.Записать();
		
		// Оплата по заданиям
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Оплата по заданиям";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасовПоЗаданиям]";
		НовоеНачисление.Записать();
		
		// Процент от продаж по ответственному
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Процент от продаж по ответственному";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "[СуммуПродажПоОтветственному]  / 100 *  [ТарифнаяСтавка]";
		НовоеНачисление.Записать();
		
		// Оплата по сдельным нарядам
		НовоеНачислениеСсылка				= Справочники.ВидыНачисленийИУдержаний.СдельнаяОплата;
		НовоеНачисление						= НовоеНачислениеСсылка.ПолучитьОбъект();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Сдельная оплата (тариф)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "";
		НовоеНачисление.Записать();
		
		// Сдельная оплата процентом
		НовоеНачислениеСсылка				= Справочники.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент;
		НовоеНачисление						= НовоеНачислениеСсылка.ПолучитьОбъект();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Сдельная оплата (% от суммы)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "";
		НовоеНачисление.Записать();
		
		//Фиксированная сумма
		НовоеНачислениеСсылка				= Справочники.ВидыНачисленийИУдержаний.ФиксированнаяСумма;
		НовоеНачисление						= НовоеНачислениеСсылка.ПолучитьОбъект();
		НовоеНачисление.Код					= "";
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Сдельная оплата (фиксированная сумма)";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		НовоеНачисление.Формула 			= "[ФиксированнаяСумма]";
		НовоеНачисление.УстановитьНовыйКод();
		НовоеНачисление.Записать();
		
		// Отпускные
		НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
		НовоеНачисление.Родитель 			= ГруппаНачисление;
		НовоеНачисление.Наименование 		= "Отпускные";
		НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
		НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
		НовоеНачисление.Формула				= "";
		НовоеНачисление.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.БезработицаФОТ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ЕСВ_ФОТ_инв;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ЕСВ_ФОТ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ПенсионныйФОТИнв;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ПенсионныйФОТ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.СоцстрахНесчФОТ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.СоцстрахФОТ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ;
		НовыйНалог.Записать();
		
		ГруппаНовыйНалогСсылка          = Справочники.ВидыНачисленийИУдержаний.ВзносыФОТ;
		ГруппаНовыйНалог			    = ГруппаНовыйНалогСсылка.ПолучитьОбъект();
		ГруппаНовыйНалог.Родитель       = ГруппаУдержание;
		ГруппаНовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.Безработица;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель 			= Справочники.ВидыНачисленийИУдержаний.Взносы;
		НовыйНалог.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула 			= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.Взносы;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ЕСВ_работник;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.Взносы;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.Взносы;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.Пенсионный1_2;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.Взносы;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.Взносы;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.Пенсионный1_5;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.Взносы;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.Взносы;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.Соцстрах;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.Взносы;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.Взносы;
		НовыйНалог.Записать();
		
		ГруппаНовыйНалогСсылка          = Справочники.ВидыНачисленийИУдержаний.Взносы;
		ГруппаНовыйНалог			    = ГруппаНовыйНалогСсылка.ПолучитьОбъект();
		ГруппаНовыйНалог.Родитель       = ГруппаУдержание;
		ГруппаНовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.МинОплатаТруда;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ОплатаТруда;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ОплатаТруда;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.НДФЛ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ОплатаТруда;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ОплатаТруда;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ПрожиточныйМинимум;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= Справочники.ВидыНачисленийИУдержаний.ОплатаТруда;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ОплатаТруда;
		НовыйНалог.Записать();
		
		ГруппаНовыйНалогСсылка          = Справочники.ВидыНачисленийИУдержаний.ОплатаТруда;
		ГруппаНовыйНалог			    = ГруппаНовыйНалогСсылка.ПолучитьОбъект();
		ГруппаНовыйНалог.Родитель       = ГруппаУдержание;
		ГруппаНовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ВоенныйСбор;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= ГруппаУдержание;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ВоенныйСбор;
		НовыйНалог.Записать();
		
		// 
		НовыйНалогСсылка				= Справочники.ВидыНачисленийИУдержаний.ЕСВ;
		НовыйНалог						= НовыйНалогСсылка.ПолучитьОбъект();
		НовыйНалог.Родитель				= ГруппаУдержание;
		НовыйНалог.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
		НовыйНалог.Формула				= "";
		НовыйНалог.ВидНалога = Справочники.ВидыНалогов.ЕСВ;
		НовыйНалог.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПараметрыРасчетовИВидыНачислений()

//(24) Процедура заполняет в настройки подбора при первом запуске
//
Процедура ЗаполнитьПользовательскиеНастройкиПодбора()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	УправлениеНебольшойФирмойСервер.УстановитьСтандартныеНастройкиПодбора(ТекущийПользователь);
	
КонецПроцедуры // ЗаполнитьПользовательскиеНастройкиПодбора()

//(27) Процедура удаляет регистрацию изменений базовых классификаторов, которые должны выгружаться
// только при наличии на них ссылок в других выгружаемых объектах.
//
Процедура УдалитьРегистрациюИзмененийБазовыхКлассификаторов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия.Ссылка КАК УзелОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия КАК ОбменУправлениеНебольшойФирмойБухгалтерия
	|ГДЕ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия.Ссылка <> &ЭтотУзелБУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия20.Ссылка КАК УзелОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия20 КАК ОбменУправлениеНебольшойФирмойБухгалтерия20
	|ГДЕ
	|	ОбменУправлениеНебольшойФирмойБухгалтерия20.Ссылка <> &ЭтотУзелБУ20";
	
	Запрос.УстановитьПараметр("ЭтотУзелБУ", ПланыОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия.ЭтотУзел());
	Запрос.УстановитьПараметр("ЭтотУзелБУ20", ПланыОбмена.ОбменУправлениеНебольшойФирмойБухгалтерия20.ЭтотУзел());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	УзлыОбменаСБУ = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("УзелОбмена");
	УзлыОбменаСБУ20 = МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("УзелОбмена");
	
	Попытка
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ, Метаданные.Справочники.Банки);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ, Метаданные.Справочники.Валюты);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ, Метаданные.Справочники.КлассификаторЕдиницИзмерения);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ, Метаданные.Справочники.СтраныМира);
	Исключение
	КонецПопытки;
	
	Попытка
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ20, Метаданные.Справочники.Банки);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ20, Метаданные.Справочники.Валюты);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ20, Метаданные.Справочники.КлассификаторЕдиницИзмерения);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаСБУ20, Метаданные.Справочники.СтраныМира);
	Исключение
	КонецПопытки;
	
КонецПроцедуры // УдалитьРегистрациюИзмененийБазовыхКлассификаторов()

//(29) Процедура заполняет бланки договоров из макета.
//
Процедура ЗаполнитьБланкиДоговоров()
	
	НачатьТранзакцию();
	Попытка
		МакетДоговорАренды 			= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорАренды");
		МакетДоговорКуплиПродажи 	= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорКуплиПродажи");
		МакетДоговорОказанияУслуг 	= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорОказанияУслуг");
		МакетДоговорПоставки 		= Справочники.БланкиДоговоров.ПолучитьМакет("МакетДоговорПоставки");
		
		Макеты = Новый Массив(4);
		Макеты[0] = МакетДоговорАренды;
		Макеты[1] = МакетДоговорКуплиПродажи;
		Макеты[2] = МакетДоговорОказанияУслуг;
		Макеты[3] = МакетДоговорПоставки;
		
		НаименованияМакетов = Новый Массив(4);
		НаименованияМакетов[0] = "МакетДоговорАренды";
		НаименованияМакетов[1] = "МакетДоговорКуплиПродажи";
		НаименованияМакетов[2] = "МакетДоговорОказанияУслуг";
		НаименованияМакетов[3] = "МакетДоговорПоставки";
		
		Бланки = Новый Массив(4);
		Бланки[0] = Справочники.БланкиДоговоров.ДоговорАренды.Ссылка.ПолучитьОбъект();
		Бланки[1] = Справочники.БланкиДоговоров.ДоговорКуплиПродажи.Ссылка.ПолучитьОбъект();
		Бланки[2] = Справочники.БланкиДоговоров.ДоговорОказанияУслуг.Ссылка.ПолучитьОбъект();
		Бланки[3] = Справочники.БланкиДоговоров.ДоговорПоставки.Ссылка.ПолучитьОбъект();
		
		Итератор = 0;
		Пока Итератор < Макеты.Количество() Цикл 
			
			МакетДоговора = Справочники.БланкиДоговоров.ПолучитьМакет(НаименованияМакетов[Итератор]);
			
			ТекстХТМЛ = МакетДоговора.ПолучитьТекст();
			Вложения = Новый Структура;
			
			КоличествоРедактируемыхПараметров = СтрЧислоВхождений(ТекстХТМЛ, "{ЗаполняемоеПоле");
			
			Бланки[Итератор].РедактируемыеПараметры.Очистить();
			НомерПараметра = 1;
			Пока НомерПараметра <= КоличествоРедактируемыхПараметров Цикл 
				НоваяСтрока = Бланки[Итератор].РедактируемыеПараметры.Добавить();
				НоваяСтрока.Представление = "{ЗаполняемоеПоле" + НомерПараметра + "}";
				НоваяСтрока.Идентификатор = "parameter" + НомерПараметра;
				
				НомерПараметра = НомерПараметра + 1;
			КонецЦикла;
			
			Падежи = Новый Массив;
			Падежи.Добавить(Неопределено);
			Падежи.Добавить("именительный");
			Падежи.Добавить("родительный");
			Падежи.Добавить("дательный");
			Падежи.Добавить("винительный");
			Падежи.Добавить("творительный");
			Падежи.Добавить("предложный");
			
			Для каждого ПараметрПеречисление Из Перечисления.ПараметрыБланковДоговоровСКонтрагентами Цикл
				
				Для каждого Падеж Из Падежи Цикл
					Если Падеж = Неопределено Тогда
						ПредставлениеПадежа = "";
					Иначе
						ПредставлениеПадежа = " (" + Падеж + ")";
					КонецЕсли;
					
					Параметр = "{" + Строка(ПараметрПеречисление) + ПредставлениеПадежа + "}";
					ЧислоВхождений = СтрЧислоВхождений(ТекстХТМЛ, Параметр);
					Для НомерПараметра = 1 По ЧислоВхождений Цикл
						Если НомерПараметра = 1 Тогда
							Представление = "{" + Строка(ПараметрПеречисление) + ПредставлениеПадежа + "%deleteSymbols%" + "}";
							Идентификатор = "infoParameter" + Строка(ПараметрПеречисление) + НомерПараметра;
						Иначе
							Представление = "{" + Строка(ПараметрПеречисление) + НомерПараметра + ПредставлениеПадежа + "}";
							Идентификатор = "infoParameter" + Строка(ПараметрПеречисление) + НомерПараметра;
						КонецЕсли;
						
						ПервоеВхождение = Найти(ТекстХТМЛ, Параметр);
						
						ТекстХТМЛ = Лев(ТекстХТМЛ, ПервоеВхождение - 1) + Представление + Сред(ТекстХТМЛ, ПервоеВхождение + СтрДлина(Параметр));
						
						НоваяСтрока = Бланки[Итератор].ПараметрыИнфобазы.Добавить();
						НоваяСтрока.Представление = СтрЗаменить(Представление, "%deleteSymbols%", "");
						НоваяСтрока.Идентификатор = Идентификатор;
						НоваяСтрока.Параметр = ПараметрПеречисление;
						
					КонецЦикла;
					ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%deleteSymbols%", "");
				КонецЦикла;
			КонецЦикла;
			
			СтруктураФорматированногоДокумента = Новый Структура;
			СтруктураФорматированногоДокумента.Вставить("ТекстHTML", ТекстХТМЛ);
			СтруктураФорматированногоДокумента.Вставить("Вложения", Вложения);
			
			Бланки[Итератор].Бланк = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента);
			Бланки[Итератор].МакетПредопределенногоБланка = НаименованияМакетов[Итератор];
			Бланки[Итератор].КоличествоРедактируемыхПараметров = КоличествоРедактируемыхПараметров;
			Бланки[Итератор].Записать();
			
			Итератор = Итератор + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ru='Заполнение бланков договоров.'", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьЗначенияКБК(СтруктураПараметров = Неопределено) Экспорт
	
	
	Набор = РегистрыСведений.ЗначенияКБК.СоздатьНаборЗаписей();
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202110061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202100061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТФОМС;
	Запись.Значение = "39210202110091000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТФОМС;
	Запись.Значение = "39210202101081012160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20000101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202100081000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202101081011160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20110101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ЕНВД;
	Запись.Значение = "18210502010021000110";
	
	// 2012 год
	
	// начисление зп
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники;
	Запись.Значение = "39210202020061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Запись.Значение = "39210202010061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФСССотрудники;
	Запись.Значение = "39310202090071000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФССТравматизмСотрудники;
	Запись.Значение = "39310202050071000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.НДФЛСотрудники;
	Запись.Значение = "18210102010011000110";
	
	Запись = Набор.Добавить();
	Запись.Период = '20120101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФОМССотрудники;
	Запись.Значение = "39210202101081011160";
	
	// 2013 год
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРНакопительная;
	Запись.Значение = "39210202150061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202140061000160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20130101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300тр;
	Запись.Значение = "39210202140061000160";
	
	// 2016 год
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСтраховая;
	Запись.Значение = "39210202140061100160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ПФРСвыше300тр;
	Запись.Значение = "39210202140061200160";
	
	Запись = Набор.Добавить();
	Запись.Период = '20160101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ФФОМС;
	Запись.Значение = "39210202103081011160";
	
	// 2015 год
	
	Запись = Набор.Добавить();
	Запись.Период = '20150101';
	Запись.ВидВзаиморасчета = Справочники.ВидыНалогов.ТорговыйСбор;
	Запись.Значение = "18210505010020000110";

	
	Набор.Записать();
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// заполняет справочник КодыДоходовНДФЛ
//
Процедура ЗаполнитьКодыНДФЛ() Экспорт
	
	Код2000 = Справочники.КодыДоходовНДФЛ.Код2000.ПолучитьОбъект();
	Код2000.СтавкаНДФЛ = 13;
	Код2000.Записать();
	
	Код2010 = Справочники.КодыДоходовНДФЛ.Код2010.ПолучитьОбъект();
	Код2010.СтавкаНДФЛ = 13;
	Код2010.Записать();
	
	Код2012 = Справочники.КодыДоходовНДФЛ.Код2012.ПолучитьОбъект();
	Код2012.СтавкаНДФЛ = 13;
	Код2012.Записать();
	
КонецПроцедуры

// Процедура заполняет справочник ДокументыФизическихЛиц по классификатору МВД.
// Для тех конфигураций, в которых в справочнике "Виды документов физических лиц" нет реквизитов.
//
Процедура ЗаполнитьДокументыФизическихЛицПоКлассификаторуМВД(СтруктураПараметров = Неопределено) Экспорт
	
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.Паспорт,			"", 	"01", "ПАСПОРТ");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.Загранпаспорт,		"", 	"02", "ЗГПАСПОРТ");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении,	"", 	"03", "СВИД О РОЖД");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера,	"", 	"04", "УДОСТ ОФИЦЕРА");
	ОписатьДокумент(,"Справка об освобождении из места лишения свободы",					"05", "СПРАВКА ОБ ОСВ");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка, 	"",		"06", "ПАСПОРТ МОРФЛТ");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет, "Военный билет солдата (матроса, сержанта, старшины)", "07", "ВОЕННЫЙ БИЛЕТ");
	ОписатьДокумент(, "Временное удостоверение, выданное взамен военного билета",			"08", "ПРОЧЕЕ");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт, "",		"09", "ДИППАСПОРТ");
	ОписатьДокумент(, "Паспорт иностранного гражданина",									"10", "ИНПАСПОРТ");
	ОписатьДокумент(, "Вид на жительство в Украине",							"11", "ВИД НА ЖИТЕЛЬ");
	ОписатьДокумент(, "Свидетельство о рождении, выданное уполномоченным органом иностранного государства", "12", "ПРОЧЕЕ");
	ОписатьДокумент(Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка,			"",		"13", "ПАСПОРТ МОРЯКА");
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьДокумент(СсылкаНаЭлемент = Неопределено, Наименование = "", КодМВД = "", КодПФР = "")

	Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Если Наименование = "" Тогда
			Возврат
		КонецЕсли;
		СсылкаНаЭлемент = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(Наименование);
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "КодМВД, КодПФР");
		Если ДанныеИБ.КодМВД = КодМВД И ДанныеИБ.КодПФР = КодПФР Тогда
			Возврат
		КонецЕсли;
		Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВидыДокументовФизическихЛиц.СоздатьЭлемент();
	КонецЕсли;

	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	Элемент.КодМВД = КодМВД;
	Элемент.КодПФР = КодПФР;
	
	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.Записать();

КонецПроцедуры

//(43) Создание шаблонов условий печати в счетах на оплату
Процедура ЗаполнитьДополнительныеУсловияДляПечати() Экспорт
	
	Справочники.ДополнительныеУсловия.ЗаполнениеТиповыхДополнительныхУсловий();
	
КонецПроцедуры

//(45) Идентификаторы формул и типы видов цен
Процедура ОбновитьПредопределенныеВидыЦен() Экспорт
	
	// Наличие видов цен контрагентов в новой ИБ не предполагается, но такую возможность поддержим...
	
	Запрос = Новый Запрос(
	"Выбрать Справочник.ВидыЦен.Ссылка КАК ВидЦен, Истина КАК ЭтоЦеныНоменклатуры 
	|	Где Справочник.ВидыЦен.ИдентификаторФормул = """" ИЛИ Справочник.ВидыЦен.ТипВидаЦен = Значение(Перечисление.ТипыВидовЦен.ПустаяСсылка)
	|
	|Объединить Все
	|
	|Выбрать Справочник.ВидыЦенКонтрагентов.Ссылка, Ложь Где Справочник.ВидыЦенКонтрагентов.ИдентификаторФормул = """"");
	
	РезультатЗапроса = Запрос.Выполнить();
	Попытка
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ВидЦенОбъект = Выборка.ВидЦен.ПолучитьОбъект();
			
			ОписаниеВладельца = "";
			Если Выборка.ЭтоЦеныНоменклатуры Тогда
				
				ВидЦенОбъект.ТипВидаЦен = Перечисления.ТипыВидовЦен.Статический;
				
			Иначе
				
				ОписаниеВладельца = Строка(Выборка.ВидЦен.Владелец);
				
			конецЕсли;
			
			ЦенообразованиеФормулыСервер.СформироватьНовыйИдентификаторВидаЦен(ВидЦенОбъект.ИдентификаторФормул, Выборка.ВидЦен.Наименование, ОписаниеВладельца);
			
			ВидЦенОбъект.Записать();
			
		КонецЦикла;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Идентификаторы.ВидыЦен", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

//(49) Заполняет справочник ключевых операций, устанавливает целевое время
Процедура ЗаполнитьРеквизитыКлючевыхОпераций() Экспорт
	
	Попытка
		Справочники.КлючевыеОперации.ЗаполнитьРеквизитыКлючевыхОпераций();	
	Исключение
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ru='Заполнение ключевых операций.'", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПервогоЗапуска

// Процедура заполняет пустую ИБ общими данными
//
// К данным относятся неразделенные сведения, например, глобальные настройки сервиса
//
Процедура ПервыйЗапуск_ОбщиеДанные() Экспорт
	
	НачатьТранзакцию();
	
	// 1. Заполним константу ИзвлекатьТекстыФайловНаСервере
	Константы.ИзвлекатьТекстыФайловНаСервере.Установить(Истина);
	//Константы.ИспользоватьПроверкуКонтрагентов.Установить(Истина);
	
    // 2. Заполняем регистр сведений МРОТ
	ОбновлениеИнформационнойБазыУНФ.ЗагрузитьМРОТ();
	
	// 3. Заполняем регистр сведений ПрожиточныйМинимум
	ОбновлениеИнформационнойБазыУНФ.ЗагрузитьПрожиточныйМинимум();
	
	// 4. Заполняем регистр сведений НДФЛСтавкиНалогов
	ОбновлениеИнформационнойБазыУНФ.ЗагрузитьНДФЛСтавкиНалогов();
	
	// 5. Обновим виды статей налоговых деклараций.
	ОбновлениеИнформационнойБазыУНФ.ОбновитьВидыСтатейНалоговыхДеклараций();
	
	// 2. Заполним календарь отчетности
	//Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
	// 3. Загружаем  тарифы страховых взносов с предельными величинами
	//Справочники.ВидыТарифовСтраховыхВзносов.ЗаполнитьСправочникВидыТарифовСтраховыхВзносов();
	//Справочники.ВидыТарифовСтраховыхВзносов.ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012();
	//РегистрыСведений.ТарифыСтраховыхВзносов.УстановитьЗначенияТарифовСтраховыхВзносов2011_2012();
	//РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.УстановитьПредельнуюВеличинуБазыСтраховыхВзносов();
	
	// 4. Заполняем виды предпринимательской деятельности
	//Справочники.ВидыПредпринимательскойДеятельности.ЗаполнитьВидыПредпринимательскойДеятельности();
	
	// 5. Заполняем справочник ОКУН
	//ЗагрузитьОКУН();
	
	// 6. Заполняем регистр сведений КоэффициентДефлятор
	//ЗаполнитьКоэффициентДефлятор();
	
	// 7. Заполняем регистр сведений МРОТ
	//ЗагрузитьМРОТ();
	
	// 8. Заполняем справочник Вычеты НДФЛ
	//Справочники.ВычетыНДФЛ.НачальноеЗаполнение();
	
	// 9. Заполним регистр сведений НДФЛРазмерВычетов.
	//Сотрудники.ЗаполнитьРазмерыВычетовНДФЛ();
	
	// 6. Изменить расписание регламетного задания в сервисе (оптимизация нагрузки)
	ЦенообразованиеСервер.ИзменитьРасписаниеОчередиЦен();
	
	// 7. Заполнение классификатора категорий номенклатуры
	КатегорииНоменклатурыСервер.ОбновитьКлассификаторКатегорий();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура заполняет пустую ИБ данными пользователей
//
Процедура ПервыйЗапуск_РазделенныеДанные() Экспорт
	
	НачатьТранзакцию();
	
	// 1. Загрузим план счетов.
	ЗагрузитьУправленческийПланСчетовПервыйЗапуск();
	ЗаполнитьПланСчетов();	
	
	// 2. Заполним вид и направление деятельности.
	ПрочееНаправлениеДеятельностиСсылка = Справочники.НаправленияДеятельности.Прочее;
	ПрочееНаправлениеДеятельности = ПрочееНаправлениеДеятельностиСсылка.ПолучитьОбъект();
	ПрочееНаправлениеДеятельности.СчетУчетаВыручкиОтПродаж = ПланыСчетов.Управленческий.ПрочиеДоходы;
	ПрочееНаправлениеДеятельности.СчетУчетаСебестоимостиПродаж = ПланыСчетов.Управленческий.ПрочиеРасходы;
	ПрочееНаправлениеДеятельности.СчетУчетаПрибыли = ПланыСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль;
	ПрочееНаправлениеДеятельности.Записать();
	
	ОсновноеНаправлениеДеятельностиСсылка = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	ОсновноеНаправлениеДеятельности = ОсновноеНаправлениеДеятельностиСсылка.ПолучитьОбъект();
	ОсновноеНаправлениеДеятельности.СчетУчетаВыручкиОтПродаж = ПланыСчетов.Управленческий.ВыручкаОтПродаж;
	ОсновноеНаправлениеДеятельности.СчетУчетаСебестоимостиПродаж = ПланыСчетов.Управленческий.СебестоимостьПродаж;
	ОсновноеНаправлениеДеятельности.СчетУчетаПрибыли = ПланыСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль;
	ОсновноеНаправлениеДеятельности.Записать();
	
	// 3. Заполним виды налогов.
	ЗаполнитьВидыНалоговПервыйЗапуск();
	
	// 4. Заполним валюты.
	ВалютаОбъект = Справочники.Валюты.ОбъектПоКоду("980");
	ВалютаОбъект.Наименование = НСтр("ru='грн.';uk='грн.'");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВалютаОбъект);
	РаботаСКурсамиВалют.ПроверитьКорректностьКурсаНа01_01_1980(ВалютаОбъект.Ссылка);
	
	// 5. Заполним ставки НДС.
	СтавкаНДС20 = ЗаполнитьСтавкиНДСПервыйЗапуск();
	
	// 6. Заполним кассы.
	КассаГрн = Справочники.Кассы.СоздатьЭлемент();
	КассаГрн.Наименование = Нстр("ru='Основная касса';uk='Основна каса'");
	КассаГрн.ВалютаПоУмолчанию = ВалютаОбъект.Ссылка;
	КассаГрн.СчетУчета = ПланыСчетов.Управленческий.Касса;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КассаГрн);
	
	// 7. Заполним Календарь на основании ПроизводственногоКалендаря.
	Календарь = УправлениеНебольшойФирмойСервер.ПолучитьКалендарьПоПроизводственномуКалендарюУкраины(); 
	Если Календарь = Неопределено Тогда
		
		СоздатьКалендарьПятидневкаУкраины();
		Календарь = УправлениеНебольшойФирмойСервер.ПолучитьКалендарьПоПроизводственномуКалендарюУкраины(); 
		
	КонецЕсли;
	
	// 8. Заполним организации.
	Константы.НеИспользоватьНесколькоОрганизаций.Установить(Истина);
	
	НашаОрганизацияСсылка = Справочники.Организации.ОсновнаяОрганизация;
	НашаОрганизация = НашаОрганизацияСсылка.ПолучитьОбъект();
	НашаОрганизация.НаименованиеПолное	  = Нстр("ru='ООО ""Наша фирма""';uk='ТОВ ""Наша фірма""'");
	НашаОрганизация.Префикс				  = НСтр("ru='НФ-';uk='НФ-'");
	НашаОрганизация.ЮридическоеФизическоеЛицо			  = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	НашаОрганизация.НДСВключатьВСтоимость = Истина;
	НашаОрганизация.КассаПоУмолчанию	  = КассаГрн.Ссылка;
	НашаОрганизация.СтавкаНДСПоУмолчанию  = СтавкаНДС20;
	НашаОрганизация.ПроизводственныйКалендарь = Календарь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НашаОрганизация);
	
	// 9. Заполним подразделения.
	ОсновноеПодразделениеСсылка = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	ОсновноеПодразделение = ОсновноеПодразделениеСсылка.ПолучитьОбъект();
	ОсновноеПодразделение.Организация = НашаОрганизация.Ссылка;
	ОсновноеПодразделение.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение;
	ОсновноеПодразделение.Записать();
	
	// 10. Заполним основной склад.
	ОсновнойСкладСсылка = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	ОсновнойСклад = ОсновнойСкладСсылка.ПолучитьОбъект();
	ОсновнойСклад.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад;
	ОсновнойСклад.Организация = НашаОрганизация.Ссылка;
	ОсновнойСклад.Записать();
	
	// 11. Заполним виды цен.
	// Оптовая.
	ОптоваяСсылка = Справочники.ВидыЦен.Оптовая;
	Оптовая = ОптоваяСсылка.ПолучитьОбъект();
	Оптовая.ИдентификаторФормул = Нстр("ru='Оптовая';uk='Оптова'");
	Оптовая.ВалютаЦены = ВалютаОбъект.Ссылка;
	Оптовая.ЦенаВключаетНДС = Истина;
	Оптовая.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
	Оптовая.ОкруглятьВБольшуюСторону = Ложь;
	Оптовая.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
	Оптовая.Записать();
	
	// Учетная.
	УчетнаяСсылка = Справочники.ВидыЦен.Учетная;
	Учетная = УчетнаяСсылка.ПолучитьОбъект();
	Учетная.ИдентификаторФормул = Нстр("ru='Учетная';uk='Облікова'");
	Учетная.ВалютаЦены = ВалютаОбъект.Ссылка;
	Учетная.ЦенаВключаетНДС = Истина;
	Учетная.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
	Учетная.ОкруглятьВБольшуюСторону = Ложь;
	Учетная.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
	Учетная.Записать();
	
	// 12. Заполним константы.
	Константы.ВалютаУчета.Установить(ВалютаОбъект.Ссылка);
	Константы.НациональнаяВалюта.Установить(ВалютаОбъект.Ссылка);
	Константы.КонтролироватьОстаткиПриПроведении.Установить(Истина);
	Константы.ИспользоватьНапоминанияПользователя.Установить(Истина);
	
	Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Установить(Ложь);
	Константы.ЧастотаРасчетаКурсовыхРазниц.Установить(Перечисления.ЧастотаРасчетаКурсовыхРазниц.ТолькоПриЗакрытииПериода);
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Установить(ОбменДаннымиПереопределяемый.ПрефиксИнформационнойБазыПоУмолчанию());
	КонецЕсли;
	
	// 13. Заполним сценарий планирования.
	Справочники.СценарииПланирования.ЗаполнитьФактическийСценарий();
	Справочники.СценарииПланирования.ЗаполнитьПоставляемыеСценарии();
	
	// 14. Заполним классификатор использования рабочего времени.
	ЗаполнитьКлассификаторИспользованияРабочегоВремени();
	
	// 15. Заполним параметры расчета и виды начислений.
	ЗаполнитьПараметрыРасчетовИВидыНачислений();
	
	// 16. Заполним наборы свойств.
	ОсновнаяКатегорияСсылка = Справочники.КатегорииНоменклатуры.БезКатегории;
	ОсновнаяКатегория = ОсновнаяКатегорияСсылка.ПолучитьОбъект();
	ОсновнаяКатегория.Записать();
	
	// 17. Заполним реквизиты предопределенных единиц измерения.
	
	// Штука.
	ШтСсылка = Справочники.КлассификаторЕдиницИзмерения.шт;
	ШтОбъект = ШтСсылка.ПолучитьОбъект();
	ШтОбъект.НаименованиеПолное = Нстр("ru='Штука';uk='Штука'");
	ШтОбъект.МеждународноеСокращение = "PCE";
	ШтОбъект.Записать();
	
	// Час.
	чСсылка = Справочники.КлассификаторЕдиницИзмерения.ч;
	чОбъект = чСсылка.ПолучитьОбъект();
	чОбъект.НаименованиеПолное = Нстр("ru='Час';uk='Година'");
	чОбъект.МеждународноеСокращение = "HUR";
	чОбъект.Записать();
	
	// 18. Заполним состояния заказов
	Справочники.СостоянияЗаказовПокупателей.ЗаполнитьПоставляемыеСостояния();
	Справочники.ВидыЗаказовПокупателей.ЗаполнитьОсновнойВидЗаказа();
	Справочники.СостоянияЗаказНарядов.ЗаполнитьПоставляемыеСостояния();
	Справочники.ВидыЗаказНарядов.ЗаполнитьОсновнойВидЗаказа();
	Справочники.СостоянияЗаказовПоставщикам.ЗаполнитьПоставляемыеСостояния();
	Справочники.СостоянияЗаказовНаПроизводство.ЗаполнитьПоставляемыеСостояния();
	
	// 19. Установим дату изменения движений по ордерному складу.
	Константы.ДатаОбновленияНаРелиз_1_2_1.Установить("19800101");
	
	// 20. Установим признак контроля остатков при пробитии чеков ККМ.
	Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Установить(Истина);
	
	// 21. Настройки подбора
	ЗаполнитьПользовательскиеНастройкиПодбора();
	
	// 22. Константа ПлановаяДатаОптимизацииИтогов
	Константы.ПлановаяДатаОптимизацииИтогов.Установить(КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), 1)));
	
	// 23. Установим дату вступления в силу приказа 1379
	Константы.ДатаВступленияВСилуПриказа1379.Установить('20111216');
	
	// 24. Заполним  предопределенные элементы справочника Виды договоров по ГК.
	ЗаполнитьСправочникВидыДоговоровПоГК("НачальноеЗаполнение");	
	
	// 25. Заполним непредопределенные элементы справочника Виды договоров по ГК.
	ЗаполнитьСправочникВидыДоговоровПоГК("НачальноеЗаполнениеНепредопределенных");	
	
	// 26. Заполним в договорах реквизит Вид договора по ГК.
	ЗаполнитьВидДоговораПоГК();
	
	// 29. Заполнение списка регламентированных отчетов.
	//ЗаполнитьСписокРегламентированныхОтчетовПервыйЗапуск();
	
	
	// 27. Контактная информация
	КонтактнаяИнформацияУНФ.УстановитьСвойстваПредопределенныхВидовКонтактнойИнформации();
	
	// 28. Константы прайс-листа.
	Константы.ПрайсЛистВыводитьКод.Установить(Перечисления.ДаНет.Да);
	Константы.ПрайсЛистВыводитьПолноеНаименование.Установить(Перечисления.ДаНет.Нет);
	Константы.ПрайсЛистИспользоватьИерархиюНоменклатуры.Установить(Истина);
	Константы.ПрайсЛистФормироватьПоНаличиюНаСкладах.Установить(Ложь);
	
	// 29. Регистрация
	УдалитьРегистрациюИзмененийБазовыхКлассификаторов();
	
	// 30. Заполнение бланков договоров.
	ЗаполнитьБланкиДоговоров();
	
	// 31. Константа.ЗачитыватьАвансыДолгиАвтоматически
	Константы.ЗачитыватьАвансыДолгиАвтоматически.Установить(Перечисления.ДаНет.Нет);
	
	// 32. БПО
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновлениеБиблиотеки();
	
	// 33. Заполним состояния событий.
	СостояниеЗапланированоОбъект = Справочники.СостоянияСобытий.Запланировано.ПолучитьОбъект();
	СостояниеЗапланированоОбъект.РеквизитДопУпорядочивания = 1;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеЗапланированоОбъект);
	
	СостояниеЗавершеноОбъект = Справочники.СостоянияСобытий.Завершено.ПолучитьОбъект();
	СостояниеЗавершеноОбъект.РеквизитДопУпорядочивания = 2;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеЗавершеноОбъект);
	
	СостояниеОтмененоОбъект = Справочники.СостоянияСобытий.Отменено.ПолучитьОбъект();
	СостояниеОтмененоОбъект.РеквизитДопУпорядочивания = 3;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеОтмененоОбъект);
	
	// 34. Заполнение предопределенных элементов статьи расходов.
	ОплатаОтПокупателей = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей.ПолучитьОбъект();
	ОплатаОтПокупателей.УчитыватьВНУ = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОплатаОтПокупателей);
	
	ОплатаПоставщикам = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам.ПолучитьОбъект();
	ОплатаПоставщикам.УчитыватьВНУ = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОплатаПоставщикам);
	
	// 35. Заполняем регистр сведений ЗначенияКБК
	//ЗагрузитьЗначенияКБК();
	
	// 35. Заполним сегменты контрагентов.
	Справочники.Сегменты.ЗаполнитьПоставляемыеСегменты();
	
	// 36. Заполним источники привлечения покупателей.
	Справочники.ИсточникиПривлеченияПокупателей.ЗаполнитьПоставляемыеИсточникиПривлеченияПокупателей();
	
	// 38. Заполним справочник ВидыДоходовПоСтраховымВзносам.
	//Справочники.ВидыДоходовПоСтраховымВзносам.ЗаполнитьВидыДоходовПоСтраховымВзносам();
	
	// 39. Заполним справочник ВидыДоходовПоСтраховымВзносам.
	//ЗаполнитьКодыНДФЛ();
	
	// 37. Заполним справочник ВидыДоходовПоСтраховымВзносам.
	ЗаполнитьДокументыФизическихЛицПоКлассификаторуМВД();
	
	// 38. Всегда ИспользоватьДополнительныеРеквизитыИСведения = Истина
	Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Истина);
	
	// 39. Настройка отбора номенклатуры.
	УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры, "ОсновнойВидОтбора");
	
	// 40. Создание шаблонов условий печати в счетах на оплату
	ЗаполнитьДополнительныеУсловияДляПечати();
	
	// 41. Создание шаблонов наименований для предопределенной категории.
	ШаблоныНаименований.СоздатьШаблоныПоУмолчанию(Справочники.КатегорииНоменклатуры.БезКатегории);
	
	// 42. Идентификаторы
	ОбновитьПредопределенныеВидыЦен();
	
	// 43. Обновление документов заработной платы
	ОтчетыУНФ.Обновить();
	ОтчетыУНФ.ОбновитьТегиОтчетов();
	
	//// 44. Установка константы функциональной опции участия в опросе
	//УстановитьКонстантуУчастияВОпросеПоНалогам();
	
	// 45. Заполним справочник ПравилаРабочегоПроцесса.
	Справочники.ПравилаРабочегоПроцесса.ЗаполнитьПоставляемыеПравила();
	
	// 46. Заполняет справочник ключевых операций, устанавливает целевое время
	ЗаполнитьРеквизитыКлючевыхОпераций();
	
	// МобильноеПриложение
	// 47. Установка ФО это обычное приложение.
	УстановитьКонстантуЭтоОбычноеПриложение();
	// Конец МобильноеПриложение
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ПервыйЗапуск()

Процедура ДобавитьВКалендарьЗадачуПоРосстатуИ6НДФЛ() Экспорт
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
КонецПроцедуры

Процедура ЗаполнитьСтавкуЕНВД(СтруктураПараметров = Неопределено) Экспорт
	
	Выборка = Справочники.ВидыДеятельностиЕНВД.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Объект.СтавкаЕНВД = 15;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Ложь, Ложь);
	КонецЦикла;
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_1_6_5

Процедура ЗаполнитьРеквизитыСценариевПланирования() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СценарииПланирования.Ссылка КАК Сценарий
		|ИЗ
		|	Справочник.СценарииПланирования КАК СценарииПланирования
		|ГДЕ
		|	СценарииПланирования.ИзмерениеПланирования = &ПустоеИзмерение
		|	И СценарииПланирования.Предопределенный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПустоеИзмерение", Перечисления.ИзмеренияПланирования.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СценарийОбъект = Выборка.Сценарий.ПолучитьОбъект();
		
		СценарийОбъект.ИзмерениеПланирования	= Перечисления.ИзмеренияПланирования.Номенклатура;
		СценарийОбъект.ДетализироватьДоЗаказа	= Истина;
		СценарийОбъект.ПланироватьКоличество	= Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СценарийОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИспользованиеФактическогоСценария() Экспорт
	
	// В предыдущих версиях было возможно выбрать предопределенный "Фактический" период в документах планирования
	// Обработчик обновления исправляет эти документы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бюджет.Ссылка КАК ДокументСсылка,
		|	1 КАК ТипДокумента
		|ИЗ
		|	Документ.Бюджет КАК Бюджет
		|ГДЕ
		|	Бюджет.СценарийПланирования = &Фактический
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПланПродаж.Ссылка,
		|	2
		|ИЗ
		|	Документ.ПланПродаж КАК ПланПродаж
		|ГДЕ
		|	ПланПродаж.СценарийПланирования = &Фактический";
	
	Запрос.УстановитьПараметр("Фактический", Справочники.СценарииПланирования.Фактический);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Сценарий = Справочники.СценарииПланирования.СоздатьЭлемент();
		Сценарий.УстановитьНовыйКод();
		Сценарий.Наименование			= НСтр("ru='Основной';uk='Основний'");
		Сценарий.ИзмерениеПланирования	= Перечисления.ИзмеренияПланирования.Номенклатура;
		Сценарий.Периодичность			= Перечисления.Периодичность.Месяц;
		Сценарий.ДетализироватьДоЗаказа	= Истина;
		Сценарий.ПланироватьКоличество	= Истина;
		Сценарий.Комментарий			= НСтр("ru='#Создан автоматически для перехода с предыдущей версии программы';uk='#Створено автоматично для переходу з попередньої версії програми'");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Сценарий);
		
		ИменаТЧ = Новый Массив;
		ИменаТЧ.Добавить("ПрямыеЗатраты");
		ИменаТЧ.Добавить("КосвенныеЗатраты");
		ИменаТЧ.Добавить("Поступления");
		ИменаТЧ.Добавить("Выбытия");
		ИменаТЧ.Добавить("Доходы");
		ИменаТЧ.Добавить("Расходы");
		ИменаТЧ.Добавить("Операции");
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОбъект = Выборка.ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.СценарийПланирования = Сценарий.Ссылка;
			
			МинДатаПланирования = '00010101';
			МаксДатаПланирования = '00010101';
			
			Если Выборка.ТипДокумента = 1 Тогда
				
				Для Каждого ИмяТЧ Из ИменаТЧ Цикл
					Для Каждого СтрТЧ Из ДокументОбъект[ИмяТЧ] Цикл
						Если Не ЗначениеЗаполнено(МинДатаПланирования) Или СтрТЧ.ДатаПланирования < МинДатаПланирования Тогда
							МинДатаПланирования = СтрТЧ.ДатаПланирования;
						КонецЕсли;
						Если Не ЗначениеЗаполнено(МаксДатаПланирования) Или СтрТЧ.ДатаПланирования > МаксДатаПланирования Тогда
							МаксДатаПланирования = СтрТЧ.ДатаПланирования;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				ДокументОбъект.ДатаНачала		= НачалоМесяца(МинДатаПланирования);
				ДокументОбъект.ДатаОкончания	= КонецМесяца(МаксДатаПланирования);
				
			ИначеЕсли Выборка.ТипДокумента = 2 Тогда
				
				Для Каждого СтрТЧ Из ДокументОбъект.Запасы Цикл
					Если Не ЗначениеЗаполнено(МинДатаПланирования) Или СтрТЧ.ДатаПланирования < МинДатаПланирования Тогда
						МинДатаПланирования = СтрТЧ.ДатаПланирования;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(МаксДатаПланирования) Или СтрТЧ.ДатаПланирования > МаксДатаПланирования Тогда
						МаксДатаПланирования = СтрТЧ.ДатаПланирования;
					КонецЕсли;
				КонецЦикла;
				
				ДокументОбъект.НачалоПланирования		= НачалоМесяца(МинДатаПланирования);
				ДокументОбъект.ОкончаниеПланирования	= КонецМесяца(Мин(МаксДатаПланирования, ДобавитьМесяц(МинДатаПланирования, 59)));
				// Ограничение по количеству периодов-колонок в документе План продаж - не более 60
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиПериодПланированияВДокументыБюджета(Параметры) Экспорт
	
	РазмерПорцииДанных = 500;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 500
		|	Бюджет.Ссылка КАК ДокументСсылка,
		|	Бюджет.СценарийПланирования.УдалитьДатаНачала КАК ДатаНачала,
		|	Бюджет.СценарийПланирования.УдалитьДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.Бюджет КАК Бюджет
		|ГДЕ
		|	Бюджет.ДатаНачала = &ПустаяДата
		|	И Бюджет.ДатаОкончания = &ПустаяДата
		|	И Бюджет.СценарийПланирования.УдалитьДатаНачала <> &ПустаяДата
		|	И Бюджет.СценарийПланирования.УдалитьДатаОкончания <> &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Бюджет.Дата УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500", РазмерПорцииДанных);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.Бюджет");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ДокументСсылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.ДокументСсылка.ПолучитьОбъект();
			
			// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
			Если ДокументОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДокументОбъект.ДатаНачала) Или ЗначениеЗаполнено(ДокументОбъект.ДатаОкончания) Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			// Обработка объекта.
			ДокументОбъект.ДатаНачала		= Выборка.ДатаНачала;
			ДокументОбъект.ДатаОкончания	= Выборка.ДатаОкончания;
			
			// Запись обработанного объекта.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			
			ЗафиксироватьТранзакцию();
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			// Если не удалось обработать документ, пропускаем и обрабатываем позднее.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОтменитьТранзакцию();
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось установить период планирования в документе Бюджета: %1 по причине:"
"%2';uk='Не вдалося встановити період планування в документі Бюджету: %1 з причини:"
"%2'"), 
					Выборка.ДокументСсылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.Бюджет, Выборка.ДокументСсылка, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано + ПроблемныхОбъектов = 0 Или Выборка.Количество() < РазмерПорцииДанных Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		
	Иначе
		
		Параметры.ОбработкаЗавершена = Ложь;
		
		Если ОбъектовОбработано = 0 Тогда
			ПараметрыПредметаИсчисления = НСтр("ru='документе, документах, документах';uk='документі, документах, документах'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедуре ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыБюджета"
"не удалось заполнить период планирования в %1 Бюджета';uk='Процедурі ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыБюджета"
"не вдалося заповнити період планування в %1 Бюджету'"),
				СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ПроблемныхОбъектов, ПараметрыПредметаИсчисления)
			);
			ВызватьИсключение ТекстСообщения;
		Иначе
			ПараметрыПредметаИсчисления = НСтр("ru='документ, документа, документов';uk='документ, документа, документів'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедура ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыБюджета"
"обработала очередную порцию: %1';uk='Процедура ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыБюджета"
"обробила чергову порцію: %1'"),
				СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ОбъектовОбработано, ПараметрыПредметаИсчисления)
			);
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
				Метаданные.Документы.Бюджет, , ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиПериодПланированияВДокументыПланПродаж(Параметры) Экспорт
	
	РазмерПорцииДанных = 500;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 500
		|	ПланПродаж.Ссылка КАК ДокументСсылка,
		|	ПланПродаж.СценарийПланирования.УдалитьДатаНачала КАК ДатаНачала,
		|	ПланПродаж.СценарийПланирования.УдалитьДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ПланПродаж КАК ПланПродаж
		|ГДЕ
		|	ПланПродаж.СценарийПланирования.УдалитьДатаНачала <> &ПустаяДата
		|	И ПланПродаж.СценарийПланирования.УдалитьДатаОкончания <> &ПустаяДата
		|	И ПланПродаж.НачалоПланирования = &ПустаяДата
		|	И ПланПродаж.ОкончаниеПланирования = &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПланПродаж.Дата УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "500", РазмерПорцииДанных);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ПланПродаж");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ДокументСсылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.ДокументСсылка.ПолучитьОбъект();
			
			// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
			Если ДокументОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДокументОбъект.НачалоПланирования) Или ЗначениеЗаполнено(ДокументОбъект.ОкончаниеПланирования) Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			// Обработка объекта.
			ДокументОбъект.НачалоПланирования		= Выборка.ДатаНачала;
			ДокументОбъект.ОкончаниеПланирования	= Выборка.ДатаОкончания;
			
			// Запись обработанного объекта.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			
			ЗафиксироватьТранзакцию();
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			// Если не удалось обработать документ, пропускаем и обрабатываем позднее.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОтменитьТранзакцию();
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось установить период планирования в документе Плана продаж: %1 по причине:"
"%2';uk='Не вдалося встановити період планування в документі Плану продажів: %1 з причини:"
"%2'"), 
					Выборка.ДокументСсылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ПланПродаж, Выборка.ДокументСсылка, ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано + ПроблемныхОбъектов = 0 Или Выборка.Количество() < РазмерПорцииДанных Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		
	Иначе
		
		Параметры.ОбработкаЗавершена = Ложь;
		
		Если ОбъектовОбработано = 0 Тогда
			ПараметрыПредметаИсчисления = НСтр("ru='документе, документах, документах';uk='документі, документах, документах'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедуре ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыПланПродаж"
"не удалось заполнить период планирования в %1 Плана продаж';uk='Процедурі ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыПланПродаж"
"не вдалося заповнити період планування в %1 Плану продажів'"),
				СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ПроблемныхОбъектов, ПараметрыПредметаИсчисления)
			);
			ВызватьИсключение ТекстСообщения;
		Иначе
			ПараметрыПредметаИсчисления = НСтр("ru='документ, документа, документов';uk='документ, документа, документів'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедура ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыПланПродаж"
"обработала очередную порцию: %1';uk='Процедура ОбновлениеИнформационнойБазыУНФ.ПеренестиПериодПланированияВДокументыПланПродаж"
"обробила чергову порцію: %1'"),
				СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ОбъектовОбработано, ПараметрыПредметаИсчисления)
			);
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
				Метаданные.Документы.ПланПродаж, , ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_4_23

Процедура УстановитьПараметрыНабораСвойствСправочникаПроекты() Экспорт
	
	ПараметрыНабораСвойств = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_КонтактныеЛица", ПараметрыНабораСвойств);
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Проекты", ПараметрыНабораСвойств);
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствСправочникаСерийныеНомера() Экспорт
	
	ПараметрыНабораСвойств = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_СерийныеНомера", ПараметрыНабораСвойств);
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствДокументаПриемИПередачаВРемонт() Экспорт
	
	ПараметрыНабораСвойств = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ПриемИПередачаВРемонт", ПараметрыНабораСвойств);
	
КонецПроцедуры

Процедура ОбновитьНастройкиОтчетов_1_6_5(СтруктураПараметров = Неопределено) Экспорт
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить(Метаданные.Отчеты.ДенежныеСредства);
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(МассивОтчетов);
	
КонецПроцедуры

Процедура ОчиститьЗаписиДублейСПустымИНН() Экспорт
	
	Набор = РегистрыСведений.НаличиеДублейУКонтрагентов.СоздатьНаборЗаписей();
	Набор.Отбор.ИНН.Установить("");
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина);
	
КонецПроцедуры

Процедура УдалитьУстаревшиеОбработчики(Параметры = Неопределено) Экспорт
	
	// Пример взят из БСП ВариантыОтчетов.УдалитьУстаревшиеОбработчики()
	
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ПроверкаКонтрагентов.ПроверитьКонтрагентовПослеВключенияПроверки");
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ОбменСКонтрагентамиОбработчикиОбновления.ПроверитьКонтрагентовБЭД");
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ОбновлениеИнформационнойБазыУНФ.УстановитьНастройкиОтбораНоменклатуры");
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ОбновлениеИнформационнойБазыУНФ.УдалениеДублейДвиженийПоРегиструЗапасы");
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ОбновлениеИнформационнойБазыУНФ.ОбновлениеДокументовЗарплаты");
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ОтчетыУНФ.Обновить");
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди("ОтчетыУНФ.ОбновитьТегиОтчетов");
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_1_6_6

// МобильноеПриложение
Процедура УстановитьКонстантуЭтоОбычноеПриложение() Экспорт
	
	Если НЕ Константы.ЭтоМобильноеПриложение.Получить() Тогда
		Константы.ЭтоОбычноеПриложение.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры
// Конец МобильноеПриложение

Процедура ОбновитьНастройкиОтчетов_1_6_6(Параметры = Неопределено) Экспорт
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить(Метаданные.Отчеты.ДвиженияСерийныхНомеров);
	МассивОтчетов.Добавить(Метаданные.Отчеты.СкладПоСерийнымНомерам);
	МассивОтчетов.Добавить(Метаданные.Отчеты.СкладПоЗапасамВРемонте);
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(МассивОтчетов);
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВходящееИсходящееСобытие(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Событие.Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ВходящееИсходящееСобытие = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.ПустаяСсылка)");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Событие = Выборка.Ссылка.ПолучитьОбъект();
		Событие.ВходящееИсходящееСобытие = Перечисления.ВходящееИсходящееСобытие.Исходящее;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Событие);
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Выборка.Количество() < 1000;
	
КонецПроцедуры

Процедура ИнициализироватьНовыеВозможностиПодсистемыИмпорта() Экспорт
	
	Константы.ДатаОбновленияНаРелиз_1_6_6.Установить(ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура ДобавитьВКалендарьЗадачуПоАлкогольнойДекларации12() Экспорт
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
КонецПроцедуры

Процедура ДобавитьОграничениеДоступаПоВидуДоговоровКредитаИЗайма() Экспорт
	
	Выборка = Справочники.ПрофилиГруппДоступа.Выбрать();
	Пока Выборка.Следующий() Цикл
		// Зарплата
		Если Выборка.ИдентификаторПоставляемыхДанных = Новый УникальныйИдентификатор("76337574-bff4-11df-9174-e0cb4ed5f4c3") Тогда
			
			ВыборкаГруппДоступа = Справочники.ГруппыДоступа.Выбрать();
			Пока ВыборкаГруппДоступа.Следующий() Цикл
				
				Если ВыборкаГруппДоступа.Профиль = Выборка.Ссылка Тогда
					Если ВыборкаГруппДоступа.ЗначенияДоступа.Количество() = 0 Тогда
						
						ГруппаДоступаОбъект = ВыборкаГруппДоступа.ПолучитьОбъект();
						
						ГруппаДоступаОбъект.ЗначенияДоступа.Очистить();
						
						НоваяСтрокаЗначение = ГруппаДоступаОбъект.ЗначенияДоступа.Добавить();
						НоваяСтрокаЗначение.ВидДоступа = Перечисления.ВидыДоговоровКредитаИЗайма.ПустаяСсылка();
						НоваяСтрокаЗначение.ЗначениеДоступа = Перечисления.ВидыДоговоровКредитаИЗайма.КредитПолученный;
						
						ГруппаДоступаОбъект.Записать();
						
						Прервать;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьНовыйСчетУчетаПодсистемыИмпорта() Экспорт
	
	СчетУчета = ПланыСчетов.Управленческий.РасчетыСПрочимиПоставщикамиИТаможеннымиОрганами.ПолучитьОбъект();
	СчетУчета.ТипСчета = Перечисления.ТипыСчетов.Кредиторы;
	СчетУчета.СпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять;
	СчетУчета.Записать();
	
КонецПроцедуры

Процедура ОчиститьОшибочныеСостоянияПроверкиКонтрагентов(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияКонтрагентов.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
		|ГДЕ
		|	СостоянияКонтрагентов.Состояние В(&Состояния)";
	
	Запрос.УстановитьПараметр("Состояния", ПроверкаКонтрагентовКлиентСерверПовтИсп.ВсеОшибочныеСостоянияКонтрагента());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Набор = РегистрыСведений.СостоянияКонтрагентов.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		Набор.Отбор.Контрагент.Установить(Выборка.Контрагент);
		Набор.Очистить();
		Набор.Записать(Истина);
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
	// Новая проверка запустится автоматически регламентным заданием "ПроверкаКонтрагентов"
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_4_22

Процедура ОбновлениеВзносов(СтруктураПараметров = Неопределено)  Экспорт
	
	МассивВзносов = Новый Массив;
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы);
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.ПФРПоСуммарномуТарифу);
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.ПФРСтраховая);
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.ПФРНакопительная);
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.ФСС);
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.ФССНесчастныеСлучаи);
	МассивВзносов.Добавить(Справочники.ВидыНачисленийИУдержаний.ФФОМС);
	
	УправленческийСчетЗатрат = ПланыСчетов.Управленческий.УправленческиеРасходы;
	Для Каждого Взнос Из МассивВзносов Цикл
		ОбъектВзнос = Взнос.ПолучитьОбъект();
		ОбъектВзнос.СчетЗатрат = УправленческийСчетЗатрат;
		ОбъектВзнос.Записать();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектВзнос);
	КонецЦикла;
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_1_6_7

Процедура ИнициализироватьНовыйСпособХраненияПаролейОбменаССайтом() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбменУправлениеНебольшойФирмойСайт.Ссылка,
	|	ОбменУправлениеНебольшойФирмойСайт.Пароль
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойСайт КАК ОбменУправлениеНебольшойФирмойСайт";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Выборка.Следующий() Цикл
	
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Выборка.Ссылка, Выборка.Пароль);
	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьНастройкиОтчетов_1_6_7(Параметры = Неопределено) Экспорт
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить(Метаданные.Отчеты.ДоходыИРасходы);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ДоходыИРасходыКассовымМетодом);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ДоходыИРасходыПрогноз);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ФинансовыйРезультат);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ФинансовыйРезультатПрогноз);
	МассивОтчетов.Добавить(Метаданные.Отчеты.АнализБазыКонтрагентов);
	МассивОтчетов.Добавить(Метаданные.Отчеты.АнализРаботыМенеджеров);
	МассивОтчетов.Добавить(Метаданные.Отчеты.КалендарьСобытий);
	МассивОтчетов.Добавить(Метаданные.Отчеты.КонтрольЗаполненияКонтактнойИнформации);
	МассивОтчетов.Добавить(Метаданные.Отчеты.СводныйАнализЗаказовПокупателей);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ПланФактныйАнализПродаж);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ПланыПродаж);
	МассивОтчетов.Добавить(Метаданные.Отчеты.Продажи);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ABCАнализПродаж);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ABCXYZАнализПродаж);
	МассивОтчетов.Добавить(Метаданные.Отчеты.РеестрСтаренияДебиторскойЗадолженности);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ВоронкаПродаж);
	МассивОтчетов.Добавить(Метаданные.Отчеты.РасчетыПоКредитамИЗаймам);
	МассивОтчетов.Добавить(Метаданные.Отчеты.Себестоимость);
	МассивОтчетов.Добавить(Метаданные.Отчеты.ИспользуемыеВнешниеРесурсы);
	МассивОтчетов.Добавить(Метаданные.Отчеты.СведенияОПользователях);
	МассивОтчетов.Добавить(Метаданные.Отчеты.Склад);
	ОтчетыУНФ.ОбновитьОтчетыВыборочно(МассивОтчетов);
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьКИ_ФизическиеЛица_Email() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид										= Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица;
	ПараметрыВида.Порядок									= 6;
	ПараметрыВида.МожноИзменятьСпособРедактирования			= Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге				= Ложь;
	ПараметрыВида.ОбязательноеЗаполнение					= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений			= Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем		= Ложь;
	ПараметрыВида.Используется								= Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность	= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	КонтактнаяИнформацияУНФ.УстановитьФлагВыводитьВФормеВсегда(ПараметрыВида.Вид);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Другое");
	ПараметрыВида.Вид 									= Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияФизЛица;
	ПараметрыВида.Порядок								= 7;
	ПараметрыВида.МожноИзменятьСпособРедактирования		= Истина;
	ПараметрыВида.РедактированиеТолькоВДиалоге			= Ложь;
	ПараметрыВида.ОбязательноеЗаполнение				= Ложь;
	ПараметрыВида.РазрешитьВводНесколькихЗначений		= Ложь;
	ПараметрыВида.ЗапретитьРедактированиеПользователем	= Ложь;
	ПараметрыВида.Используется							= Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Функция НайтиСоздатьПричинуОтменыЗаказа()
	
	ПричинаОтмены = Справочники.ПричиныОтменыЗаказа.НайтиПоНаименованию("<Не указана>", Истина);
	
	Если Не ЗначениеЗаполнено(ПричинаОтмены) Тогда
		
		ПричинаОтменыОбъект = Справочники.ПричиныОтменыЗаказа.СоздатьЭлемент();
		ПричинаОтменыОбъект.Наименование	= НСтр("ru='<Не указана>';uk='<Не вказана>'");
		ПричинаОтменыОбъект.Комментарий		= НСтр("ru='Создана автоматически для обновления отмененных заказов';uk='Створена автоматично для оновлення скасованих замовлень'");
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПричинаОтменыОбъект);
		ПричинаОтмены = ПричинаОтменыОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат ПричинаОтмены;
	
КонецФункции

Функция НайтиСоздатьСостояниеЗаказНаряда(Наименование, Цвет, ПометкаУдаления)
	
	СостояниеЗаказНаряда = Справочники.СостоянияЗаказНарядов.НайтиПоНаименованию(Наименование, Истина);
	
	Если Не ЗначениеЗаполнено(СостояниеЗаказНаряда) Тогда
		
		СостояниеЗаказНарядаОбъект = Справочники.СостоянияЗаказНарядов.СоздатьЭлемент();
		СостояниеЗаказНарядаОбъект.Наименование = Наименование;
		СостояниеЗаказНарядаОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
		СостояниеЗаказНарядаОбъект.ПометкаУдаления = ПометкаУдаления;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СостояниеЗаказНарядаОбъект);
		СостояниеЗаказНаряда = СостояниеЗаказНарядаОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СостояниеЗаказНаряда;
	
КонецФункции

Процедура ОбновитьСправочникиСостояний() Экспорт
	
	ОбновитьСправочникСостояний("СостоянияЗаказовПокупателей");
	ОбновитьСправочникСостояний("СостоянияЗаказовПоставщикам");
	ОбновитьСправочникСостояний("СостоянияЗаказовНаПроизводство");
	
КонецПроцедуры

Процедура ОбновитьСправочникСостояний(ИмяСправочника)
	
	Если Константы["УдалитьИспользовать" + ИмяСправочника].Получить() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние
			|ИЗ
			|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
			|ГДЕ
			|	СостоянияЗаказовПокупателей.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт)
			|	И СостоянияЗаказовПокупателей.ПометкаУдаления = ИСТИНА";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияЗаказовПокупателей", ИмяСправочника);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СостояниеОбъект = Выборка.Состояние.ПолучитьОбъект();
			СостояниеОбъект.УстановитьПометкуУдаления(Ложь);
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние
			|ИЗ
			|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
			|ГДЕ
			|	СостоянияЗаказовПокупателей.УдалитьСтатусЗаказа В (ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт), ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Выполнен))
			|	И СостоянияЗаказовПокупателей.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияЗаказовПокупателей", ИмяСправочника);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СостояниеОбъект = Выборка.Состояние.ПолучитьОбъект();
			
			Если ОбщегоНазначения.ЕстьСсылкиНаОбъект(Выборка.Состояние) Тогда
				СостояниеОбъект.УстановитьПометкуУдаления(Истина);
			Иначе
				СостояниеОбъект.Удалить();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеВидыЗаказов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.Ссылка <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияЗаказовПокупателей.УдалитьРеквизитДопУпорядочивания,
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
		|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
		|	СостоянияЗаказовПокупателей.Цвет КАК Цвет,
		|	СостоянияЗаказовПокупателей.ПометкаУдаления КАК ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА СостоянияЗаказовПокупателей.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт)
		|			ТОГДА 1
		|		КОГДА СостоянияЗаказовПокупателей.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.ВРаботе)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПорядокСтатусов,
		|	СостоянияЗаказовПокупателей.УдалитьСтатусЗаказа КАК Статус
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.Ссылка <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСтатусов,
		|	СостоянияЗаказовПокупателей.УдалитьРеквизитДопУпорядочивания,
		|	Наименование";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаСостояний = МассивРезультатов[0].Выбрать();
	ОсновнойВидЗаказаПокупателя = Справочники.ВидыЗаказовПокупателей.Основной.ПолучитьОбъект();
	ОсновнойВидЗаказаПокупателя.ПорядокСостояний.Очистить();
	
	Пока ВыборкаСостояний.Следующий() Цикл
		
		НоваяСтрока = ОсновнойВидЗаказаПокупателя.ПорядокСостояний.Добавить();
		НоваяСтрока.Состояние = ВыборкаСостояний.Состояние;
		
	КонецЦикла;
	
	НоваяСтрока = ОсновнойВидЗаказаПокупателя.ПорядокСостояний.Добавить();
	НоваяСтрока.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОсновнойВидЗаказаПокупателя);
	
	ВыборкаСостояний = МассивРезультатов[1].Выбрать();
	ОсновнойВидЗаказНаряда = Справочники.ВидыЗаказНарядов.Основной.ПолучитьОбъект();
	ОсновнойВидЗаказНаряда.ПорядокСостояний.Очистить();
	
	Пока ВыборкаСостояний.Следующий() Цикл
		
		НовоеСостояниеЗаказНаряда = НайтиСоздатьСостояниеЗаказНаряда(
			ВыборкаСостояний.Наименование,
			ВыборкаСостояний.Цвет.Получить(),
			ВыборкаСостояний.ПометкаУдаления
		);
		
		НоваяСтрока = ОсновнойВидЗаказНаряда.ПорядокСостояний.Добавить();
		НоваяСтрока.Состояние = НовоеСостояниеЗаказНаряда;
		
		Если Не ЗначениеЗаполнено(ОсновнойВидЗаказНаряда.СостояниеВыполнения)
			И ВыборкаСостояний.Статус = Перечисления.УдалитьСтатусыЗаказов.Выполнен Тогда
			
			ОсновнойВидЗаказНаряда.СостояниеВыполнения		= НоваяСтрока.Состояние;
			ОсновнойВидЗаказНаряда.НомерСостоянияВыполнения	= НоваяСтрока.НомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаЗавершен = ОсновнойВидЗаказНаряда.ПорядокСостояний.Добавить();
	СтрокаЗавершен.Состояние = Справочники.СостоянияЗаказНарядов.Завершен;
	
	Если Не ЗначениеЗаполнено(ОсновнойВидЗаказНаряда.СостояниеВыполнения) Тогда
		ОсновнойВидЗаказНаряда.СостояниеВыполнения		= СтрокаЗавершен.Состояние;
		ОсновнойВидЗаказНаряда.НомерСостоянияВыполнения	= СтрокаЗавершен.НомерСтроки;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОсновнойВидЗаказНаряда);
	
КонецПроцедуры

Процедура ОбновитьВсеЗаказы(Параметры) Экспорт
	
	ИспользоватьСостоянияЗаказовПокупателей		= Константы.УдалитьИспользоватьСостоянияЗаказовПокупателей.Получить();
	ИспользоватьСостоянияЗаказовПоставщикам		= Константы.УдалитьИспользоватьСостоянияЗаказовПоставщикам.Получить();
	ИспользоватьСостоянияЗаказовНаПроизводство	= Константы.УдалитьИспользоватьСостоянияЗаказовНаПроизводство.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя,
		|	ЗаказПокупателя.СостояниеЗаказа.УдалитьСтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	НЕ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ЗаказПокупателя.ВидЗаказа = НЕОПРЕДЕЛЕНО
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокупателя.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЗаказПокупателя.Ссылка КАК ЗаказНаряд,
		|	ЗаказПокупателя.СостояниеЗаказа.УдалитьСтатусЗаказа КАК СтатусЗаказа,
		|	ЗаказПокупателя.СостояниеЗаказа.Наименование КАК СостояниеНаименование,
		|	ЗаказПокупателя.СостояниеЗаказа.Цвет КАК СостояниеЦвет,
		|	ЗаказПокупателя.СостояниеЗаказа.ПометкаУдаления КАК СостояниеПометкаУдаления,
		|	ЗаказПокупателя.СостояниеЗаказа.УдалитьРеквизитДопУпорядочивания КАК СостояниеПорядок
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ЗаказПокупателя.ВидЗаказа = НЕОПРЕДЕЛЕНО
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокупателя.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
		|	ЗаказПоставщику.СостояниеЗаказа.УдалитьСтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	(ЗаказПоставщику.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт)
		|				И НЕ ЗаказПоставщику.УдалитьЗакрыт
		|				И ЗаказПоставщику.Проведен
		|			ИЛИ ЗаказПоставщику.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт)
		|				И ЗаказПоставщику.УдалитьЗакрыт
		|				И НЕ ЗаказПоставщику.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|			ИЛИ ЗаказПоставщику.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.ВРаботе)
		|				И ЗаказПоставщику.УдалитьЗакрыт
		|				И НЕ ЗаказПоставщику.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|			ИЛИ ЗаказПоставщику.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Выполнен)
		|				И (НЕ &ИспользоватьСостоянияЗаказовПоставщикам
		|					ИЛИ ЗаказПоставщику.УдалитьЗакрыт)
		|				И НЕ ЗаказПоставщику.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Успешно))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщику.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЗаказНаПроизводство.Ссылка КАК ЗаказНаПроизводство,
		|	ЗаказНаПроизводство.СостояниеЗаказа.УдалитьСтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ГДЕ
		|	(ЗаказНаПроизводство.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт)
		|				И НЕ ЗаказНаПроизводство.УдалитьЗакрыт
		|				И ЗаказНаПроизводство.Проведен
		|			ИЛИ ЗаказНаПроизводство.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Открыт)
		|				И ЗаказНаПроизводство.УдалитьЗакрыт
		|				И НЕ ЗаказНаПроизводство.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|			ИЛИ ЗаказНаПроизводство.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.ВРаботе)
		|				И ЗаказНаПроизводство.УдалитьЗакрыт
		|				И НЕ ЗаказНаПроизводство.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|			ИЛИ ЗаказНаПроизводство.СостояниеЗаказа.УдалитьСтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.УдалитьСтатусыЗаказов.Выполнен)
		|				И (НЕ &ИспользоватьСостоянияЗаказовНаПроизводство
		|					ИЛИ ЗаказНаПроизводство.УдалитьЗакрыт)
		|				И НЕ ЗаказНаПроизводство.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Успешно))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаПроизводство.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ИспользоватьСостоянияЗаказовПоставщикам", ИспользоватьСостоянияЗаказовПоставщикам);
	Запрос.УстановитьПараметр("ИспользоватьСостоянияЗаказовНаПроизводство", ИспользоватьСостоянияЗаказовНаПроизводство);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаЗаказовПокупателя		= МассивРезультатов[0].Выбрать();
	ВыборкаЗаказНарядов				= МассивРезультатов[1].Выбрать();
	ВыборкаЗаказовПоставщику		= МассивРезультатов[2].Выбрать();
	ВыборкаЗаказовНаПроизводство	= МассивРезультатов[3].Выбрать();
	
	ВсегоОбработано = 0;
	ВсегоПроблемных = 0;
	
	МинимальнаяПорцияПоЗаказу = 250;
	МаксКоличествоЗаписываемыхОбъектов = 1000;
	ОбъектовКОбработкеВБолееПриоритетныхЗаказах = ВыборкаЗаказовПокупателя.Количество() + ВыборкаЗаказНарядов.Количество() + ВыборкаЗаказовПоставщику.Количество();
	Порция = Макс(МинимальнаяПорцияПоЗаказу, (МаксКоличествоЗаписываемыхОбъектов - ОбъектовКОбработкеВБолееПриоритетныхЗаказах));
	ТекущийЦикл = 0;
	
	Пока ВыборкаЗаказовНаПроизводство.Следующий() И (ТекущийЦикл < Порция) Цикл
		
		ТекущийЦикл = ТекущийЦикл + 1;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ЗаказНаПроизводство");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаЗаказовНаПроизводство.ЗаказНаПроизводство);
			Блокировка.Заблокировать();
			
			ЗаказНаПроизводствоОбъект = ВыборкаЗаказовНаПроизводство.ЗаказНаПроизводство.ПолучитьОбъект();
			
			Если ВыборкаЗаказовНаПроизводство.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
				
				Если ЗаказНаПроизводствоОбъект.УдалитьЗакрыт Тогда
					СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказНаПроизводствоОбъект.Ссылка, ЗаказНаПроизводствоОбъект.СостояниеЗаказа, ЗаказНаПроизводствоОбъект.Дата);
					ЗаказНаПроизводствоОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовНаПроизводство.Завершен;
					ЗаказНаПроизводствоОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
				Иначе
					ЗаказНаПроизводствоОбъект.Проведен = Ложь;
				КонецЕсли;
				
			ИначеЕсли ВыборкаЗаказовНаПроизводство.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе
				И ЗаказНаПроизводствоОбъект.УдалитьЗакрыт Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказНаПроизводствоОбъект.Ссылка, ЗаказНаПроизводствоОбъект.СостояниеЗаказа, ЗаказНаПроизводствоОбъект.Дата);
				ЗаказНаПроизводствоОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовНаПроизводство.Завершен;
				ЗаказНаПроизводствоОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
				
			ИначеЕсли ВыборкаЗаказовНаПроизводство.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
				И (Не ИспользоватьСостоянияЗаказовНаПроизводство Или ЗаказНаПроизводствоОбъект.УдалитьЗакрыт) Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказНаПроизводствоОбъект.Ссылка, ЗаказНаПроизводствоОбъект.СостояниеЗаказа, ЗаказНаПроизводствоОбъект.Дата);
				ЗаказНаПроизводствоОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовНаПроизводство.Завершен;
				ЗаказНаПроизводствоОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Успешно;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаказНаПроизводствоОбъект);
			
			ЗафиксироватьТранзакцию();
			
			ВсегоОбработано = ВсегоОбработано + 1;
			
		Исключение
			
			ВсегоПроблемных = ВсегоПроблемных + 1;
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обновить заказ на производство: ""%1"" по причине: %2';uk='Не вдалося відновити замовлення на виробництво: ""%1"" з причини: %2'"),
					ВыборкаЗаказовНаПроизводство.ЗаказНаПроизводство,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
				);
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ЗаказНаПроизводство, ВыборкаЗаказовНаПроизводство.ЗаказНаПроизводство, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	МаксКоличествоЗаписываемыхОбъектов = МаксКоличествоЗаписываемыхОбъектов - ТекущийЦикл;
	ОбъектовКОбработкеВБолееПриоритетныхЗаказах = ВыборкаЗаказовПокупателя.Количество() + ВыборкаЗаказНарядов.Количество();
	Порция = Макс(МинимальнаяПорцияПоЗаказу, (МаксКоличествоЗаписываемыхОбъектов - ОбъектовКОбработкеВБолееПриоритетныхЗаказах));
	ТекущийЦикл = 0;
	
	Пока ВыборкаЗаказовПоставщику.Следующий() И (ТекущийЦикл < Порция) Цикл
		
		ТекущийЦикл = ТекущийЦикл + 1;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ЗаказПоставщику");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаЗаказовПоставщику.ЗаказПоставщику);
			Блокировка.Заблокировать();
			
			ЗаказПоставщикуОбъект = ВыборкаЗаказовПоставщику.ЗаказПоставщику.ПолучитьОбъект();
			
			Если ВыборкаЗаказовПоставщику.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
				
				Если ЗаказПоставщикуОбъект.УдалитьЗакрыт Тогда
					СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказПоставщикуОбъект.Ссылка, ЗаказПоставщикуОбъект.СостояниеЗаказа, ЗаказПоставщикуОбъект.Дата);
					ЗаказПоставщикуОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПоставщикам.Завершен;
					ЗаказПоставщикуОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
				Иначе
					ЗаказПоставщикуОбъект.Проведен = Ложь;
				КонецЕсли;
				
			ИначеЕсли ВыборкаЗаказовПоставщику.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе
				И ЗаказПоставщикуОбъект.УдалитьЗакрыт Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказПоставщикуОбъект.Ссылка, ЗаказПоставщикуОбъект.СостояниеЗаказа, ЗаказПоставщикуОбъект.Дата);
				ЗаказПоставщикуОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПоставщикам.Завершен;
				ЗаказПоставщикуОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
				
			ИначеЕсли ВыборкаЗаказовПоставщику.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
				И (Не ИспользоватьСостоянияЗаказовПоставщикам Или ЗаказПоставщикуОбъект.УдалитьЗакрыт) Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказПоставщикуОбъект.Ссылка, ЗаказПоставщикуОбъект.СостояниеЗаказа, ЗаказПоставщикуОбъект.Дата);
				ЗаказПоставщикуОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПоставщикам.Завершен;
				ЗаказПоставщикуОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Успешно;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаказПоставщикуОбъект);
			
			ЗафиксироватьТранзакцию();
			
			ВсегоОбработано = ВсегоОбработано + 1;
			
		Исключение
			
			ВсегоПроблемных = ВсегоПроблемных + 1;
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обновить заказ поставщику: ""%1"" по причине: %2';uk='Не вдалося відновити замовлення постачальникові : ""%1"" з причини: %2'"),
					ВыборкаЗаказовПоставщику.ЗаказПоставщику,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
				);
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ЗаказПоставщику, ВыборкаЗаказовПоставщику.ЗаказПоставщику, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	МаксКоличествоЗаписываемыхОбъектов = МаксКоличествоЗаписываемыхОбъектов - ТекущийЦикл;
	ОбъектовКОбработкеВБолееПриоритетныхЗаказах = ВыборкаЗаказовПокупателя.Количество();
	Порция = Макс(МинимальнаяПорцияПоЗаказу, (МаксКоличествоЗаписываемыхОбъектов - ОбъектовКОбработкеВБолееПриоритетныхЗаказах));
	ТекущийЦикл = 0;
	
	Пока ВыборкаЗаказНарядов.Следующий() И (ТекущийЦикл < Порция) Цикл
		
		ТекущийЦикл = ТекущийЦикл + 1;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ЗаказПокупателя");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаЗаказНарядов.ЗаказНаряд);
			Блокировка.Заблокировать();
			
			ЗаказНарядОбъект = ВыборкаЗаказНарядов.ЗаказНаряд.ПолучитьОбъект();
			ЗаказНарядОбъект.ВидЗаказа = Справочники.ВидыЗаказНарядов.Основной;
			ЗаказНарядОбъект.СостояниеЗаказа = НайтиСоздатьСостояниеЗаказНаряда(
				ВыборкаЗаказНарядов.СостояниеНаименование,
				ВыборкаЗаказНарядов.СостояниеЦвет.Получить(),
				ВыборкаЗаказНарядов.СостояниеПометкаУдаления
			);
			Если ВыборкаЗаказНарядов.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
				
				Если ЗаказНарядОбъект.УдалитьЗакрыт Тогда
					СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказНарядОбъект.Ссылка, ЗаказНарядОбъект.СостояниеЗаказа, ЗаказНарядОбъект.Дата);
					ЗаказНарядОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказНарядов.Завершен;
					ЗаказНарядОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
					ЗаказНарядОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
				Иначе
					ЗаказНарядОбъект.Проведен = Ложь;
				КонецЕсли;
				
			ИначеЕсли ВыборкаЗаказНарядов.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе И ЗаказНарядОбъект.УдалитьЗакрыт Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказНарядОбъект.Ссылка, ЗаказНарядОбъект.СостояниеЗаказа, ЗаказНарядОбъект.Дата);
				ЗаказНарядОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказНарядов.Завершен;
				ЗаказНарядОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
				ЗаказНарядОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
				
			ИначеЕсли ВыборкаЗаказНарядов.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
				И (Не ИспользоватьСостоянияЗаказовПокупателей Или ЗаказНарядОбъект.УдалитьЗакрыт) Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказНарядОбъект.Ссылка, ЗаказНарядОбъект.СостояниеЗаказа, ЗаказНарядОбъект.Дата);
				ЗаказНарядОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказНарядов.Завершен;
				ЗаказНарядОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаказНарядОбъект);
			
			ЗафиксироватьТранзакцию();
			
			ВсегоОбработано = ВсегоОбработано + 1;
			
		Исключение
			
			ВсегоПроблемных = ВсегоПроблемных + 1;
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обновить заказ-наряд: ""%1"" по причине: %2';uk='Не вдалося відновити замовлення-наряд: ""%1"" з причини: %2'"),
					ВыборкаЗаказНарядов.ЗаказНаряд,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
				);
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ЗаказПокупателя, ВыборкаЗаказНарядов.ЗаказНаряд, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	МаксКоличествоЗаписываемыхОбъектов = МаксКоличествоЗаписываемыхОбъектов - ТекущийЦикл;
	ТекущийЦикл = 0;
	
	Пока ВыборкаЗаказовПокупателя.Следующий() И (ТекущийЦикл < МаксКоличествоЗаписываемыхОбъектов) Цикл
		
		ТекущийЦикл = ТекущийЦикл + 1;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ЗаказПокупателя");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаЗаказовПокупателя.ЗаказПокупателя);
			Блокировка.Заблокировать();
			
			ЗаказПокупателяОбъект = ВыборкаЗаказовПокупателя.ЗаказПокупателя.ПолучитьОбъект();
			ЗаказПокупателяОбъект.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
			
			Если ВыборкаЗаказовПокупателя.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
				
				Если ЗаказПокупателяОбъект.УдалитьЗакрыт Тогда
					СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказПокупателяОбъект.Ссылка, ЗаказПокупателяОбъект.СостояниеЗаказа, ЗаказПокупателяОбъект.Дата);
					ЗаказПокупателяОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПокупателей.Завершен;
					ЗаказПокупателяОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
					ЗаказПокупателяОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
				Иначе
					ЗаказПокупателяОбъект.Проведен = Ложь;
				КонецЕсли;
				
			ИначеЕсли ВыборкаЗаказовПокупателя.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе И ЗаказПокупателяОбъект.УдалитьЗакрыт Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказПокупателяОбъект.Ссылка, ЗаказПокупателяОбъект.СостояниеЗаказа, ЗаказПокупателяОбъект.Дата);
				ЗаказПокупателяОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПокупателей.Завершен;
				ЗаказПокупателяОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
				ЗаказПокупателяОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
				
			ИначеЕсли ВыборкаЗаказовПокупателя.СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
				И (Не ИспользоватьСостоянияЗаказовПокупателей Или ЗаказПокупателяОбъект.УдалитьЗакрыт) Тогда
				
				СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ЗаказПокупателяОбъект.Ссылка, ЗаказПокупателяОбъект.СостояниеЗаказа, ЗаказПокупателяОбъект.Дата);
				ЗаказПокупателяОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
				ЗаказПокупателяОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаказПокупателяОбъект);
			
			ЗафиксироватьТранзакцию();
			
			ВсегоОбработано = ВсегоОбработано + 1;
			
		Исключение
			
			ВсегоПроблемных = ВсегоПроблемных + 1;
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обновить заказ покупателя: ""%1"" по причине: %2';uk='Не вдалося відновити замовлення покупця : ""%1"" з причини: %2'"),
					ВыборкаЗаказовПокупателя.ЗаказПокупателя,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
				);
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ЗаказПокупателя, ВыборкаЗаказовПокупателя.ЗаказПокупателя, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ВсегоОбработано + ВсегоПроблемных = 0
		Или ВыборкаЗаказНарядов.Количество() + ВыборкаЗаказовНаПроизводство.Количество() + ВыборкаЗаказовПокупателя.Количество() + ВыборкаЗаказовПоставщику.Количество() < 1000 Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		
	Иначе
		
		Параметры.ОбработкаЗавершена = Ложь;
		
		Если ВсегоОбработано = 0 Тогда
			ПараметрыПредметаИсчисления = НСтр("ru='заказе, заказах, заказах';uk='замовленні, замовленнях, замовленнях'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедуре ОбновлениеИнформационнойБазыУНФ.ОбновитьВсеЗаказы"
"не удалось выполнить обновление в %1';uk='Процедурі ОбновлениеИнформационнойБазыУНФ.ОбновитьВсеЗаказы"
"не вдалося виконати оновлення в %1'"),
				СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ВсегоПроблемных, ПараметрыПредметаИсчисления)
			);
			ВызватьИсключение ТекстСообщения;
		Иначе
			ПараметрыПредметаИсчисления = НСтр("ru='заказ, заказа, заказов';uk='замовлення, замовлення, замовлень'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедура ОбновлениеИнформационнойБазыУНФ.ОбновитьВсеЗаказы"
"обработала очередную порцию: %1';uk='Процедура ОбновлениеИнформационнойБазыУНФ.ОбновитьВсеЗаказы"
"обробила чергову порцію: %1'"),
				СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ВсегоОбработано, ПараметрыПредметаИсчисления)
			);
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
				Метаданные.Документы.ЗаказПокупателя, , ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЦветЗавершенныхСостоянийЗаказов() Экспорт
	
	Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен.ПолучитьОбъект();
	Состояние.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
	
	Состояние = Справочники.СостоянияЗаказНарядов.Завершен.ПолучитьОбъект();
	Состояние.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
	
	Состояние = Справочники.СостоянияЗаказовПоставщикам.Завершен.ПолучитьОбъект();
	Состояние.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
	
	Состояние = Справочники.СостоянияЗаказовНаПроизводство.Завершен.ПолучитьОбъект();
	Состояние.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
	
КонецПроцедуры

Процедура ОбновитьВидыНалогов(Параметры) Экспорт
	
	// Обрабатываем все предопределенные элементы
	//  АвансовыйПлатежПриУСН - не обрабатываем, кбк различный,
	// в зависимости от типа налогообложения
	
	Налог = Справочники.ВидыНалогов.ПФРНакопительная.ПолучитьОбъект();
	Налог.Наименование = "Фиксированные взносы в ПФР, накопительная часть (до 2014 г.)";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_НакопительнаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ПФРСвыше300тр.ПолучитьОбъект();
	Налог.Наименование = "Взносы в ПФР при доходах свыше 300 тысяч руб.(ИП)";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ПустаяСсылка();
	//Налог.КодБК = "39210202140061200160";
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ПФРСтраховая.ПолучитьОбъект();
	Налог.Наименование = "Фиксированные взносы в ПФР";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники.ПолучитьОбъект();
	Налог.Наименование = "Страховые взносы в ПФР, накопительная часть по сотрудникам (до 2014 г.)";
	Налог.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники.ПолучитьОбъект();
	Налог.Наименование = "Страховые взносы в ПФР по сотрудникам";
	Налог.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ТФОМС.ПолучитьОбъект();
	Налог.Наименование = "Фиксированные взносы в ТФОМС";
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ФССТравматизмСотрудники.ПолучитьОбъект();
	Налог.Наименование = "Страховые взносы в ФСС от несчастных случаев";
	Налог.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ФСССотрудники.ПолучитьОбъект();
	Налог.Наименование = "Страховые взносы в ФСС";
	Налог.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ФФОМС.ПолучитьОбъект();
	Налог.Наименование = "Фиксированные взносы в ФФОМС";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ФОМССотрудники.ПолучитьОбъект();
	Налог.Наименование = "Страховые взносы в ФФОМС";
	Налог.ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ЕНВД.ПолучитьОбъект();
	Налог.Наименование = "Единый налог(ЕНВД)";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ЕНВД;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.НДФЛСотрудники.ПолучитьОбъект();
	Налог.Наименование = "НДФЛ при исполнении обязанностей налогового агента";
	Налог.ВидНалога = Перечисления.ВидыНалогов.НДФЛ;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Налог = Справочники.ВидыНалогов.ТорговыйСбор.ПолучитьОбъект();
	Налог.Наименование = "Торговый сбор";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ТорговыйСбор;
	ДанныеПоНалогу = Справочники.ВидыНалогов.НайтиПоставляемыеДанные(Налог.ВидНалога, Неопределено, Неопределено);
	Если ДанныеПоНалогу <> Неопределено Тогда
		Налог.КодБК = ДанныеПоНалогу.КодБК;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	// Проставляем оставшиеся значения КБК 
	// по данным банковских выписок
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНалогов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТВидыНалогов
	|ИЗ
	|	Справочник.ВидыНалогов КАК ВидыНалогов
	|ГДЕ
	|	НЕ ВидыНалогов.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходСоСчета.ВидНалога,
	|	ПлатежноеПоручение.КодБК
	|ИЗ
	|	Документ.РасходСоСчета КАК РасходСоСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыНалогов КАК ВидыНалогов
	|		ПО (ВидыНалогов.Ссылка = РасходСоСчета.ВидНалога)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|		ПО (ПлатежноеПоручение.Ссылка = РасходСоСчета.ДокументОснование)
	|			И (НЕ ПлатежноеПоручение.ПометкаУдаления)
	|			И (НЕ РасходСоСчета.ПометкаУдаления)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.КодБК) Тогда
			Продолжить;
		КонецЕсли;
		
		ВидНалога = Выборка.ВидНалога.ПолучитьОбъект();
		ВидНалога.КодБК = Выборка.КодБК;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВидНалога, Ложь, Ложь);
	КонецЦикла;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВзносСвыше300трВПФР(Параметры) Экспорт
	
	Налог = Справочники.ВидыНалогов.ПФРСвыше300тр.ПолучитьОбъект();
	Налог.Наименование = "Взносы в ПФР при доходах свыше 300 тысяч руб.(ИП)";
	Налог.ВидНалога = Перечисления.ВидыНалогов.ПустаяСсылка();
	Налог.КодБК = "39210202140061200160";
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Налог, Ложь, Ложь);
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодобратьЕдиницуИзмеренияПоБазовойЗаписи(ИсправляющаяЗапись)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидЦен", ИсправляющаяЗапись.ВидЦен.БазовыйВидЦен);
	Отбор.Вставить("Номенклатура", ИсправляющаяЗапись.Номенклатура);
	Отбор.Вставить("Характеристика", ИсправляющаяЗапись.Характеристика);
	
	БазоваяЗапись = РегистрыСведений.ЦеныНоменклатуры.Получить(ИсправляющаяЗапись.Период, Отбор);
	Если ЗначениеЗаполнено(БазоваяЗапись.ЕдиницаИзмерения) Тогда
		
		ИсправляющаяЗапись.ЕдиницаИзмерения = БазоваяЗапись.ЕдиницаИзмерения;
		
	Иначе
		
		ИсправляющаяЗапись.ЕдиницаИзмерения = ИсправляющаяЗапись.Номенклатура.ЕдиницаИзмерения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсправлениеЗаписейОЦенахДинамическихВидовЦен(СтруктураПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 5000
	|	РегистрЦен.Период,
	|	РегистрЦен.ВидЦен,
	|	РегистрЦен.Номенклатура,
	|	РегистрЦен.Характеристика,
	|	РегистрЦен.Цена,
	|	РегистрЦен.Актуальность,
	|	РегистрЦен.ЕдиницаИзмерения,
	|	РегистрЦен.ВключаяХарактеристики,
	|	РегистрЦен.Автор
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК РегистрЦен
	|ГДЕ
	|	РегистрЦен.ЕдиницаИзмерения В (ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка), НЕОПРЕДЕЛЕНО, NULL)";
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	ВсегоЗаписей = ВыборкаЗапроса.Количество();
	Если ВсегоЗаписей = 0 Тогда
		
		СтруктураПараметров.ОбработкаЗавершена = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИсправленоЗаписей = 0;
	Попытка
		
		НачатьТранзакцию();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ИсправляющийНабор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			ИсправляющийНабор.Отбор.Период.Установить(ВыборкаЗапроса.Период);
			ИсправляющийНабор.Отбор.ВидЦен.Установить(ВыборкаЗапроса.ВидЦен);
			ИсправляющийНабор.Отбор.Номенклатура.Установить(ВыборкаЗапроса.Номенклатура);
			ИсправляющийНабор.Отбор.Характеристика.Установить(ВыборкаЗапроса.Характеристика);
			ИсправляющийНабор.Прочитать();
			
			Если ИсправляющийНабор.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ИсправляющаяЗапись = ИсправляющийНабор[0];
			Если ЗначениеЗаполнено(ИсправляющаяЗапись.ЕдиницаИзмерения) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ИсправляющаяЗапись.Цена = ВыборкаЗапроса.Цена;
			ИсправляющаяЗапись.Актуальность = ВыборкаЗапроса.Актуальность;
			ИсправляющаяЗапись.ВключаяХарактеристики = ВыборкаЗапроса.ВключаяХарактеристики;
			ИсправляющаяЗапись.Автор = ВыборкаЗапроса.Автор;
			
			Если ИсправляющаяЗапись.ВидЦен.ТипВидаЦен = Перечисления.ТипыВидовЦен.ДинамическийПроцент Тогда
				
				ПодобратьЕдиницуИзмеренияПоБазовойЗаписи(ИсправляющаяЗапись);
				Если НЕ ЗначениеЗаполнено(ИсправляющаяЗапись.ЕдиницаИзмерения) Тогда
					
					ИсправляющаяЗапись.ЕдиницаИзмерения = ИсправляющаяЗапись.Номенклатура.ЕдиницаИзмерения;
					
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(ИсправляющаяЗапись.Номенклатура)
				И ЗначениеЗаполнено(ИсправляющаяЗапись.Номенклатура.ЕдиницаИзмерения) Тогда
				
				ИсправляющаяЗапись.ЕдиницаИзмерения = ИсправляющаяЗапись.Номенклатура.ЕдиницаИзмерения;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ИсправляющаяЗапись.ЕдиницаИзмерения) Тогда
				
				ИсправляющаяЗапись.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(ИсправляющийНабор, Истина, Ложь, Ложь);
			ИсправленоЗаписей = ИсправленоЗаписей + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = НСтр("ru='Исправление ошибки регистра цен с пустой единицей измерения. "
">"
"Период = %1;"
"Вид цен = %2;"
"Номенклатура = %3;"
"Характеристика = %4';uk='Виправлення помилки регістра цін з порожньою одиницею виміру. "
">"
"Період = %1;"
"Вид цін = %2;"
"Номенклатура = %3;"
"Характеристика = %4'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ВыборкаЗапроса.Период, ВыборкаЗапроса.ВидЦен, ВыборкаЗапроса.Номенклатура, ВыборкаЗапроса.Характеристика);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Если ВсегоЗаписей < 5000
		И ВсегоЗаписей = ИсправленоЗаписей Тогда
		
		СтруктураПараметров.ОбработкаЗавершена = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуПоследнейСинхронизацииСМобильнымПРиложением() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МобильноеПриложение.Ссылка
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|ГДЕ
	|	МобильноеПриложение.ДатаПоследнейСинхронизации = ДАТАВРЕМЯ(0001,01,01,0,0,0)";
	
	Попытка
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ПланОбмена = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
			ПланОбмена.ДатаПоследнейСинхронизации = ТекущаяДата();
			ПланОбмена.Записать();
		КонецЦикла;
	Исключение
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ru='Установка даты синхронизации с мобильным приложением.'", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Функция ПроверитьОчередьЦен()
	
	РезультатПроверки = Новый Структура("МассивСтатическихВидовЦенОчереди, ЕстьОшибкиОчередиЦен", Новый Массив, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Очередь.ВидЦенРасчетный КАК ВидЦен,
	|	Очередь.ВидЦенРасчетный.ТипВидаЦен КАК ТипВидаЦен
	|ИЗ
	|	РегистрСведений.ОчередьРасчетаЦен КАК Очередь
	|ГДЕ
	|	Очередь.ВидЦенРасчетный.ТипВидаЦен = ЗНАЧЕНИЕ(Перечисление.ТипыВидовЦен.Статический)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		РезультатПроверки.ЕстьОшибкиОчередиЦен = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			РезультатПроверки.МассивСтатическихВидовЦенОчереди.Добавить(Выборка.ВидЦен);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

Процедура ОчиститьОчередьРасчетаЦенОтСтатическихВидовЦен() Экспорт
	
	РезультатПроверки = ПроверитьОчередьЦен();
	Если РезультатПроверки.ЕстьОшибкиОчередиЦен Тогда
		
		Для каждого ВидЦен Из РезультатПроверки.МассивСтатическихВидовЦенОчереди Цикл
			
			НаборЗаписейРегистраСведений = РегистрыСведений.ОчередьРасчетаЦен.СоздатьНаборЗаписей();
			НаборЗаписейРегистраСведений.Отбор.ВидЦенРасчетный.Установить(ВидЦен, Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейРегистраСведений, Истина, Ложь, Ложь);
			
			Если ВидЦен.ЦеныАктуальны = Ложь Тогда
				
				ОбъектВидЦен = ВидЦен.ПолучитьОбъект();
				ОбъектВидЦен.ЦеныАктуальны = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектВидЦен, Ложь, Ложь);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеЗаказовИзФорм_1_6_7

Процедура ПроверитьОбновитьЗаказПокупателя(Форма, ТекущийОбъект) Экспорт
	
	// Условие аналогично запросу из обработчика ОбновитьВсеЗаказы()
	Если НЕ (НЕ ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд И ТекущийОбъект.ВидЗаказа = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
	
	Если ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
		
		Если ТекущийОбъект.УдалитьЗакрыт Тогда
			СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
			ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПокупателей.Завершен;
			ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
			ТекущийОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
		Иначе
			ТекущийОбъект.Проведен = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе И ТекущийОбъект.УдалитьЗакрыт Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПокупателей.Завершен;
		ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		ТекущийОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
		И (Константы.УдалитьИспользоватьСостоянияЗаказовПокупателей.Получить() Или ТекущийОбъект.УдалитьЗакрыт) Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
		ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	Форма.Прочитать();
	
КонецПроцедуры

Процедура ПроверитьОбновитьЗаказНаряд(Форма, ТекущийОбъект) Экспорт
	
	// Условие аналогично запросу из обработчика ОбновитьВсеЗаказы()
	Если НЕ (ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд И ТекущийОбъект.ВидЗаказа = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	СтатусЗаказа = ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа;
	
	ТекущийОбъект.ВидЗаказа = Справочники.ВидыЗаказНарядов.Основной;
	ТекущийОбъект.СостояниеЗаказа = НайтиСоздатьСостояниеЗаказНаряда(
		ТекущийОбъект.СостояниеЗаказа.Наименование,
		ТекущийОбъект.СостояниеЗаказа.Цвет.Получить(),
		ТекущийОбъект.СостояниеЗаказа.ПометкаУдаления
	);
	Если СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
		
		Если ТекущийОбъект.УдалитьЗакрыт Тогда
			СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
			ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказНарядов.Завершен;
			ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
			ТекущийОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
		Иначе
			ТекущийОбъект.Проведен = Ложь;
		КонецЕсли;
		
	ИначеЕсли СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе И ТекущийОбъект.УдалитьЗакрыт Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказНарядов.Завершен;
		ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		ТекущийОбъект.ПричинаОтмены		= НайтиСоздатьПричинуОтменыЗаказа();
		
	ИначеЕсли СтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
		И (Константы.УдалитьИспользоватьСостоянияЗаказовПокупателей.Получить() Или ТекущийОбъект.УдалитьЗакрыт) Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказНарядов.Завершен;
		ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	Форма.Прочитать();
	
КонецПроцедуры

Процедура ПроверитьОбновитьЗаказПоставщику(Форма, ТекущийОбъект) Экспорт
	
	// Условие аналогично запросу из обработчика ОбновитьВсеЗаказы()
	Если НЕ (ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт И Не ТекущийОбъект.УдалитьЗакрыт И ТекущийОбъект.Проведен
		Или ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт И ТекущийОбъект.УдалитьЗакрыт И НЕ ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен
		Или ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе И ТекущийОбъект.УдалитьЗакрыт И НЕ ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен
		Или ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен И (НЕ Константы.УдалитьИспользоватьСостоянияЗаказовПоставщикам.Получить() Или ТекущийОбъект.УдалитьЗакрыт) И НЕ ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
		
		Если ТекущийОбъект.УдалитьЗакрыт Тогда
			СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
			ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПоставщикам.Завершен;
			ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		Иначе
			ТекущийОбъект.Проведен = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе
		И ТекущийОбъект.УдалитьЗакрыт Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПоставщикам.Завершен;
		ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
		И НЕ (Константы.УдалитьИспользоватьСостоянияЗаказовПоставщикам.Получить() И ТекущийОбъект.УдалитьЗакрыт = Ложь) Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовПоставщикам.Завершен;
		ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Успешно;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	Форма.Прочитать();
	
КонецПроцедуры

Процедура ПроверитьОбновитьЗаказНаПроизводство(Форма, ТекущийОбъект) Экспорт
	
	// Условие аналогично запросу из обработчика ОбновитьВсеЗаказы()
	Если НЕ (ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт И Не ТекущийОбъект.УдалитьЗакрыт И ТекущийОбъект.Проведен
		Или ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт И ТекущийОбъект.УдалитьЗакрыт И НЕ ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен
		Или ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе И ТекущийОбъект.УдалитьЗакрыт И НЕ ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен
		Или ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен И (НЕ Константы.УдалитьИспользоватьСостоянияЗаказовНаПроизводство.Получить() Или ТекущийОбъект.УдалитьЗакрыт) И НЕ ТекущийОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Успешно) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Открыт Тогда
		
		Если ТекущийОбъект.УдалитьЗакрыт Тогда
			СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
			ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовНаПроизводство.Завершен;
			ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		Иначе
			ТекущийОбъект.Проведен = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.ВРаботе
		И ТекущийОбъект.УдалитьЗакрыт Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовНаПроизводство.Завершен;
		ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаказа.УдалитьСтатусЗаказа = Перечисления.УдалитьСтатусыЗаказов.Выполнен
		И НЕ (Константы.УдалитьИспользоватьСостоянияЗаказовНаПроизводство.Получить() И ТекущийОбъект.УдалитьЗакрыт = Ложь) Тогда
		
		СостоянияЗаказов.СохранитьСостояниеЗаказаВИстории(ТекущийОбъект.Ссылка, ТекущийОбъект.СостояниеЗаказа, ТекущийОбъект.Дата);
		ТекущийОбъект.СостояниеЗаказа	= Справочники.СостоянияЗаказовНаПроизводство.Завершен;
		ТекущийОбъект.ВариантЗавершения	= Перечисления.ВариантыЗавершенияЗаказа.Успешно;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	Форма.Прочитать();
	
КонецПроцедуры

Процедура ДобавитьЗадачиОтчетностиНа2017год() Экспорт
	
	Справочники.КалендарьПодготовкиОтчетности.ЗагрузитьКалендарьПодготовкиОтчетности();
	
КонецПроцедуры

Процедура СинхронизироватьКонстантыИспользованияОрганизаций() Экспорт
	
	// Процедура необходима для исправления последствий ошибки, привнесенной в версии 1.6.6.
	// В версиях 1.6.7+ эти последствия не проявляются (удалена константа ФункциональнаяОпцияУчетПоНесколькимОрганизациям)
	// и обработчик не требуется
	
	//ИспользуютсяНесколькоОрганизаций = Константы.ИспользоватьНесколькоОрганизаций.Получить();
	//
	//Если Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям.Получить() <> ИспользуютсяНесколькоОрганизаций Тогда
	//	Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям.Установить(ИспользуютсяНесколькоОрганизаций);
	//КонецЕсли;
	//
	//Если Константы.НеИспользоватьНесколькоОрганизаций.Получить() = ИспользуютсяНесколькоОрганизаций Тогда
	//	Константы.НеИспользоватьНесколькоОрганизаций.Установить(Не ИспользуютсяНесколькоОрганизаций);
	//КонецЕсли;
	ИспользуютсяНесколькоОрганизаций = Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям.Получить();
	
	Если Константы.ИспользоватьНесколькоОрганизаций.Получить() <> ИспользуютсяНесколькоОрганизаций Тогда
		Константы.ИспользоватьНесколькоОрганизаций.Установить(ИспользуютсяНесколькоОрганизаций);
	КонецЕсли;
	
	Если Константы.НеИспользоватьНесколькоОрганизаций.Получить() = ИспользуютсяНесколькоОрганизаций Тогда
		Константы.НеИспользоватьНесколькоОрганизаций.Установить(Не ИспользуютсяНесколькоОрганизаций);
	КонецЕсли;
	
КонецПроцедуры

//(13) Процедура заполняет в ИБ спрвочник "ОбъектПериод планирования".
//
Процедура ЗаполнитьПериодПланированияПервыйЗапуск()
	
	Период = Справочники.ПериодыПланирования.Фактический;
	ОбъектПериод = Период.ПолучитьОбъект();
	ОбъектПериод.Периодичность = Перечисления.Периодичность.Месяц;
	ОбъектПериод.Записать();
	
КонецПроцедуры // ЗаполнитьПериодПланированияПервыйЗапуск()

#КонецОбласти

#Область Обновление_1_6_1_4

Процедура ОбновитьПредопределенныеВидыНалогов() Экспорт
	
	ВидНалога = Справочники.ВидыНалогов.ВзносыФОТ.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.Взносы.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ВоенныйСбор.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ОплатаТруда.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
	ВидНалога = Справочники.ВидыНалогов.ЕСВ.ПолучитьОбъект();
	ВидНалога.СчетУчета = ПланыСчетов.Управленческий.Налоги;
	ВидНалога.СчетУчетаКВозмещению = ПланыСчетов.Управленческий.НалогиКВозмещению;
	ВидНалога.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_6

// Вспомогательная процедура
//
Процедура ЗаписатьПорядокВидаКонтактнойИнформации(Вид, ПорядковыйНомер)
	
	НачатьТранзакцию();
	Попытка
		
		// Блокируем объект от изменения другими сеансами.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыКонтактнойИнформации");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Вид);
		Блокировка.Заблокировать();
		
		ВидОбъект = Вид.ПолучитьОбъект();
		
		// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
		Если ВидОбъект = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		// Обработка объекта.
		ВидОбъект.РеквизитДопУпорядочивания = ПорядковыйНомер;
		
		// Запись обработанного объекта.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбъект);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		// Если не удалось обработать вид контактной информации, пропускаем и обрабатываем позднее.
		ОтменитьТранзакцию();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось установить реквизит доп.упорядочивания для вида контактной информации: %1 по причине:"
"%2';uk='Не вдалося встановити реквізит дод.впорядковування для виду контактної інформації: %1 через:"
"%2'"), 
			Вид, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ВидыКонтактнойИнформации, Вид, ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьРегистрНакопленияПродажи(СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураПараметров.ОбработкаЗавершена = Истина;
	
	// Обработчик устарел начиная с версии 1.6.1.81 и более не используется.
	// Метод требуется для корректного завершения запущенного, но еще не выполненного рег.задания
	// см. ОбновитьРегистрНакопленияПродажиМонопольно()
	
КонецПроцедуры

Процедура ЗаполнитьОстаткиВзаиморасчетовКонтрагентов(СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураПараметров.ОбработкаЗавершена = Истина;
	
	// Обработчик устарел начиная с версии 1.6.1.79 и более не используется.
	// Метод требуется для корректного завершения запущенного, но еще не выполненного рег.задания
	// см. ЗаполнитьОстаткиВзаиморасчетовКонтрагентовМонопольно()
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_18

Процедура ОбновитьВидУчетаСтраховыхВзносов(СтруктураПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Объект.ВидУчетаСтраховыхВзносов = Перечисления.ВидыУчетаСтраховыхВзносов.УчитыватьВУСН;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Ложь, Ложь);
		
	КонецЦикла;
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_26

Процедура УстановитьЗначениеФункциональнойОпции(ЗначениеОпции, ИмяКонстантыХранения, ПервыйВходВыполненРаннее)
	
	Если ПервыйВходВыполненРаннее Тогда
		
		Константы[ИмяКонстантыХранения].Установить(ЗначениеОпции);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_77

Процедура УстановитьФлагВестиУчетРасчетовСБанкомЭквайрером() Экспорт
	
	Если Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Получить() И
		НЕ Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Получить() Тогда
		
		Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Установить(Истина);
		
	КонецЕсли;
	
	Константы.ФункциональнаяОпцияИспользоватьОплатуКартамиВОптовойТорговле.Установить(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_79

Процедура ЗаполнитьОстаткиВзаиморасчетовКонтрагентовМонопольно() Экспорт
	
	НаборЗаписей = РегистрыСведений.ОстаткиВзаиморасчетов.СоздатьНаборЗаписей();
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ втОстатки
		|ИЗ
		|	РегистрНакопления.РасчетыСПокупателями.Остатки КАК РасчетыСПокупателямиОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасчетыСПоставщикамиОстатки.Контрагент,
		|	-РасчетыСПоставщикамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки КАК РасчетыСПоставщикамиОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасчетыСПрочимиКонтрагентамиОстатки.Контрагент,
		|	РасчетыСПрочимиКонтрагентамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки КАК РасчетыСПрочимиКонтрагентамиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОстатки.Контрагент КАК Контрагент,
		|	СУММА(втОстатки.Сумма) КАК Сумма
		|ИЗ
		|	втОстатки КАК втОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	втОстатки.Контрагент
		|
		|ИМЕЮЩИЕ
		|	СУММА(втОстатки.Сумма) <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ОстаткиВзаиморасчетов.СоздатьНаборЗаписей();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			Попытка
				
				// Блокируем объект от изменения другими сеансами.
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОстаткиВзаиморасчетов");
				ЭлементБлокировки.УстановитьЗначение("Контрагент", Выборка.Контрагент);
				Блокировка.Заблокировать();
				
				// Прочитаем набор записей.
				НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
					Запись = НаборЗаписей.Добавить();
				Иначе
					Запись = НаборЗаписей[0];
				КонецЕсли;
				
				// Заполним данные
				Запись.Контрагент = Выборка.Контрагент;
				Запись.Сумма = Выборка.Сумма;
				
				// Запишем набор записей.
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь, Ложь);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не удалось зарегистировать остатки взаиморасчетов по контрагенту: %1 в регистре сведений ОстаткиВзаиморасчетов, по причине:"
"%2';uk='Не вдалося зареєструвати залишки взаєморозрахунків по контрагенту: %1 у регістрі відомостей ОстаткиВзаиморасчетов, через:"
"%2'"), 
						Выборка.Контрагент, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
					Метаданные.РегистрыСведений.ОстаткиВзаиморасчетов, Выборка.Контрагент, ТекстСообщения);
					
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_84

Процедура ОбновитьРегистрНакопленияПродажиМонопольно() Экспорт
	
	Типы = Новый Массив();
	Типы.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	Типы.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	Типы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	Типы.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	Типы.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
	Типы.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	Типы.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	ТипыДокументовСКонтрагентами = Новый ОписаниеТипов(Типы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Продажи.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Продажи.Документ ССЫЛКА Документ.АктВыполненныхРабот
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.АктВыполненныхРабот).Контрагент <> Продажи.Контрагент
		|			КОГДА Продажи.Документ ССЫЛКА Документ.ЗаказПокупателя
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.ЗаказПокупателя).Контрагент <> Продажи.Контрагент
		|			КОГДА Продажи.Документ ССЫЛКА Документ.ОтчетКомиссионера
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.ОтчетКомиссионера).Контрагент <> Продажи.Контрагент
		|			КОГДА Продажи.Документ ССЫЛКА Документ.ОтчетКомитенту
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.ОтчетКомитенту).Контрагент <> Продажи.Контрагент
		|			КОГДА Продажи.Документ ССЫЛКА Документ.ОтчетОПереработке
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.ОтчетОПереработке).Контрагент <> Продажи.Контрагент
		|			КОГДА Продажи.Документ ССЫЛКА Документ.ПриходнаяНакладная
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.ПриходнаяНакладная).Контрагент <> Продажи.Контрагент
		|			КОГДА Продажи.Документ ССЫЛКА Документ.РасходнаяНакладная
		|				ТОГДА ВЫРАЗИТЬ(Продажи.Документ КАК Документ.РасходнаяНакладная).Контрагент <> Продажи.Контрагент
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			НадоЗаписать = Ложь;
			Для Каждого Движение Из НаборЗаписей Цикл
				
				Если ТипыДокументовСКонтрагентами.СодержитТип(ТипЗнч(Движение.Документ))
						И ЗначениеЗаполнено(Движение.Документ) Тогда
					
					Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Документ, "Контрагент");
					Если Движение.Контрагент <> Контрагент Тогда
						НадоЗаписать = Истина;
						Движение.Контрагент = Контрагент;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НадоЗаписать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_1_86

Процедура УдалениеДублейДвиженийПоРегиструЗапасы(СтруктураПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	Запасы.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|ГДЕ
		|	(Запасы.Регистратор ССЫЛКА Документ.ЧекККМ
		|			ИЛИ Запасы.Регистратор ССЫЛКА Документ.ЧекККМВозврат)
		|	И (Запасы.Регистратор.КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Закрыта)
		|			ИЛИ Запасы.Регистратор.КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.ЗакрытаЧекиЗаархивированы))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Записать(Истина);
		
		Исключение
			
			ТекстСообщения = СтрШаблон(
			НСтр("ru='Не удалось удалить движения по регистру ""Запасы"" у документа ""%1"" по причине:"
"%2';uk='Не вдалося видалити рухи по регістру ""Запаси"" у документу ""%1"" з причини:"
"%2'"), 
			Выборка.Регистратор, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				?(ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЧекККМ"), Метаданные.Документы.ЧекККМ, Метаданные.Документы.ЧекККМВозврат),
				Выборка.Регистратор,
				ТекстСообщения
			);
			
		КонецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_2_2

Процедура ЗаполнитьПризнакАлкогольнойПродуции(СтруктураПараметров = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
	|	И НЕ Номенклатура.АлкогольнаяПродукция";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.Номенклатура");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Если объект ранее был удален, пропускаем его.
			Если СправочникОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			СправочникОбъект.АлкогольнаяПродукция = Истина;
			
			// Запись обработанного объекта.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			СтруктураПараметров.ОбработкаЗавершена = Истина;
			
			ОтменитьТранзакцию();
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось выполнить установку признака алкогольной продукции для номенклатуры: ';uk='Не удалось выполнить установку признака алкогольной продукции для номенклатуры: '"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
	КонецЦикла;
	
	СтруктураПараметров.ОбработкаЗавершена = Выборка.Количество() < 1000;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_2_18

Процедура ЗагрузитьКБКЗа2016(СтруктураПараметров = Неопределено) Экспорт
	ОбновлениеИнформационнойБазыУНФ.ЗагрузитьЗначенияКБК(СтруктураПараметров);
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_3_4

Процедура ЗаполнитьНаименованияДляПечатиХарактеристикНоменклатуры(СтруктураПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ХарактеристикиНоменклатуры.Ссылка,
	|	ХарактеристикиНоменклатуры.Наименование
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	(ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.НаименованиеДляПечати КАК СТРОКА(1))) = """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураПараметров.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ХарактеристикаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ХарактеристикаОбъект.НаименованиеДляПечати = ХарактеристикаОбъект.Наименование;
			ХарактеристикаОбъект.Записать();
			
		Исключение
			
			ЕстьОшибки = Истина;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Не удалось заполнить наименование для печати для характеристики %1: %2';uk='Не вдалося заповнити найменування для друку для характеристики %1: %2'"),
				Выборка.Наименование,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ХарактеристикиНоменклатуры,
				Выборка.Ссылка,
				ТекстСообщения
			);
			
			ВызватьИсключение ТекстСообщения;
			
		КонецПопытки;
		
	КонецЦикла;
	
	СтруктураПараметров.ОбработкаЗавершена = НЕ ЕстьОшибки И Выборка.Количество() < 1000;
	
КонецПроцедуры

Процедура СоздатьШаблоныНаименованийДляКатегорийНоменклатуры(СтруктураПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка,
	|	КатегорииНоменклатуры.Наименование,
	|	КатегорииНоменклатуры.НаборСвойств,
	|	КатегорииНоменклатуры.НаборСвойствХарактеристики
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	НЕ КатегорииНоменклатуры.ЭтоГруппа";
	
	ЕстьОшибки = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ШаблоныКатегории = Справочники.ШаблоныНаименований.Выбрать(, Выборка.Ссылка);
		Если ШаблоныКатегории.Следующий() Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			
			ШаблоныНаименований.СоздатьШаблоныПоУмолчанию(Выборка.Ссылка);
			ШаблоныНаименований.СоздатьШаблоныПоУмолчаниюДляНабораСвойств(Выборка.Ссылка, Выборка.НаборСвойств, Ложь);
			ШаблоныНаименований.СоздатьШаблоныПоУмолчаниюДляНабораСвойств(Выборка.Ссылка, Выборка.НаборСвойствХарактеристики, Истина);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ЕстьОшибки = Истина;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Не удалось создать шаблоны наименований для категории %1: %2';uk='Не вдалося створити шаблони найменувань для категорії %1: %2'"),
				Выборка.Наименование,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.КатегорииНоменклатуры,
				Выборка.Ссылка,
				ТекстСообщения
			);
			
			ВызватьИсключение ТекстСообщения;
			
		КонецПопытки;
		
	КонецЦикла;
	
	СтруктураПараметров.ОбработкаЗавершена = НЕ ЕстьОшибки;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_3_5

Процедура ИзменитьРасписаниеОчередиЦен() Экспорт
	
	ЦенообразованиеСервер.ИзменитьРасписаниеОчередиЦен();
	
КонецПроцедуры

Процедура ЗагрузитьКБКТорговыйСбор(СтруктураПараметров = Неопределено) Экспорт
	ОбновлениеИнформационнойБазыУНФ.ЗагрузитьЗначенияКБК(СтруктураПараметров);
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_3_12

Процедура ОбновитьКодыВычетаНДФЛ(СтруктураПараметров = Неопределено) Экспорт
	
	// Получаем коды, которые надо заменить
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВычетыНДФЛ.Ссылка,
	|	ВычетыНДФЛ.Код
	|ИЗ
	|	Справочник.ВычетыНДФЛ КАК ВычетыНДФЛ
	|ГДЕ
	|	(ВычетыНДФЛ.Код = ""114""
	|			ИЛИ ВычетыНДФЛ.Код = ""117""
	|			ИЛИ ВычетыНДФЛ.Код = ""118""
	|			ИЛИ ВычетыНДФЛ.Код = ""121""
	|			ИЛИ ВычетыНДФЛ.Код = ""122""
	|			ИЛИ ВычетыНДФЛ.Код = ""125"")";
	
	МассивВычетов = Новый Массив;
	СоответствиеВычетов = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВычетов.Добавить(Выборка.Ссылка);
		Если СокрЛП(Выборка.Код) = "114" Тогда
			СоответствиеВычетов.Вставить(Выборка.Ссылка, Справочники.ВычетыНДФЛ.Код108);
		ИначеЕсли СокрЛП(Выборка.Код) = "117" Тогда
			СоответствиеВычетов.Вставить(Выборка.Ссылка, Справочники.ВычетыНДФЛ.Код109);
		ИначеЕсли СокрЛП(Выборка.Код) = "118" Тогда
			СоответствиеВычетов.Вставить(Выборка.Ссылка, Справочники.ВычетыНДФЛ.Код110);
		ИначеЕсли СокрЛП(Выборка.Код) = "121" Тогда
			СоответствиеВычетов.Вставить(Выборка.Ссылка, Справочники.ВычетыНДФЛ.Код112);
		ИначеЕсли СокрЛП(Выборка.Код) = "122" Тогда
			СоответствиеВычетов.Вставить(Выборка.Ссылка, Справочники.ВычетыНДФЛ.Код111);
		ИначеЕсли СокрЛП(Выборка.Код) = "125" Тогда
			СоответствиеВычетов.Вставить(Выборка.Ссылка, Справочники.ВычетыНДФЛ.Код113);
		КонецЕсли;
	КонецЦикла;
	
	// Получаем записи в регистрах сведений по этим вычетам:
	Запрос.УстановитьПараметр("МассивВычетов", МассивВычетов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыНаДетей.Период,
	|	НДФЛСтандартныеВычетыНаДетей.Сотрудник,
	|	НДФЛСтандартныеВычетыНаДетей.КодВычета,
	|	НДФЛСтандартныеВычетыНаДетей.ДатаРожденияРебенка,
	|	НДФЛСтандартныеВычетыНаДетей.НомерСтрокиСРебенком,
	|	НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения
	|ИЗ
	|	РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|ГДЕ
	|	НДФЛСтандартныеВычетыНаДетей.КодВычета В(&МассивВычетов)
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачислениеЗарплатыПримененныеВычетыПоНДФЛ.Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты.ПримененныеВычетыПоНДФЛ КАК НачислениеЗарплатыПримененныеВычетыПоНДФЛ
	|ГДЕ
	|	НачислениеЗарплатыПримененныеВычетыПоНДФЛ.КодВычета В(&МассивВычетов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СправкиНДФЛДляПередачиВНалоговыйОрганСведенияОДоходах.Ссылка
	|ИЗ
	|	Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.СведенияОДоходах КАК СправкиНДФЛДляПередачиВНалоговыйОрганСведенияОДоходах
	|ГДЕ
	|	СправкиНДФЛДляПередачиВНалоговыйОрганСведенияОДоходах.КодВычета В(&МассивВычетов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СправкиНДФЛДляПередачиВНалоговыйОрганСведенияОВычетах.Ссылка
	|ИЗ
	|	Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.СведенияОВычетах КАК СправкиНДФЛДляПередачиВНалоговыйОрганСведенияОВычетах
	|ГДЕ
	|	СправкиНДФЛДляПередачиВНалоговыйОрганСведенияОВычетах.КодВычета В(&МассивВычетов)";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	// Вычеты на детей:
	ВыборкаВычетовНаДетей = Пакет[0].Выбрать();
	
	Пока ВыборкаВычетовНаДетей.Следующий() Цикл
		КодНаЗамену = СоответствиеВычетов.Получить(ВыборкаВычетовНаДетей.КодВычета);
		Если КодНаЗамену <> Неопределено Тогда
			НаборЗаписей = РегистрыСведений.НДФЛСтандартныеВычетыНаДетей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сотрудник.Установить(ВыборкаВычетовНаДетей.Сотрудник);
			НаборЗаписей.Отбор.КодВычета.Установить(ВыборкаВычетовНаДетей.КодВычета);
			НаборЗаписей.Отбор.ДатаРожденияРебенка.Установить(ВыборкаВычетовНаДетей.ДатаРожденияРебенка);
			НаборЗаписей.Отбор.НомерСтрокиСРебенком.Установить(ВыборкаВычетовНаДетей.НомерСтрокиСРебенком);
			
			НаборЗаписей.Записать();
			МенеджерЗаписи = РегистрыСведений.НДФЛСтандартныеВычетыНаДетей.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаВычетовНаДетей);
			МенеджерЗаписи.КодВычета = КодНаЗамену;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
	// Начисление зарплаты:
	ВыборкаНачислениеЗарплаты = Пакет[1].Выбрать();
	Пока ВыборкаНачислениеЗарплаты.Следующий() Цикл
		
		НачислениеЗарплатыОбъект = ВыборкаНачислениеЗарплаты.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаСВычетом Из НачислениеЗарплатыОбъект.ПримененныеВычетыПоНДФЛ Цикл
			КодНаЗамену = СоответствиеВычетов.Получить(СтрокаСВычетом.КодВычета);
			Если КодНаЗамену <> Неопределено Тогда
				СтрокаСВычетом.КодВычета = КодНаЗамену;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеЗарплатыОбъект, Ложь, Ложь);
	КонецЦикла;
	
	// Справки 2-НДФЛ:
	ВыборкаСправкиНДФЛДляПередачиВНалоговыйОрган = Пакет[2].Выбрать();
	Пока ВыборкаСправкиНДФЛДляПередачиВНалоговыйОрган.Следующий() Цикл
		
		Справки2НДФЛОбъект = ВыборкаСправкиНДФЛДляПередачиВНалоговыйОрган.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаСВычетом Из Справки2НДФЛОбъект.СведенияОДоходах Цикл
			КодНаЗамену = СоответствиеВычетов.Получить(СтрокаСВычетом.КодВычета);
			Если КодНаЗамену <> Неопределено Тогда
				СтрокаСВычетом.КодВычета = КодНаЗамену;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаСВычетом Из Справки2НДФЛОбъект.СведенияОВычетах Цикл
			КодНаЗамену = СоответствиеВычетов.Получить(СтрокаСВычетом.КодВычета);
			Если КодНаЗамену <> Неопределено Тогда
				СтрокаСВычетом.КодВычета = КодНаЗамену;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Справки2НДФЛОбъект, Ложь, Ложь);
	КонецЦикла;
	
	СтруктураПараметров.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_3_19

Процедура ОтключитьПроверкуКорректностиАдресовОрганизаций() Экспорт
	
	ЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации.ПолучитьОбъект();
	ЮридическийАдрес.МожноИзменятьСпособРедактирования		= Истина;
	ЮридическийАдрес.ЗапретитьРедактированиеПользователем	= Ложь;
	ЮридическийАдрес.АдресТолькоУкраинский					= Ложь;
	ЮридическийАдрес.ПроверятьКорректность					= Ложь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЮридическийАдрес);
	
	ФактическийАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации.ПолучитьОбъект();
	ФактическийАдрес.МожноИзменятьСпособРедактирования		= Истина;
	ФактическийАдрес.ЗапретитьРедактированиеПользователем	= Ложь;
	ФактическийАдрес.АдресТолькоУкраинский					= Ложь;
	ФактическийАдрес.ПроверятьКорректность					= Ложь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФактическийАдрес);
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_4_3

// Выполняется для обновления видов контактной информации для версии БСП 2.3.2
// Для сохранения обратной совместимости всех элементов с видом контактной информации Другое
// свойство МногострочноеПоле устанавливается в Истина.
Процедура ВключитьМногострочноеПолеДляВидовКонтактнойИнформации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Вид
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Другое);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидКонтактнойИнформации = Выборка.Вид.ПолучитьОбъект();
		ВидКонтактнойИнформации.УдалитьМногострочноеПоле = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеБПО(СтруктураПараметров = Неопределено) Экспорт 
	
	ОбработкаЗавершена = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновлениеБиблиотеки();
	//МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьДрайверыВСправочникеПодключаемогоОборудования();
		
	ОбработкаЗавершена = Истина;
	
	СтруктураПараметров.ОбработкаЗавершена = ОбработкаЗавершена;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураПараметров.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_1_6_4_20

Процедура ОчиститьЗначенияДлаЗаполненияРеквизитов(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ЗначенияДляЗаполненияРеквизитов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
