#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = ПланыОбмена.ОбменРозницаУправлениеНебольшойФирмой.ПолучитьМакет("ПодробнаяИнформация");
	
	ПолеHTMLДокумента = Макет.ПолучитьТекст();
	
	Заголовок = НСтр("ru='Информация о синхронизации данных с Розница для Украины 2.0';uk='Інформація про синхронізацію даних з Роздріб для України 2.0'");

КонецПроцедуры

#КонецОбласти
