
&НаКлиенте
Процедура QRВерхПриИзменении(Элемент)
	
	ЗаполнитьТестовыйТабДок();
	
КонецПроцедуры

&НаКлиенте
Процедура QRЛевоПриИзменении(Элемент)
	
	ЗаполнитьТестовыйТабДок();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВосстановитьНастройкиФормы();
	
	ЗаполнитьТестовыйТабДок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТестовыйТабДок()
	
	ОбработкаОбьект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбьект.ПечатьТестовогоQR();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("QRВерх", Объект.QRВерх);
	СтруктураНастроек.Вставить("QRЛево", Объект.QRЛево);

	СохранитьНастройкиФормы(СтруктураНастроек);
	ОповеститьОВыборе(СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормы(СтруктураНастроек)

	ХранилищеНастроекДанныхФорм.Сохранить("1С_ПБ_Печать", "СтруктураНастроек", СтруктураНастроек);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("1С_ПБ_Печать", "СтруктураНастроек");

	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		Для Каждого СтрокаСтр Из СтруктураНастроек Цикл
			ВосстановитьНастройкиИзСтруктуры(СтрокаСтр.Ключ, СтрокаСтр.Значение);
	    КонецЦикла;
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиИзСтруктуры(Ключ, Значение)
	
	Попытка
		Объект[Ключ] = Значение;
	Исключение	
	КонецПопытки;	
	
КонецПроцедуры