#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета = Ложь;
	
	НастройкиВариантов["МониторРасчетовСПокупателями"].Теги = НСТР("ru='Мониторы,Компания,Покупатели,Контрагенты,Долги,Авансы';uk='Монітори,Компанія,Покупці,Контрагенти,Борги,Аванси'");
	НастройкиВариантов["МониторРасчетовСПоставщиками"].Теги = НСТР("ru='Мониторы,Компания,Поставщики,Контрагенты,Долги,Авансы';uk='Монітори,Компанія,Постачальники,Контрагенти,Борги,Аванси'");
	НастройкиВариантов["МониторДенежныеСредства"].Теги = НСТР("ru='Мониторы,Компания,Деньги';uk='Монітори,Компанія,Гроші'");
	НастройкиВариантов["МониторОбщиеПоказатели"].Теги = НСТР("ru='Мониторы,Компания';uk='Монітори,Компанія'");
	НастройкиВариантов["МониторРуководителя"].Теги = НСТР("ru='Мониторы,Компания';uk='Монітори,Компанія'");
	НастройкиВариантов["МониторРуководителяНовый"].Теги = НСТР("ru='Мониторы,Компания';uk='Монітори,Компанія'");
	НастройкиВариантов["МониторПульсБизнеса"].Теги = НСТР("ru='Мониторы,Компания';uk='Монітори,Компанія'");
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;


#КонецЕсли