
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик команды СоздатьНомерГТД
//
Процедура СоздатьНомерГТД(Команда)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СправочникНомераГТДОткрытие");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОткрытьФорму("Справочник.НомераГТД.Форма.ФормаЭлемента");
	
КонецПроцедуры // СоздатьНомерГТД()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура - обработчик события Выбор списка формы
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СправочникНомераГТДОткрытие");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры // СписокВыбор()
