&НаСервере
// Возвращает тип денежных средств
//
Функция ПолучитьТипДенежныхСредств(ДокументСсылка)
	
	Возврат ДокументСсылка.ТипДенежныхСредств;
	
КонецФункции // ПолучитьТипДенежныхСредств()

&НаКлиенте
// Процедура обработки команды.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура("Основание", ПараметрКоманды);
	ТипДенежныхСредств = ПолучитьТипДенежныхСредств(ПараметрКоманды);
	
	Если НЕ ЗначениеЗаполнено(ТипДенежныхСредств) Тогда
		ОткрытьФорму(
		"ОбщаяФорма.ФормаТипыДенежныхСредств",,,,,,
		Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Параметры));
		Возврат;
	КонецЕсли;
	
	ОбработкаКомандыФрагмент(Параметры, ТипДенежныхСредств);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, Параметры) Экспорт
	
	ТипДенежныхСредств = Результат;
	
	ОбработкаКомандыФрагмент(Параметры, ТипДенежныхСредств);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыФрагмент(Параметры, ТипДенежныхСредств)
	
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		ОткрытьФорму("Документ.РасходИзКассы.ФормаОбъекта", Параметры);
	ИначеЕсли ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
		ОткрытьФорму("Документ.РасходСоСчета.ФормаОбъекта", Параметры);
	КонецЕсли;
	
КонецПроцедуры
