
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабличныйДокумент = Документы.ЗаявкаНаВыпускКиЗГИСМ.ПолучитьМакет("ОтчетАнализВыпускаКиЗ");
	//ТабличныйДокумент.Показать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// TODO: удалить пустую область
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// TODO: удалить пустую область
#КонецОбласти

#Область ОбработчикиКомандФормы
// TODO: удалить пустую область
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// TODO: удалить пустую область
#КонецОбласти
