
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СчетЗатрат") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СчетЗатрат) Тогда
			
			Если Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			   И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			   И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
				
				ТекстСообщения = НСтр("ru='Для данного типа счета направление деятельности не указывается!';uk='Для даного типу рахунку напрямок діяльності не вказується!'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(, ТекстСообщения, , , , Отказ);
				
			КонецЕсли;
			
		Иначе
			
			ТекстСообщения = НСтр("ru='Не выбран счет!';uk='Не обраний рахунок!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(, ТекстСообщения, , , , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
