
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметрыПечати = Неопределено;
	ЗаполнитьДополнительныеПараметрыПечати(ДополнительныеПараметрыПечати, ПараметрыВыполненияКоманды);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФормыОбъектаПечати",	ПараметрыВыполненияКоманды.Источник.ИмяФормы);
	ПараметрыФормы.Вставить("ОбъектыОтправки",			ПараметрКоманды);
	Если ДополнительныеПараметрыПечати <> Неопределено Тогда
		ПараметрыФормы.Вставить("ДополнительныеПараметрыПечати", ДополнительныеПараметрыПечати);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборПечатныхФормДляОтправки", ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"ОтправитьПоЭлектроннойПочте",
		ПараметрыВыполненияКоманды.Источник
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеПараметрыПечати(ДополнительныеПараметры, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДокументОткрытия", ПараметрыВыполненияКоманды.Источник.ДокументОткрытия);
	КонецЕсли;
	
КонецПроцедуры
