#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНалоговаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Договор КАК ДоговорКонтрагента,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.СобытияНДСПродаж.РеализацияПокупателю) КАК СобытиеНДС,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	ВложенныйЗапрос.Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		НалоговаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
	|		НалоговаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|		НалоговаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		НалоговаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
	|		ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА НалоговаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА НалоговаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				ИНАЧЕ НалоговаяНакладнаяЗапасы.СуммаНДС * НалоговаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НалоговаяНакладнаяЗапасы.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА НалоговаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА НалоговаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				ИНАЧЕ НалоговаяНакладнаяЗапасы.Всего * НалоговаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НалоговаяНакладнаяЗапасы.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма
	|	ИЗ
	|		Документ.НалоговаяНакладная.Запасы КАК НалоговаяНакладнаяЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							КонстантаВалютаУчета.Значение
	|						ИЗ
	|							Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|			ПО (ИСТИНА)
	|		    ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				    &МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							КонстантаНациональнаяВалюта.Значение
	|						ИЗ
	|							Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|			ПО (ИСТИНА),
	|	     Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|	ГДЕ
	|		НалоговаяНакладнаяЗапасы.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НалоговаяНакладнаяОС.Ссылка.Организация,
	|		НалоговаяНакладнаяОС.Ссылка.Договор,
	|		НалоговаяНакладнаяОС.СтавкаНДС,
	|		НалоговаяНакладнаяОС.Ссылка.Дата,
	|		ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА НалоговаяНакладнаяОС.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА НалоговаяНакладнаяОС.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				ИНАЧЕ НалоговаяНакладнаяОС.СуммаНДС * НалоговаяНакладнаяОС.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НалоговаяНакладнаяОС.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2)),
	|		ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА НалоговаяНакладнаяОС.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА НалоговаяНакладнаяОС.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				ИНАЧЕ НалоговаяНакладнаяОС.Всего * НалоговаяНакладнаяОС.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НалоговаяНакладнаяОС.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))
	|	ИЗ
	|		Документ.НалоговаяНакладная.ОС КАК НалоговаяНакладнаяОС
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							КонстантаВалютаУчета.Значение
	|						ИЗ
	|							Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|			ПО (ИСТИНА)
	|		    ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				    &МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							КонстантаНациональнаяВалюта.Значение
	|						ИЗ
	|							Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|			ПО (ИСТИНА),
	|	    Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|	ГДЕ
	|		НалоговаяНакладнаяОС.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.Период";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНалоговаяНакладная);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаРезультатаЗапроса.Количество() > 0 тогда
		СуммаИзЗапроса = ТаблицаРезультатаЗапроса.Итог("Сумма");
		// сформируем второе движение - подтверждение НДС по оплате.
		СтрокаТаблицы = ТаблицаРезультатаЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,ТаблицаРезультатаЗапроса[0],"Период,ВидДвижения,Организация,ДоговорКонтрагента");
		СтрокаТаблицы.СобытиеНДС = Перечисления.СобытияНДСПродаж.ОплатаПокупателем;
		СтрокаТаблицы.Сумма = СуммаИзЗапроса;
	КонецЕсли;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДСПродаж", ТаблицаРезультатаЗапроса);
	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Функция по СтавкеНДС определяет суффикс имени параметра табличного документа:
// фактически колонкку таблицы налоговой накладной 20%, 0%... где должна отображаться соответствующая сумма
//
Функция ОпределитьКолонкуТаблицы(ВалютаДокумента, СтавкаНДС=Неопределено)
		
	Если СтавкаНДС.Ставка = 0 И НЕ СтавкаНДС.НеОблагается Тогда
		Если ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
			Возврат "0Укр";
		Иначе
			Возврат "0Эксп";
		КонецЕсли;
	ИначеЕсли  СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
		Возврат "20";
	ИначеЕсли СтавкаНДС.Ставка = 7 Тогда
		Возврат "7";	
	Иначе
		Возврат "БезНДС";
	КонецЕсли;
	
КонецФункции // ОпределитьКолонкуТаблицы()

Функция ОпределитьКодСтавки(ИмяКолонки)

	Если ИмяКолонки = "0Эксп" Тогда
		Возврат "901";	
	ИначеЕсли ИмяКолонки = "0Укр" Тогда
		Возврат "902";		
	ИначеЕсли ИмяКолонки = "БезНДС" Тогда
		Возврат "903";		
	ИначеЕсли ИмяКолонки = "7" Тогда
		Возврат "7";	
	Иначе
		Возврат "20";	
	КонецЕсли;	

КонецФункции // ОпределитьКодСтавки()

#Область ИнтерфейсПечати

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Организация.Префикс КАК Префикс,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		Сумма,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество / (1 + НалоговаяНакладная.Запасы.СтавкаНДС.Ставка / 100) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество / (1 + НалоговаяНакладная.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Цена / (1 + НалоговаяНакладная.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма / (1 + НалоговаяНакладная.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма / (1 + НалоговаяНакладная.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения
		|	)
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
			
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная");

		Суффикс = "";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		Для Страница = 1 По 2 Цикл
		
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал"+Суффикс);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия"+Суффикс);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+Суффикс);
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.Номер = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(ТекущийДокумент, Шапка.Префикс);
            КодЯзыкаПечать = "uk";
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
				ИННОрганизации					= "ХХХХХХХХХХХХ";
				НомерСвидетельстваОрганизации	= "ХХХХХХХХХХХХ"	
			Иначе	
				СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
				ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			ОбластьМакета.Параметры.ТелефоныОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			
			ОбластьМакета.Параметры.НомерСвидетельстваОрганизации = НомерСвидетельстваОрганизации;
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			Иначе
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			ОбластьМакета.Параметры.ТелефоныКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);

			НомерСвидетельстваКонтрагента                         = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента) Тогда
				НомерСвидетельстваКонтрагента = "ХХХХХХХХХХХХ";
			КонецЕсли; 
			ОбластьМакета.Параметры.НомерСвидетельстваКонтрагента = НомерСвидетельстваКонтрагента;

			ИННКонтрагента                                        = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента) Тогда
				ИННКонтрагента = "ХХХХХХХХХХХХ";
			КонецЕсли; 
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 

			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка"+Суффикс);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.ТовароТранспортная = Истина Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				//Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				//	ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				//КонецЕсли;
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = ТекущийДокумент.Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				ОбластьМакета.Параметры.СуммаБезСкидки20 	= "Х";
				ОбластьМакета.Параметры.СуммаБезСкидки0Укр 	= "Х";
				ОбластьМакета.Параметры.СуммаБезСкидки0Эксп	= "Х";
				ОбластьМакета.Параметры.СуммаБезСкидкиБезНДС= "Х";
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "СуммаБезСкидки"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
								
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделIИТовТранс");
			ОбластьМакета.Параметры.СуммаБезТранс20 	= "Х";
			ОбластьМакета.Параметры.СуммаБезТранс0Укр 	= "Х";
			ОбластьМакета.Параметры.СуммаБезТранс0Эксп	= "Х";
			ОбластьМакета.Параметры.СуммаБезТрансБезНДС	= "Х";
			ОбластьМакета.Параметры.СуммаТранс20 		= "Х";
			ОбластьМакета.Параметры.СуммаТранс0Укр 		= "Х";
			ОбластьМакета.Параметры.СуммаТранс0Эксп		= "Х";
			ОбластьМакета.Параметры.СуммаТрансБезНДС	= "Х";
			
			Сумма1разд = 0;
			Сумма2разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС, Товаротранспортная", " СуммаБезСкидки, Скидка, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Если СтрокаТаблицы.Товаротранспортная Тогда
					Колонка = "СуммаТранс";
					Сумма2разд = Сумма2разд + Сумма;	
				Иначе
					Колонка = "СуммаБезТранс"; 
					Сумма1разд = Сумма1разд + Сумма;
				КонецЕсли;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел II)
			ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
			// колонка 11 по Товаротранспортным затратам (раздел II)
			ОбластьМакета.Параметры.Сумма2разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма2разд, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			
			СуммаВозвратнойТары = 0;
			
			// Выводим разделы IV...VII (скидки и итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, Скидка, СуммаНДС");		
			
			ИтогСуммаСкидки = 0;
			ИтогСуммаНадбавки = 0;
			ИтогНДС = 0;
			ИтогСуммаБезНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
						
				// Скидки
				СуммаСкидки   = 0;
				СуммаНадбавки = 0;
				Если СтрокаТаблицы.Скидка > 0 Тогда
					  СуммаСкидки	  	= СтрокаТаблицы.Скидка;
					  ИтогСуммаСкидки 	= ИтогСуммаСкидки  + СуммаСкидки;
				ИначеЕсли СтрокаТаблицы.Скидка < 0 Тогда
					  СуммаНадбавки     =  - СтрокаТаблицы.Скидка;
					  ИтогСуммаНадбавки = ИтогСуммаНадбавки + СуммаНадбавки;
				КонецЕсли;
				
				ОбластьМакета.Параметры["СуммаСкидки" 	  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаСкидки, ,"0,00");
				ОбластьМакета.Параметры["СуммаНадбавки"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаНадбавки, ,"0,00");
				
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаБезНДС" + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки - СтрокаТаблицы.Скидка, ,"0,00");
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки - СтрокаТаблицы.Скидка + СтрокаТаблицы.СуммаНДС, ,"0,00");
					
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки, Скидка, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				ИтогСуммаБезНДС = СтрокаТаблицы.СуммаБезСкидки - СтрокаТаблицы.Скидка;
				Всего 			= Всего + ИтогСуммаБезНДС + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.СуммаНадбавки 	= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммаНадбавки, ,"0,00");
			ОбластьМакета.Параметры.СуммаСкидки		= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммаСкидки, ,"0,00");
			ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммаБезНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаБезСкидки);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Скидка);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "СуммаБезСкидки";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 2 Цикл
			
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим область оригинал/копия
				Если Страница = 1 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Оригинал"+Суффикс);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				ИначеЕсли Страница = 2 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия"+Суффикс);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				КонецЕсли;

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+Суффикс);
				
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.Номер = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(ТекущийДокумент, Шапка.Префикс)+"/ЗЦ";

				
				Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// налоговые реквизиты не указыватюся
					СведенияОПродавце   			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
					ИННОрганизации					= "ХХХХХХХХХХХХ";
					НомерСвидетельстваОрганизации	= "ХХХХХХХХХХХХ"	
				Иначе	
					СведенияОПродавце   			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
					ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
					НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
				КонецЕсли;
				ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
				ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
				ОбластьМакета.Параметры.ТелефоныОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);

				ОбластьМакета.Параметры.НомерСвидетельстваОрганизации = НомерСвидетельстваОрганизации;
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// в этом случае контрагентом выступает организация
					СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
				Иначе
					СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
				КонецЕсли; 
				
				ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
				ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
				ОбластьМакета.Параметры.ТелефоныКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);

				НомерСвидетельстваКонтрагента                         = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
				Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента) Тогда
					НомерСвидетельстваКонтрагента = "ХХХХХХХХХХХХ";
				КонецЕсли; 
				ОбластьМакета.Параметры.НомерСвидетельстваКонтрагента = НомерСвидетельстваКонтрагента;

				ИННКонтрагента                                        = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
				Если НЕ ЗначениеЗаполнено(ИННКонтрагента) Тогда
					ИННКонтрагента = "ХХХХХХХХХХХХ";
				КонецЕсли; 
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
				КонецЦикла; 

				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка"+Суффикс);
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				ЭтоПерваяСтрока = Истина;
				// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.ТовароТранспортная = Истина Тогда
						Продолжить
					КонецЕсли;
					
					Если СтрокаТаблицы.СуммаБезСкидки = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если ЭтоПерваяСтрока Тогда	
						// в первой строке раздела укажем номер раздела
						ОбластьМакета.Параметры.НомерРаздела = "I";
						ЭтоПерваяСтрока = Ложь;
					Иначе
						ОбластьМакета.Параметры.НомерРаздела = "";
					КонецЕсли;	
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					
					//Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
					//	ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
					//КонецЕсли;
				
					// дата отгрузки/оплаты
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
						// укажем дату выписки накладной
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = ТекущийДокумент.Дата;
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
					
					// номенклатура с учетом текста дополнения
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены);
					
					ОбластьМакета.Параметры.СуммаБезСкидки20 	= "Х";
					ОбластьМакета.Параметры.СуммаБезСкидки0Укр 	= "Х";
					ОбластьМакета.Параметры.СуммаБезСкидки0Эксп	= "Х";
					ОбластьМакета.Параметры.СуммаБезСкидкиБезНДС= "Х";
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					Колонка = "СуммаБезСкидки"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
						
				КонецЦикла;
				
			
				// Выводми итог по I разделу и раздел II
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделIИТовТранс");
				ОбластьМакета.Параметры.СуммаБезТранс20 	= "Х";
				ОбластьМакета.Параметры.СуммаБезТранс0Укр 	= "Х";
				ОбластьМакета.Параметры.СуммаБезТранс0Эксп	= "Х";
				ОбластьМакета.Параметры.СуммаБезТрансБезНДС	= "Х";
				ОбластьМакета.Параметры.СуммаТранс20 		= "Х";
				ОбластьМакета.Параметры.СуммаТранс0Укр 		= "Х";
				ОбластьМакета.Параметры.СуммаТранс0Эксп		= "Х";
				ОбластьМакета.Параметры.СуммаТрансБезНДС	= "Х";
				
				Сумма1разд = 0;
				Сумма2разд = 0;
				
				// Получим итоговые суммы по товарам и товаротранспортным затратам
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС, Товаротранспортная", " СуммаБезСкидки, СуммаНДС");
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					
					Сумма = СтрокаТаблицы.СуммаБезСкидки; 
					
					Если СтрокаТаблицы.Товаротранспортная Тогда
						Колонка = "СуммаТранс";
						Сумма2разд = Сумма2разд + Сумма;
					Иначе
						Колонка = "СуммаБезТранс"; 
						Сумма1разд = Сумма1разд + Сумма;
					КонецЕсли;
					
					ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
					
				КонецЦикла;	
				
				// колонка 11 по товарам (раздел II)
				ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
				// колонка 11 по Товаротранспортным затратам (раздел II)
				ОбластьМакета.Параметры.Сумма2разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма2разд, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				
				// Выводим раздел III (тара)
				ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				
				// Выводим разделы IV...VII (скидки и итоги)
				ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
				
				ИтогСуммаСкидки = 0;
				ИтогСуммаНадбавки = 0;
				ИтогНДС = 0;
				ИтогСуммаБезНДС = 0;
				Всего = СуммаВозвратнойТары;
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС);
							
					// Скидки
					СуммаСкидки   = 0;
					СуммаНадбавки = 0;
					
					ОбластьМакета.Параметры["СуммаСкидки" 	  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаСкидки, ,"0,00");
					ОбластьМакета.Параметры["СуммаНадбавки"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаНадбавки, ,"0,00");
					
					// Итоги
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
					Если СуффиксКолонки = "БезНДС" Тогда
						// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогСуммаБезНДС" + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
					ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
								
				КонецЦикла;
				
				// Итоги в 11 колонке
				ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки, СуммаНДС");
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					//в таблице не более одной строки
					ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
					ИтогСуммаБезНДС = СтрокаТаблицы.СуммаБезСкидки;
					Всего 			= Всего + ИтогСуммаБезНДС + ИтогНДС;
				КонецЦикла;
				ОбластьМакета.Параметры.СуммаНадбавки 	= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммаНадбавки, ,"0,00");
				ОбластьМакета.Параметры.СуммаСкидки		= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммаСкидки, ,"0,00");
				ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
				ОбластьМакета.Параметры.ИтогСуммаБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогСуммаБезНДС, ,"0,00");
				ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал"+Суффикс);
				ОбластьМакета.Параметры.Заполнить(Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если Страница <> 2 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

Функция ПечатнаяФормаНалоговыйКодекс(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2011";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		Сумма,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество / (1 + НалоговаяНакладная.Запасы.СтавкаНДС.Ставка / 100) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество / (1 + НалоговаяНакладная.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Цена * НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Цена / (1 + НалоговаяНакладная.Запасы.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Цена
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма / (1 + НалоговаяНакладная.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма / (1 + НалоговаяНакладная.ОС.СтавкаНДС.Ставка / 100)
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
		|	НалоговаяНакладная.Организация.Префикс КАК Префикс
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		СимволДляПустыхПоказателей = Константы.СимволПустыхПоказателейВНалоговойНакладной.Получить(); 
		ВыводитьНомерДоговораБезКлеточек = Константы.ВыводитьНомерДоговораБезКлеточек.Получить(); 
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
			
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2011");

		Суффикс = "";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		Для Страница = 1 По 2 Цикл
		
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал"+Суффикс);
				
				ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				
				Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
					
					ОбластьМакета.Параметры.ВыдаетсяПокупателю = "Х";
					
				ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
					
					// т.к. причина лишь превышение над обычной ценой, то первый экземпляр таки должен быть выдан покупателю
					ОбластьМакета.Параметры.ВыдаетсяПокупателю = "Х";
					
				Иначе
					
					// накладная остается у поставщика
					ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
					ОбластьМакета.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
					ОбластьМакета.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия"+Суффикс);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+Суффикс);
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
				ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
			КодЯзыкаПечать = "uk";
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
				ИННОрганизации					= "0";
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
				ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации                                = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Инд = 1;
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				
				ТекСимвол = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				
				Если ТекСимвол = "," Тогда
					// до первой запятой - один телефон
					Прервать;
				КонецЕсли;
				
				Если Найти("0123456789", ТекСимвол) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+Инд] = ТекСимвол;
				Если Инд = 10 Тогда
					Прервать;
				Иначе	
					Инд = Инд + 1;
				КонецЕсли;
			КонецЦикла;
			
		    ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
		    НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			Иначе
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			// телефон
			ТекТелефоныКонтрагента                                = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Инд = 1;
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				
				ТекСимвол = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
				
				Если ТекСимвол = "," Тогда
					// до первой запятой - один телефон
					Прервать;
				КонецЕсли;
				
				Если Найти("0123456789", ТекСимвол) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+Инд] = ТекСимвол;
				Если Инд = 10 Тогда
					Прервать;
				Иначе	
					Инд = Инд + 1;
				КонецЕсли;
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента                         = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
				ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
		    НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ИННКонтрагента                                        = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
				ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
		    ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
			Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
				Для Инд = 1 По 6 Цикл
					ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;
			Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
				ОбластьНомера = ОбластьМакета.Область("НомерДоговора");	
				ОбластьНомера.Объединить();
				ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
			КонецЕсли;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка"+Суффикс);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = ТекущийДокумент.Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
								
			КонецЦикла;
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел II)
			ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим раздел III (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы IV...VII (скидки и итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");		
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
					
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки,СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.СуммаБезСкидки + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 2 Цикл
			
				// Выводим область оригинал/копия
				Если Страница = 1 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Оригинал"+Суффикс);
					
					ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
					
					// накладная остается у поставщика
					ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
					ОбластьМакета.Параметры.ТипПричины1 = "0";
					ОбластьМакета.Параметры.ТипПричины2 = "1";
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
				ИначеЕсли Страница = 2 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия"+Суффикс);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				КонецЕсли;
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+Суффикс);
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
				Для Инд = 1 По 7 Цикл                                                                 
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
				КонецЦикла; 
				
				// филиал/спецрежим
				ТекНомерФилиал = "";
				Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
					ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
				КонецЕсли;
				Для Инд = 1 По 4 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
				КонецЦикла; 
				//ОбластьМакета.Параметры.Номер = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(ТекущийДокумент)+"/ЗЦ";
				
				Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// налоговые реквизиты не указыватюся
					СведенияОПродавце   			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
					ИННОрганизации					= "0";
					НомерСвидетельстваОрганизации	= "0"	
				Иначе	
					СведенияОПродавце   			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
					ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
					НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
				КонецЕсли;
				ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
				ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
				
				// телефон
				ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
				ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
				Инд = 1;
				Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
					
					ТекСимвол = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
					
					Если ТекСимвол = "," Тогда
						// до первой запятой - один телефон
						Прервать;
					КонецЕсли;
					
					Если Найти("0123456789", ТекСимвол) = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьМакета.Параметры["ТелефоныОрганизации_"+Инд] = ТекСимвол;
					Если Инд = 10 Тогда
						Прервать;
					Иначе	
						Инд = Инд + 1;
					КонецЕсли;
				КонецЦикла;
				
			    ИННОрганизации = Прав("            " + ИННОрганизации, 12);
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
			    НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
				Для Инд = 1 По 10 Цикл
					ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
				КонецЦикла; 
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// в этом случае контрагентом выступает организация
					СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
				Иначе
					СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
				КонецЕсли; 
				
				ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
				ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
				// телефон
				ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
				ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
				Инд = 1;
				Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
					
					ТекСимвол = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
					
					Если ТекСимвол = "," Тогда
						// до первой запятой - один телефон
						Прервать;
					КонецЕсли;
					
					Если Найти("0123456789", ТекСимвол) = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьМакета.Параметры["ТелефоныКонтрагента_"+Инд] = ТекСимвол;
					Если Инд = 10 Тогда
						Прервать;
					Иначе	
						Инд = Инд + 1;
					КонецЕсли;
				КонецЦикла;
				
				НомерСвидетельстваКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
					ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
					ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
					НомерСвидетельстваКонтрагента = "0";
				КонецЕсли;
			    НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
				Для Инд = 1 По 10 Цикл
					ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
				КонецЦикла; 
			
				ИННКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
					ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
					ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
					ИННКонтрагента = "0";
				КонецЕсли;
			    ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
				КонецЦикла; 
				
				ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
				Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
					Для Инд = 1 По 6 Цикл
						ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
					КонецЦикла; 
				КонецЕсли;
				Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
					ОбластьНомера = ОбластьМакета.Область("НомерДоговора");	
					ОбластьНомера.Объединить();
					ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
				КонецЕсли;
				
				ТекДатаДоговора = Шапка.ДатаДоговора;
				Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
					ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
					Для Инд = 1 По 8 Цикл
						ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
					КонецЦикла; 
				КонецЕсли;
			
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка"+Суффикс);
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				ЭтоПерваяСтрока = Истина;
				// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если ЭтоПерваяСтрока Тогда	
						// в первой строке раздела укажем номер раздела
						ОбластьМакета.Параметры.НомерРаздела = "I";
						ЭтоПерваяСтрока = Ложь;
					Иначе
						ОбластьМакета.Параметры.НомерРаздела = "";
					КонецЕсли;	
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					
					// дата отгрузки/оплаты
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
						// укажем дату выписки накладной
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = ТекущийДокумент.Дата;
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
					
					// номенклатура с учетом текста дополнения
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены);
					
					ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
						
				КонецЦикла;
				
			
				// Выводми итог по I разделу и раздел II
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
				
				Сумма1разд = 0;
				
				// Получим итоговые суммы по товарам и товаротранспортным затратам
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					
					Сумма = СтрокаТаблицы.СуммаБезСкидки; 
					
					Сумма1разд = Сумма1разд + Сумма;
					
					ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
					
				КонецЦикла;	
				
				// колонка 11 по товарам (раздел II)
				ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Выводим раздел III (тара)
				ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				
				// Выводим разделы IV...VII (скидки и итоги)
				ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
				
				ИтогНДС = 0;
				Всего = СуммаВозвратнойТары;
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС);
							
					// Итоги
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
					Если СуффиксКолонки = "БезНДС" Тогда
						// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
								
				КонецЦикла;
				
				// Итоги в 11 колонке
				ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					//в таблице не более одной строки
					ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
					Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
				КонецЦикла;
				ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
				ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал"+Суффикс);
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если Страница <> 2 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

Функция ПечатнаяФормаНалоговыйКодекс2012(МассивОбъектов, ОбъектыПечати, ИмяМакета = "НалоговаяНакладная2012")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2012";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТекущийДокумент.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина
			  И ТекущийДокумент.ВключенаВЕдиныйРеестрНалоговыхНакладных = Ложь Тогда
		
			Сообщить(СтрШаблон(НСтр("ru='¤1¤ должна быть зарегистрирована в Едином реестре!"
	"Нельзя выдавать покупателю печатный документ до регистрации в Едином реестре!';uk='¤1¤ має бути зареєстрована у Єдиному реєстрі податкових накладних!"
	"Не можна видавати покупцю друкований документ до реєстрації у Єдиному реєстрі!'")
										   , ТекущийДокумент)
				   , СтатусСообщения.ОченьВажное);			
		
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		Сумма,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) / НалоговаяНакладная.Запасы.Количество
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма / НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД 
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
		|	НалоговаяНакладная.Организация.Префикс КАК Префикс,
		|	НалоговаяНакладная.ВалютаДокумента,
		|	НалоговаяНакладная.Курс,
		|	НалоговаяНакладная.Кратность
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		СимволДляПустыхПоказателей = Константы.СимволПустыхПоказателейВНалоговойНакладной.Получить(); 
		ВыводитьНомерДоговораБезКлеточек = Константы.ВыводитьНомерДоговораБезКлеточек.Получить(); 
		ПечататьКодУКТВЭДБезПробелов = Константы.ПечататьКодУКТВЭДБезПробелов.Получить();
		ПечататьДатыБезРазделителей = НЕ Константы.ПечататьДатыВНалоговыхНакладныхСРазделителями.Получить();
		ДополнитьНазваниеНомеромГТД = НЕ Константы.НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах.Получить();
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Сумма,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.Скидка = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Скидка,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаБезСкидки = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезСкидки,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДСПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДСПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2012");
		Если ИмяМакета = "НалоговаяНакладная2012Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2012Альбом");
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		Для Страница = 1 По 2 Цикл
		
			Если  Страница = 2
				И Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// печатаем в одном экземпляре
				Продолжить;
			КонецЕсли;
			
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				
				ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
				
				ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				
				Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
					
					ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
					
				ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
					
					// т.к. причина лишь превышение над обычной ценой, то первый экземпляр таки должен быть выдан покупателю
					ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
					
				Иначе
					
					// накладная остается у поставщика
					ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца = "Х";
					ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
					ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
				
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
				ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
			КонецЕсли;
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла;
			
			КодЯзыкаПечать = "uk";
			
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
				ИННОрганизации					= "300000000000";
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
				ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации                                = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ТекТелефоныОрганизации                                = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла;
			НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			Иначе
				СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			// телефон
			ТекТелефоныКонтрагента                                = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
			ТекТелефоныКонтрагента                                = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента                         = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   			    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
		    НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ИННКонтрагента                                        = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
   			    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
				ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
		    ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		    ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			                                              
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ПечататьКодУКТВЭДБезПробелов Тогда
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				КонецЕсли;
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					Если ПечататьДатыБезРазделителей Тогда
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Формат(ТекущийДокумент.Дата, "ДФ=ddMMyyyy");
					Иначе
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = ТекущийДокумент.Дата;
					КонецЕсли;    
				Иначе
					Если ПечататьДатыБезРазделителей Тогда
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Формат(СтрокаТаблицы.ДатаОтгрузкиОплаты, "ДФ=ddMMyyyy");
					Иначе	
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = СтрокаТаблицы.ДатаОтгрузкиОплаты;
					КонецЕсли; 
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
													 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "");
													 ;
				
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
								
			КонецЦикла;
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары, ,СимволДляПустыхПоказателей);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		    // Выводим разделы III - IV (итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			//ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");		
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					  // п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					  ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					  ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
					
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки,СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.СуммаБезСкидки + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 2 Цикл
				
				Если  Страница = 2
					И Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// печатаем в одном экземпляре
					Продолжить;
				КонецЕсли;
				
				// Выводим область оригинал/копия
				Если Страница = 1 Тогда
					
					ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
					
					ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
					
					// накладная остается у поставщика
					ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
					ОбластьМакета.Параметры.ТипПричины1 = "0";
					ОбластьМакета.Параметры.ТипПричины2 = "1";
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				ИначеЕсли Страница = 2 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
					ТабличныйДокумент.Вывести(ОбластьМакета);
					ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				КонецЕсли;
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				Если ЗначениеЗаполнено(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
					ТекНомер = Прав("       " + СокрЛП(ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.Номер,Истина,Истина)), 7);
				Иначе	
					ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
				КонецЕсли;
				
				Для Инд = 1 По 7 Цикл                                                                 
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
				КонецЦикла; 
				
				// филиал/спецрежим
				ТекНомерФилиал = "";
				Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
					ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
				КонецЕсли;
				Для Инд = 1 По 4 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
				КонецЦикла; 
				
				Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// налоговые реквизиты не указыватюся
					СведенияОПродавце   			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
					ИННОрганизации					= "300000000000";
					НомерСвидетельстваОрганизации	= "0"	
				Иначе	
					СведенияОПродавце   			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
					ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
					НомерСвидетельстваОрганизации 	= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
				КонецЕсли;
				ОбластьМакета.Параметры.НазваниеОрганизации           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
				ОбластьМакета.Параметры.АдресОрганизации              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
				
				// телефон
				ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
				ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
				ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
				Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
					ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				КонецЦикла;
				
				ИННОрганизации = Прав("            " + ИННОрганизации, 12);
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла;
				НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
				Для Инд = 1 По 10 Цикл
					ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
				КонецЦикла; 
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		   			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
					// в этом случае контрагентом выступает организация
					СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
				Иначе
					СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
				КонецЕсли; 
				
				ОбластьМакета.Параметры.НазваниеКонтрагента           = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
				ОбластьМакета.Параметры.АдресКонтрагента              = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
				// телефон
				ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);
				ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
				ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
				Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
					ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
				КонецЦикла;
				
				НомерСвидетельстваКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
				    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
					ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
					ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
					НомерСвидетельстваКонтрагента = "0";
				КонецЕсли;
			    НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
				Для Инд = 1 По 10 Цикл
					ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
				КонецЦикла; 
			
				ИННКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
					ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
					ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
					ИННКонтрагента = "0";
				КонецЕсли;
			    ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
				КонецЦикла; 
				
				ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
				ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
				
				ТекДатаДоговора = Шапка.ДатаДоговора;
				Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
					ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
					Для Инд = 1 По 8 Цикл
						ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
					КонецЦикла; 
				КонецЕсли;
			
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				ЭтоПерваяСтрока = Истина;
				// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если ЭтоПерваяСтрока Тогда	
						// в первой строке раздела укажем номер раздела
						ОбластьМакета.Параметры.НомерРаздела = "I";
						ЭтоПерваяСтрока = Ложь;
					Иначе
						ОбластьМакета.Параметры.НомерРаздела = "";
					КонецЕсли;	
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					
					Если ПечататьКодУКТВЭДБезПробелов Тогда
						ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
					КонецЕсли;
					
					// дата отгрузки/оплаты
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
						// укажем дату выписки накладной
						Если ПечататьДатыБезРазделителей Тогда
							ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Формат(ТекущийДокумент.Дата, "ДФ=ddMMyyyy");
						Иначе
							ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = ТекущийДокумент.Дата;
						КонецЕсли;    
					Иначе
						Если ПечататьДатыБезРазделителей Тогда
							ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Формат(СтрокаТаблицы.ДатаОтгрузкиОплаты, "ДФ=ddMMyyyy");
						Иначе	
							ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = СтрокаТаблицы.ДатаОтгрузкиОплаты;
						КонецЕсли; 
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
					
					// номенклатура с учетом текста дополнения
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
														 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
														 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "")
														 +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены
														 ;
					
					
					ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
					ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
						
				КонецЦикла;
				
			
				// Выводми итог по I разделу и раздел II
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
				
				Сумма1разд = 0;
				
				// Получим итоговые суммы по товарам и товаротранспортным затратам
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					
					Сумма = СтрокаТаблицы.СуммаБезСкидки; 
					
				    Колонка = "Сумма"; 
					Сумма1разд = Сумма1разд + Сумма;
					
					ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
					
				КонецЦикла;	
				
				// колонка 11 по товарам (раздел II)
				ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Выводим раздел III (тара)
				ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары, ,СимволДляПустыхПоказателей);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				
			    // Выводим разделы III..IV
				ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
				
				ИтогНДС = 0;
				Всего = СуммаВозвратнойТары;
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС);
							
					// Итоги
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
					Если СуффиксКолонки = "БезНДС" Тогда
						// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
					ИначеЕсли СуффиксКолонки = "0Укр"
						ИЛИ СуффиксКолонки = "0Эксп" Тогда
						// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
						ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
								
				КонецЦикла;
				
				// Итоги в 11 колонке
				ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					//в таблице не более одной строки
					ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
					Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
				КонецЦикла;
				ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
				ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
					ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если Страница <> 2 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати, ИмяМакета = "НалоговаяНакладная2014")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2014";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрагентНеРезидент = ТекущийДокумент.Контрагент.НеЯвляетсяРезидентом;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		Сумма,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) / НалоговаяНакладная.Запасы.Количество
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма / НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
		|	НалоговаяНакладная.Организация.Префикс КАК ПрефиксОрганизации,
		|	НалоговаяНакладная.ВалютаДокумента,
		|	НалоговаяНакладная.Курс,
		|	НалоговаяНакладная.Кратность,
		|	НалоговаяНакладная.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены,
		|	НалоговаяНакладная.СуммаДокумента,
		|	НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.ЭлектронныйДокумент
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		КодЯзыкаПечать = "uk";
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.ПрефиксОрганизации);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Сумма,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.Скидка = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Скидка,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаБезСкидки = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезСкидки,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДСПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДСПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2014");
		Если ИмяМакета = "НалоговаяНакладная2014Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2014Альбом");
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// определим параметры шапки документа
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		Если ЗначениеЗаполнено(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			ТекНомерОЦ = Прав("       " + СокрЛП(ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены, Истина, Истина)), 7);
		Иначе	
			ТекНомерОЦ = ТекНомер;
		КонецЕсли;
		
		// филиал/спецрежим
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";  //число  4 символа, без лидирующих нулей
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		
		// номер договора
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		
		// дата договора
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
		Иначе
			ТекДатаДоговора = "";
		КонецЕсли;
				
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "300000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				ИННКонтрагента 				  = "400000000000";
			КонецЕсли;
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "400000000000";
			КонецЕсли; 
			
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
		
			Если  Страница = 2 Тогда
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента 
					ИЛИ Шапка.ЭлектронныйДокумент Тогда
					// печатаем в одном экземпляре
					Продолжить;
				КонецЕсли;
				
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				
			КонецЕсли;
			
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Шапка.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
			ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент 							 = Шапка.ЭлектронныйДокумент;
			Если Шапка.ЭлектронныйДокумент = Ложь Тогда
				Если Страница = 2 Тогда
					// копия - всегда остается у продавца
					ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца  = "Х";
					
				Иначе
					
					// оргинал
					Если  Шапка.ТипПричиныНевыдачиПокупателю = 0 ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
						
						// НН, для которой тип причины невыдачи - продажа ниже обычных цен выдается покупателю, вторая пара накладных (собстенно на превышение) - нет
						ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
						
					Иначе
						
						// накладная остается у поставщика
						ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
						ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
						ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим 
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
			
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			// ИНН покупателя
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			                                              
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
			    ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				    // укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Шапка.Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				ТабличныйДокумент.Вывести(ОбластьМакета);
								
			КонецЦикла;
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		    // Выводим разделы III - IV (итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			//ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");		
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					  // п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					  ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					  ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
					
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки,СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.СуммаБезСкидки + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			//ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 2 Цикл
				
				Если  Страница = 2 Тогда
					
					ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
					
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				Если  Страница = 2 Тогда
					// копия - накладная остается у поставщика 
					ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
				Иначе	
					// оригинал, но все копии остаются у поставщика
					ОбластьМакета.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
					ОбластьМакета.Параметры.ТипПричины1 = "0";
					ОбластьМакета.Параметры.ТипПричины2 = "1";
					// безоплатная поставка тип причины - "12"
					Если Шапка.СуммаДокумента = 0 Тогда
						ОбластьМакета.Параметры.ТипПричины1 = "1";
						ОбластьМакета.Параметры.ТипПричины2 = "2";
					КонецЕсли;
				КонецЕсли;	
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				Для Инд = 1 По 7 Цикл                                  
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
				КонецЦикла; 
				
				// спецрежим/филиал
				Для Инд = 1 По 5 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
				КонецЦикла; 
				
				// наименование продавца
				ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
				
				// адрес продавца
				ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
				
				// телефон продавца
				Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
					ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				КонецЦикла;
				
				// ИНН продавца
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				// название покупателя
				ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
				
				// адрес покупателя
				ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
				
				// телефон покупателя
				Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
					ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
				КонецЦикла;
				
				// ИНН покупателя
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
				КонецЦикла; 
				
				// номер договора
				ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
				
				// дата договора
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				ЭтоПерваяСтрока = Истина;
				// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если ЭтоПерваяСтрока Тогда	
						// в первой строке раздела укажем номер раздела
						ОбластьМакета.Параметры.НомерРаздела = "I";
						ЭтоПерваяСтрока = Ложь;
					Иначе
						ОбластьМакета.Параметры.НомерРаздела = "";
					КонецЕсли;	
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
					
					// дата отгрузки/оплаты
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
						
						// укажем дату выписки накладной
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Шапка.Дата;
						
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
					
					// номенклатура с учетом текста дополнения
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
					+" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
						
				КонецЦикла;
				
			
				// Выводми итог по I разделу и раздел II
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
				
				Сумма1разд = 0;
				
				// Получим итоговые суммы по товарам и товаротранспортным затратам
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					
					Сумма = СтрокаТаблицы.СуммаБезСкидки; 
					
				    Колонка = "Сумма"; 
					Сумма1разд = Сумма1разд + Сумма;
					
					ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
					
				КонецЦикла;	
				
				// колонка 11 по товарам (раздел II)
				ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Выводим раздел III (тара)
				ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				
			    // Выводим разделы III..IV
				ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
				
				ИтогНДС = 0;
				Всего = СуммаВозвратнойТары;
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС);
							
					// Итоги
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
					Если СуффиксКолонки = "БезНДС" Тогда
						// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
					ИначеЕсли СуффиксКолонки = "0Укр"
						ИЛИ СуффиксКолонки = "0Эксп" Тогда
						// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
						ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
								
				КонецЦикла;
				
				// Итоги в 11 колонке
				ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					//в таблице не более одной строки
					ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
					Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
				КонецЦикла;
				ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
				ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				//ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
					ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если Страница <> 2 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати, ИмяМакета = "НалоговаяНакладная2014Мес12")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2014Мес12";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрагентНеРезидент = ТекущийДокумент.Контрагент.НеЯвляетсяРезидентом;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		Сумма,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) / НалоговаяНакладная.Запасы.Количество
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма / НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
		|	НалоговаяНакладная.Организация.Префикс КАК ПрефиксОрганизации,
		|	НалоговаяНакладная.ВалютаДокумента,
		|	НалоговаяНакладная.Курс,
		|	НалоговаяНакладная.Кратность,
		|	НалоговаяНакладная.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены,
		|	НалоговаяНакладная.СуммаДокумента,
		|	НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.ПоставкаДипПредставительству,
		|	НалоговаяНакладная.ЭлектронныйДокумент
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		КодЯзыкаПечать = "uk";
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.ПрефиксОрганизации);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Сумма,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.Скидка = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Скидка,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаБезСкидки = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезСкидки,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДСПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДСПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2014Мес12");
		Если ИмяМакета = "НалоговаяНакладная2014Мес12Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2014Мес12Альбом");
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// определим параметры шапки документа
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		Если ЗначениеЗаполнено(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			ТекНомерОЦ = Прав("       " + СокрЛП(ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены, Истина, Истина)), 7);
		Иначе	
			ТекНомерОЦ = ТекНомер;
		КонецЕсли;
		
		// филиал/спецрежим
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";  //число  4 символа, без лидирующих нулей
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		
		// номер договора
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		
		// дата договора
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
		Иначе
			ТекДатаДоговора = "";
		КонецЕсли;
				
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "300000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				ИННКонтрагента 				  = "400000000000";
			КонецЕсли;
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			Если  Шапка.ПоставкаДипПредставительству = Истина 
				И Шапка.ТипПричиныНевыдачиПокупателю <=2 Тогда
				
				ИННКонтрагента = "400000000000";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				// вместо адреса - просто страна нерезидента
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "400000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
			КонецЕсли; 
			
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 2 Цикл
		
			Если  Страница = 2 Тогда
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента 
					ИЛИ Шапка.ЭлектронныйДокумент Тогда
					// печатаем в одном экземпляре
					Продолжить;
				КонецЕсли;
				
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				
			КонецЕсли;
			
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Шапка.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
			ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент 							 = Шапка.ЭлектронныйДокумент;
			Если Шапка.ЭлектронныйДокумент = Ложь Тогда
				Если Страница = 2 Тогда
					// копия - всегда остается у продавца
					ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца  = "Х";
					
				Иначе
					
					// оргинал
					Если  Шапка.ТипПричиныНевыдачиПокупателю = 0 ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
						
						// НН, для которой тип причины невыдачи - продажа ниже обычных цен выдается покупателю, вторая пара накладных (собстенно на превышение) - нет
						ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
						
					Иначе
						
						// накладная остается у поставщика
						ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
						ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
						ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим 
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
			
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			// ИНН покупателя
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			                                              
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
			    ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				    // укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Шапка.Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				ТабличныйДокумент.Вывести(ОбластьМакета);
								
			КонецЦикла;
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		    // Выводим разделы III - IV (итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			//ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");		
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
		    ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "Х";
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ ";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
					
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки,СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.СуммаБезСкидки + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			//ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 2 Цикл
				
				Если  Страница = 2 Тогда
					
					ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
					
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				Если  Страница = 2 Тогда
					// копия - накладная остается у поставщика 
					ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
				Иначе	
					// оригинал, но все копии остаются у поставщика
					ОбластьМакета.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
					ОбластьМакета.Параметры.ТипПричины1 = "0";
					ОбластьМакета.Параметры.ТипПричины2 = "1";
					// безоплатная поставка тип причины - "12"
					Если Шапка.СуммаДокумента = 0 Тогда
						ОбластьМакета.Параметры.ТипПричины1 = "1";
						ОбластьМакета.Параметры.ТипПричины2 = "2";
					КонецЕсли;
				КонецЕсли;	
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				Для Инд = 1 По 7 Цикл                                  
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
				КонецЦикла; 
				
				// спецрежим/филиал
				Для Инд = 1 По 5 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
				КонецЦикла; 
				
				// наименование продавца
				ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
				
				// адрес продавца
				ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
				
				// телефон продавца
				Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
					ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				КонецЦикла;
				
				// ИНН продавца
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				// название покупателя
				ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
				
				// адрес покупателя
				ОбластьМакета.Параметры.АдресКонтрагента    = АдресОрганизации;
				
				// телефон покупателя
				Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
					ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				КонецЦикла;
				
				// ИНН покупателя
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				// номер договора
				ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
				
				// дата договора
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				ЭтоПерваяСтрока = Истина;
				// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если ЭтоПерваяСтрока Тогда	
						// в первой строке раздела укажем номер раздела
						ОбластьМакета.Параметры.НомерРаздела = "I";
						ЭтоПерваяСтрока = Ложь;
					Иначе
						ОбластьМакета.Параметры.НомерРаздела = "";
					КонецЕсли;	
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
					
					// дата отгрузки/оплаты
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
						
						// укажем дату выписки накладной
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Шапка.Дата;
						
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
					
					// номенклатура с учетом текста дополнения
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
					+" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
						
				КонецЦикла;
				
			
				// Выводми итог по I разделу и раздел II
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
				
				Сумма1разд = 0;
				
				// Получим итоговые суммы по товарам и товаротранспортным затратам
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					
					Сумма = СтрокаТаблицы.СуммаБезСкидки; 
					
				    Колонка = "Сумма"; 
					Сумма1разд = Сумма1разд + Сумма;
					
					ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
					
				КонецЦикла;	
				
				// колонка 11 по товарам (раздел II)
				ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Выводим раздел III (тара)
				ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				
			    // Выводим разделы III..IV
				ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
				
				ИтогНДС = 0;
				Всего = СуммаВозвратнойТары;
				
			    ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "Х";
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС);
							
					// Итоги
				    Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
						ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
								
				КонецЦикла;
				
				// Итоги в 11 колонке
				ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					//в таблице не более одной строки
					ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
					Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
				КонецЦикла;
				ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
				ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				//ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
					ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если Страница <> 2 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ()

Функция ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати, ИмяМакета = "НалоговаяНакладная2015")
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2015";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрагентНеРезидент = ТекущийДокумент.Контрагент.НеЯвляетсяРезидентом;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		Сумма,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) / НалоговаяНакладная.Запасы.Количество
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма / НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК СуммаБезСкидки,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
	    |	НалоговаяНакладная.Договор.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции, 
		|	НалоговаяНакладная.Организация.Префикс КАК ПрефиксОрганизации,
		|	НалоговаяНакладная.ВалютаДокумента,
		|	НалоговаяНакладная.Курс,
		|	НалоговаяНакладная.Кратность,
		|	НалоговаяНакладная.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены,
		|	НалоговаяНакладная.СуммаДокумента,
		|	НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.ПоставкаДипПредставительству,
		|	НалоговаяНакладная.ЭлектронныйДокумент
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		КодЯзыкаПечать = "uk";
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.ПрефиксОрганизации);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Сумма,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.Скидка = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Скидка,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаБезСкидки = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаБезСкидки,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДСПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДСПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2015");
		Если ИмяМакета = "НалоговаяНакладная2015Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2015Альбом");
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// определим параметры шапки документа
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		Если ЗначениеЗаполнено(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			ТекНомерОЦ = Прав("       " + СокрЛП(ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены, Истина, Истина)), 7);
		Иначе	
			ТекНомерОЦ = ТекНомер;
		КонецЕсли;
		
		// филиал/спецрежим
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = "";
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		
		// номер договора
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		
		// дата договора
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
		Иначе
			ТекДатаДоговора = "";
		КонецЕсли;
				
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "500000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// остальные данные (телефон) не заполняется
			ТекТелефоныОрганизации = "";
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				ИННКонтрагента 				  = "400000000000";
			КонецЕсли;
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
			Если  Шапка.ПоставкаДипПредставительству = Истина 
				И Шапка.ТипПричиныНевыдачиПокупателю <=2 Тогда
				
				ИННКонтрагента = "400000000000";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				// вместо адреса - просто страна нерезидента
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
			КонецЕсли; 
			
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			ОбластьМакетаЗаголовок.Параметры.СоглашениеОРазделеПродукции = ?(Шапка.СоглашениеОРазделеПродукции = Истина, "Х", "");
			
			Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим 
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
			
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			// ИНН покупателя
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			                                              
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
			    ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				    // укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Шапка.Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				ТабличныйДокумент.Вывести(ОбластьМакета);
								
			КонецЦикла;
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		    // Выводим разделы III - IV (итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			//ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");		
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
		    // в макете жестко прописан крестик, но п. 13 говорит иногда делать в этом поле пометку...
		    ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "";
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
				    // п.13 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
					
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки,СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.СуммаБезСкидки + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 1 Цикл
				
				ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
				
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				
				ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
				
				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				Для Инд = 1 По 7 Цикл                                  
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
				КонецЦикла; 
				
				// спецрежим/филиал
				Для Инд = 1 По 5 Цикл                                                                 
					ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
				КонецЦикла; 
				
				// наименование продавца
				ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
				
				// адрес продавца
				ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
				
				// телефон продавца
				Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
					ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				КонецЦикла;
				
				// ИНН продавца
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
			    // данные покупателя равны данным поставщика
				
				// название покупателя
				ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
				
				// адрес покупателя
				ОбластьМакета.Параметры.АдресКонтрагента    = АдресОрганизации;
				
				// телефон покупателя
				Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
					ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
				КонецЦикла;
				
				// ИНН покупателя
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				// номер договора
				ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
				
				// дата договора
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим шапку накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				ЭтоПерваяСтрока = Истина;
				
				Если ЗначениеЗаполнено(КодСпецРежима) Тогда
					ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
				Иначе
					ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
				КонецЕсли;
				
				ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
				ДопТекст = СтрЗаменить(ДопТекст,
									   "<визначається автоматично>",
									   ПолныйНомерОсновнойНакладной);
				
				// Выведем на печать все строки таблицы в раздел I
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
				    ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
					
					Если ЭтоПерваяСтрока Тогда	
						// в первой строке раздела укажем номер раздела
						ОбластьМакета.Параметры.НомерРаздела = "I";
						ЭтоПерваяСтрока = Ложь;
					Иначе
						ОбластьМакета.Параметры.НомерРаздела = "";
					КонецЕсли;	
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
					
					// дата отгрузки/оплаты
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
						
						// укажем дату выписки накладной
						ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Шапка.Дата;
						
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
					КонецЕсли;
					
					// номенклатура с учетом текста дополнения
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
					+" "+ ДопТекст;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					ОбластьМакета.Параметры[Колонка] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
						
				КонецЦикла;
				
			
				// Выводми итог по I разделу и раздел II
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
				
				Сумма1разд = 0;
				
				// Получим итоговые суммы по товарам и товаротранспортным затратам
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " СуммаБезСкидки, СуммаНДС");
				
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС);
					
					Сумма = СтрокаТаблицы.СуммаБезСкидки; 
					
				    Колонка = "Сумма"; 
					Сумма1разд = Сумма1разд + Сумма;
					
					ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма, ,"0,00");
					
				КонецЦикла;	
				
				// колонка 11 по товарам (раздел I)
				ОбластьМакета.Параметры.Сумма1разд = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма1разд, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Выводим раздел II (тара)
				ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				
			    // Выводим разделы III..IV
				ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
				ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
				
				ИтогНДС = 0;
				Всего = СуммаВозвратнойТары;
			    ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "";
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					СуффиксКолонки = ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента, СтрокаТаблицы.СтавкаНДС);
							
					// Итоги
				    Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
						ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					    // п.13 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
						ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
								
				КонецЦикла;
				
				// Итоги в 11 колонке
				ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					//в таблице не более одной строки
					ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
					Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
				КонецЦикла;
				ОбластьМакета.Параметры.ИтогНДС			= УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС, ,"0,00");
				ОбластьМакета.Параметры.Всего 			= УправлениеНебольшойФирмойСервер.ФорматСумм(Всего, ,"0,00");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла; 
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати, ИмяМакета = "НалоговаяНакладная2016", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2016";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрагентНеРезидент = ТекущийДокумент.Контрагент.НеЯвляетсяРезидентом;
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей = Новый Структура();
			СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
			
			Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
				СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
				СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
			КонецЕсли;
			
			Если ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
				// такие операции не предусматривают выписки налоговых накладных
				Возврат	СтруктураПоказателей;
			КонецЕсли;
			
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма
		|		КОНЕЦ КАК Сумма,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) / НалоговаяНакладная.Запасы.Количество
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма / НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика,
		|		Номенклатура.КодЛьготы
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК Сумма,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
		|	НалоговаяНакладная.Договор.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции,
		|	НалоговаяНакладная.Организация.Префикс КАК ПрефиксОрганизации,
		|	НалоговаяНакладная.ВалютаДокумента,
		|	НалоговаяНакладная.Курс,
		|	НалоговаяНакладная.Кратность,
		|	НалоговаяНакладная.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены,
		|	НалоговаяНакладная.СуммаДокумента,
		|	НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.ПоставкаДипПредставительству,
		|	НалоговаяНакладная.ЭлектронныйДокумент,
		|	НалоговаяНакладная.Сводная,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную.КодПоДРФО КАК ИННКтоВыписалНН
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		КодЯзыкаПечать = "uk";
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.ПрефиксОрганизации);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Сумма,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.Скидка = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Скидка,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДСПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДСПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2016");
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		Если ИмяМакета = "НалоговаяНакладная2016Альбом" Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2016Альбом");
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		КонецЕсли; 
	    Макет.КодЯзыкаМакета = "ru";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// определим параметры шапки документа
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		Если ЗначениеЗаполнено(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			ТекНомерОЦ = Прав("       " + СокрЛП(ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены, Истина, Истина)), 7);
		Иначе	
			ТекНомерОЦ = ТекНомер;
		КонецЕсли;
		
		// филиал/спецрежим
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
			КодСпецРежима = "5";
		КонецЕсли;
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "500000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// остальные данные (телефон) не заполняется
			ТекТелефоныОрганизации = "";
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				Если Шапка.Сводная = Истина Тогда
					ИННКонтрагента 	 = "600000000000";
				Иначе	
					ИННКонтрагента 	 = "400000000000";	
				КонецЕсли;
			КонецЕсли;
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
			Если  Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
				
				ИННКонтрагента = "200000000000";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
			КонецЕсли; 
			
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			Если (    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда
				
				ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
				
			КонецЕсли;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
				
			КонецЕсли;
			
			Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
		
		    // наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
			
			// ИНН покупателя
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
				Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					// данные не заполняются
				ИначеЕсли КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.Сумма20   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС20 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G7", СтрокаТаблицы.Сумма);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.Сумма7   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС7 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G109", СтрокаТаблицы.Сумма);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.Сумма0Укр = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G8", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.Сумма0Эксп = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G10", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ВсегоСумма = 0; ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ВсегоСумма = СтрокаТаблицы.Сумма;
				ИтогНДС    = СтрокаТаблицы.СуммаНДС;
			КонецЦикла;
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.Всего    = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
			ОбластьМакета.Параметры.ИтогНДС  = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС);
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R04G11", ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G11", ИтогНДС);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11", СуммаВозвратнойТары);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// рассчитаем поля для подвала заранее
			ПечЛьготаНДС = "";
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
				ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
				ВремТаблица.Свернуть("КодЛьготы");
				Для каждого СтрокаТаблицы Из ВремТаблица Цикл
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
						ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
						ПечЛьготаНДС = Шапка.ЛьготаНДС;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("H03",		ОбластьМакетаЗаголовок.Параметры.Сводная);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	"");
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	"");
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
				
			КонецЕсли;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = УчетНДССервер.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
				
				ОбластьМакета.Параметры.Сумма     = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					
					Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
						ОбластьМакета.Параметры.КодЛьготы = "99999999";
					КонецЕсли;
					
				Иначе
					
					ОбластьМакета.Параметры.КодЛьготы = "";	
					
				КонецЕсли;
				
				ДанныеОСумме = СтрокаТаблицы.Сумма;
				
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					
					ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					ОбластьМакета.Параметры.Сумма = "";
					
					ДанныеОСумме = 0;
					
				ИначеЕсли Шапка.Сводная = Истина И (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда
					
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
					
					СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					СтрокаСтруктуры.G5 			= ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6 			= ОбластьМакета.Параметры.ЦенаБезНДС;
					
					СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
					СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
					СтрокаСтруктуры.G010  		= ДанныеОСумме;
					
				КонецЕсли;				
							
			КонецЦикла;
		
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			//// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			//ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 1 Цикл
				
				ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					
					ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
					
				КонецЕсли;			
				
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				
				ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
				
				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				Для Инд = 1 По 7 Цикл                                  
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
				КонецЦикла; 
				
				// код спец. режима
				ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
				
				// наименование продавца
				ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
				
				// ИНН продавца
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
			    // данные покупателя равны данным поставщика
				
				// название покупателя
				ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
				
				// ИНН покупателя
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
					
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10S",ОбластьМакетаЗаголовок.Параметры.Освобожденная);
					
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
					
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",	Шапка.Дата);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",	КодСпецРежима);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",	"");
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFBUY",	"");
					
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеОрганизации);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",	ИННОрганизации);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",	ИННОрганизации);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HBOS",	ПечКтоВыписалНалоговуюНакладную);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBOS",	ИННКтоВыписалНН);
					
				КонецЕсли;
				
				// Выводим шапку накладной вместе с итогами
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				
				ВремТаблица = ТаблицаНоменклатуры.Скопировать();
				ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ВремТаблица Цикл
					
					КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
					
					Если КолонкаДляСуммы = "20" Тогда
						
						ОбластьМакета.Параметры.Сумма20   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						ОбластьМакета.Параметры.ИтогНДС20 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G7", СтрокаТаблицы.Сумма);
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "7" Тогда
						
						ОбластьМакета.Параметры.Сумма7   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						ОбластьМакета.Параметры.ИтогНДС7 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G109", СтрокаТаблицы.Сумма);
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "902" Тогда
						
						ОбластьМакета.Параметры.Сумма0Укр = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G8", СтрокаТаблицы.Сумма);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "901" Тогда
						
						ОбластьМакета.Параметры.Сумма0Эксп = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G9", СтрокаТаблицы.Сумма);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "903" Тогда
						
						ОбластьМакета.Параметры.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G10", СтрокаТаблицы.Сумма);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВсегоСумма = 0; ИтогНДС   = 0;
				ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы из ВремТаблица Цикл
					ВсегоСумма = СтрокаТаблицы.Сумма;
					ИтогНДС    = СтрокаТаблицы.СуммаНДС;
				КонецЦикла;
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ИтогНДС  = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС);
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
				ОбластьМакета.Параметры.Всего    = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R04G11", ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G11", ИтогНДС);
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R02G11", СуммаВозвратнойТары);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				Если ЗначениеЗаполнено(КодСпецРежима) Тогда
					ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
				Иначе
					ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
				КонецЕсли;
				
				ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
				ДопТекст = СтрЗаменить(ДопТекст,
									   "<визначається автоматично>",
									   ПолныйНомерОсновнойНакладной);
				
				// Выведем на печать все строки таблицы в раздел I
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
					
					ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
					
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = УчетНДССервер.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
					
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
					
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) +" "+ ДопТекст;
					Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
						ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції" +" "+ ДопТекст;
					КонецЕсли;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
					
					ОбластьМакета.Параметры.Сумма     = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
					
					ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						
						СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
						
						СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
						СтрокаСтруктуры.G4  = ОбластьМакета.Параметры.КодУКТВЭД;
						
						СтрокаСтруктуры.G4S     = ОбластьМакета.Параметры.ЕдиницаИзмерения;
						СтрокаСтруктуры.G105_2S = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
						
						СтрокаСтруктуры.G5 = ОбластьМакета.Параметры.Количество;
						СтрокаСтруктуры.G6 = ОбластьМакета.Параметры.ЦенаБезНДС;
						
						СтрокаСтруктуры.G008  = ОбластьМакета.Параметры.КодСтавки;
						//СтрокаСтруктуры.G009  = ОбластьМакета.Параметры.КодЛьготы;
						СтрокаСтруктуры.G010  = СтрокаТаблицы.Сумма;
						
					КонецЕсли;				
						
				КонецЦикла;
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				// ДРФО того, кто выписал НН
				Для Инд = 1 По 10 Цикл
					ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
				КонецЦикла; 
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
		Возврат ТабличныйДокумент;
		
	КонецЕсли;
	
КонецФункции 

Функция ПечатнаяФормаНалоговыйКодекс2017(МассивОбъектов, ОбъектыПечати, ИмяМакета = "НалоговаяНакладная2017", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НалоговаяНакладная2016";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если УчетНДССервер.ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ТекущийДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрагентНеРезидент = ТекущийДокумент.Контрагент.НеЯвляетсяРезидентом;
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей = Новый Структура();
			СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G32");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G33");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
			СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G011");
			
			Если ТекущийДокумент.ПродажаНижеОбычнойЦены Тогда
				СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
				СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
			КонецЕсли;
			
			Если ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
				// такие операции не предусматривают выписки налоговых накладных
				Возврат	СтруктураПоказателей;
			КонецЕсли;
			
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.УстановитьПараметр("ЕдИзмОС", Справочники.КлассификаторЕдиницИзмерения.шт);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Номер,
		|	НалоговаяНакладная.Дата,
		|	НалоговаяНакладная.Контрагент,
		|	НалоговаяНакладная.Организация,
		|	НалоговаяНакладная.ЛьготаНДС,
		|	НалоговаяНакладная.УсловиеПродажи,
		|	НалоговаяНакладная.ФормаРасчетов,
		|	НалоговаяНакладная.ВидОперации,
		|	НалоговаяНакладная.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
		|	НалоговаяНакладная.Запасы.(
		|		НомерСтроки,
		|		Номенклатура.НаименованиеПолное КАК Номенклатура,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		СтавкаНДС,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма * (НалоговаяНакладная.Запасы.ПроцентСкидкиНаценки / 100)
		|		КОНЕЦ КАК Скидка,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма
		|		КОНЕЦ КАК Сумма,
		|		СуммаНДС,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА (НалоговаяНакладная.Запасы.Сумма - НалоговаяНакладная.Запасы.СуммаНДС) / НалоговаяНакладная.Запасы.Количество
		|			ИНАЧЕ НалоговаяНакладная.Запасы.Сумма / НалоговаяНакладная.Запасы.Количество
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		Номенклатура.ТранспортнаяУслуга КАК ТовароТранспортная,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		Характеристика,
		|		Номенклатура.КодЛьготы,
		|		КодУКТВЭД.Вид КАК КодВид,
		|		КодУКТВЭД.КодСХДеятельности КАК КодСХ
		|	),
		|	НалоговаяНакладная.ОС.(
		|		НомерСтроки,
		|		ОсновноеСредство.Наименование КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК Сумма,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		0 КАК Скидка,
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА НалоговаяНакладная.СуммаВключаетНДС
		|				ТОГДА НалоговаяНакладная.ОС.Сумма - НалоговаяНакладная.ОС.СуммаНДС
		|			ИНАЧЕ НалоговаяНакладная.ОС.Сумма
		|		КОНЕЦ КАК ЦенаБезНДС,
		|		ДатаОтгрузкиОплаты,
		|		СтавкаНДС.Ставка,
		|		ЛОЖЬ КАК ТовароТранспортная,
		|		&ЕдИзмОС КАК ЕдиницаИзмерения,
		|		СуммаПревышения,
		|		СуммаНДСПревышения,
		|		КодУКТВЭД,
		|		НомерГТД,
		|		НомерГТД.Дата КАК ДатаГТД,
		|		КодУКТВЭД.Вид КАК КодВид,
		|		"""" КАК КодСХ
		|	),
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателю,
		|	НалоговаяНакладная.СпецРежимНалогообложения,
		|	НалоговаяНакладная.ВидДоговора,
		|	НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную1,
		|	НалоговаяНакладная.Договор.НомерДоговора КАК НомерДоговора,
		|	НалоговаяНакладная.Договор.ДатаДоговора КАК ДатаДоговора,
		|	НалоговаяНакладная.Договор.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции,
		|	НалоговаяНакладная.Организация.Префикс КАК ПрефиксОрганизации,
		|	НалоговаяНакладная.ВалютаДокумента,
		|	НалоговаяНакладная.Курс,
		|	НалоговаяНакладная.Кратность,
		|	НалоговаяНакладная.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены,
		|	НалоговаяНакладная.СуммаДокумента,
		|	НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
		|	НалоговаяНакладная.ПоставкаДипПредставительству,
		|	НалоговаяНакладная.ЭлектронныйДокумент,
		|	НалоговаяНакладная.Сводная,
		|	НалоговаяНакладная.КтоВыписалНалоговуюНакладную.КодПоДРФО КАК ИННКтоВыписалНН,
		|	НалоговаяНакладная.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		КодЯзыкаПечать = "uk";
		
		Если Шапка.Дата < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.ПрефиксОрганизации);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;
		
		ТаблицаЗапасы = Шапка.Запасы.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаЗапасы.Количество() > 0 тогда
			ТаблицаНоменклатуры = ТаблицаЗапасы.Скопировать();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОС , ТаблицаНоменклатуры);
		Иначе
			ТаблицаНоменклатуры = ТаблицаОС.Скопировать();
		КонецЕсли;
		
		// пересчитаем суммы, если валюта документа отлична от гривны
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		Если Шапка.ВалютаДокумента <> ВалютаУчета Тогда
			
			СтруктураКурсовВалют = УправлениеНебольшойФирмойСервер.ПолучитьКурсыВалют(Шапка.ВалютаДокумента, ВалютаУчета, Шапка.Дата);
			
			Для каждого Строка Из ТаблицаНоменклатуры Цикл
				
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Сумма,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.Скидка = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.Скидка,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.ЦенаБезНДС = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.ЦенаБезНДС,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
																			
				Строка.СуммаНДСПревышения = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(Строка.СуммаНДСПревышения,
																			Шапка.Курс,
																			СтруктураКурсовВалют.Курс,
																			Шапка.Кратность,
																			СтруктураКурсовВалют.Кратность);
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НалоговаяНакладная.ПФ_MXL_НалоговаяНакладная2017Альбом");
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	    Макет.КодЯзыкаМакета = "ru";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
		// определим параметры шапки документа
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(НомерДокумента), 7);
		Если ЗначениеЗаполнено(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			ТекНомерОЦ = Прав("       " + СокрЛП(ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены, Истина, Истина)), 7);
		Иначе	
			ТекНомерОЦ = ТекНомер;
		КонецЕсли;
		
		// филиал/спецрежим
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
			КодСпецРежима = "5";
		КонецЕсли;
		
		////////////////////////////////////////////
		// Продавец
		
		// ИНН, Номер свидетельства, Наименование, Адрес
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= "500000000000";
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			// остальные данные (телефон) не заполняется
			ТекТелефоныОрганизации = "";
			
		Иначе	
			
			СведенияОПродавце   		    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			ИННОрганизации					= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НазваниеОрганизации				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			АдресОрганизации 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			
			ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
			
		КонецЕсли;
		ИННОрганизации 				  = Прав("            " + СокрЛП(ИННОрганизации), 12);
		
		// телефон
		ТекТелефоныОрганизации = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
		
		////////////////////////////////////////////
		// покупатель
		
		// Название, адрес, номер свидетельства, ИНН
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , КодЯзыкаПечать);
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Иначе	
				Если Шапка.Сводная = Истина Тогда
					ИННКонтрагента 	 = "600000000000";
				Иначе	
					ИННКонтрагента 	 = "400000000000";	
				КонецЕсли;
			КонецЕсли;
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
		Иначе
			СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата, , , КодЯзыкаПечать);
			
			НазваниеКонтрагента				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
			АдресКонтрагента 				= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдрес,",  Ложь);
			ИННКонтрагента 				  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			
			ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			
			Если  Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
				
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
				
				ИННКонтрагента = "200000000000";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
				
				// поставка на экспорт
				ИННКонтрагента = "300000000000";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "100000000000";
				НазваниеКонтрагента = "Неплатник";
				АдресКонтрагента = "";
				ТекТелефоныКонтрагента = "";
			КонецЕсли; 
			
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + СокрЛП(ИННКонтрагента), 12);
		
		// телефон
		ТекТелефоныКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
		
		// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
		ПечКтоВыписалНалоговуюНакладную = "";
		ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
		Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
			ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
			+ ". "
			+ ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
			+ ". "
			+ СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
		Иначе
			ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
		КонецЕсли;
		
		Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			Если (    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда
				
				ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
				
			КонецЕсли;
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
				
			КонецЕсли;
			
			Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
			
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
		
		    // наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
			
			// ИНН покупателя
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
				Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					// данные не заполняются
				ИначеЕсли КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.Сумма20   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС20 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G7", СтрокаТаблицы.Сумма);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.Сумма7   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС7 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G109", СтрокаТаблицы.Сумма);
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.Сумма0Укр = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G8", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.Сумма0Эксп = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G10", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ВсегоСумма = 0; ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ВсегоСумма = СтрокаТаблицы.Сумма;
				ИтогНДС    = СтрокаТаблицы.СуммаНДС;
			КонецЦикла;
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.Всего    = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС + ВсегоСумма);
			ОбластьМакета.Параметры.ИтогНДС  = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС);
			ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R04G11", ИтогНДС + ВсегоСумма);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G11", ИтогНДС);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11", СуммаВозвратнойТары);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// рассчитаем поля для подвала заранее
			ПечЛьготаНДС = "";
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
				ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
				ВремТаблица.Свернуть("КодЛьготы");
				Для каждого СтрокаТаблицы Из ВремТаблица Цикл
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
						ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
						ПечЛьготаНДС = Шапка.ЛьготаНДС;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("H03",		ОбластьМакетаЗаголовок.Параметры.Сводная);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	"");
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	"");
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
				
			КонецЕсли;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = УчетНДССервер.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				Если СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодУслуги Тогда
					ОбластьМакета.Параметры.КодДКПП   = ОбластьМакета.Параметры.КодУКТВЭД;	
					ОбластьМакета.Параметры.КодУКТВЭД = "";
				ИначеЕсли СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовараИмпортированного Тогда
					ОбластьМакета.Параметры.Импортированный = "X";
				КонецЕсли;
				Если НЕ КодСпецРежима = "2" Тогда
					ОбластьМакета.Параметры.КодСХ = "";
				КонецЕсли;
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
				
				ОбластьМакета.Параметры.Сумма     = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					
					Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
						ОбластьМакета.Параметры.КодЛьготы = "99999999";
					КонецЕсли;
					
				Иначе
					
					ОбластьМакета.Параметры.КодЛьготы = "";	
					
				КонецЕсли;
				
				ДанныеОСумме = СтрокаТаблицы.Сумма;
				
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
					
					ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.КодДКПП = "";
					ОбластьМакета.Параметры.Импортированный = "";
					ОбластьМакета.Параметры.КодСХ = "";
					ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					ОбластьМакета.Параметры.Сумма = "";
					
					ДанныеОСумме = 0;
					
				ИначеЕсли Шапка.Сводная = Истина И (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС) Тогда
					
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.КодДКПП = "";
					ОбластьМакета.Параметры.Импортированный = "";
					ОбластьМакета.Параметры.КодСХ = "";
					ОбластьМакета.Параметры.Количество = "";
					ОбластьМакета.Параметры.ЦенаБезНДС = "";
					ОбластьМакета.Параметры.КодСтавки = "";
					ОбластьМакета.Параметры.КодЛьготы = "";
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
					
					СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
					СтрокаСтруктуры.G32  		= ОбластьМакета.Параметры.Импортированный;
					СтрокаСтруктуры.G33  		= ОбластьМакета.Параметры.КодДКПП;
					
					СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					СтрокаСтруктуры.G5 			= ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6 			= ОбластьМакета.Параметры.ЦенаБезНДС;
					
					СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
					СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
					СтрокаСтруктуры.G010  		= ДанныеОСумме;
					СтрокаСтруктуры.G011  		= ОбластьМакета.Параметры.КодСХ;
					
				КонецЕсли;				
							
			КонецЦикла;
		
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 

		Если ТекущийДокумент.ПродажаНижеОбычнойЦены 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
			Тогда
			
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				// все что мы напечатали по обычной НН не имеет смысла для этого вида операции
				// нужна только "вторая НН" как если бы это была не сводная накладная на превыешение базы над ценой продажи
				ТабличныйДокумент.Очистить();	
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					Таблица = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
					Таблица.Очистить();
					СтруктураПоказателей.НалоговыйДокумент.Очистить();
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R", Таблица);
					
					СтруктураПоказателйПечатнойФормы = СтруктураПоказателей.НалоговыйДокумент;	
				КонецЕсли;
			Иначе
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателйПечатнойФормы = СтруктураПоказателей.НалоговыйДокументЗЦ;
				КонецЕсли;
			КонецЕсли;			
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
			//удалим лишние колонки
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
			ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
			
			// переименуем колонки
			ТаблицаНоменклатуры.Колонки.СуммаПревышения.Имя 	 = "Сумма";
			ТаблицаНоменклатуры.Колонки.СуммаНДСПревышения.Имя	 = "СуммаНДС";
			
			//// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
			//ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
		
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		    Для Страница = 1 По 1 Цикл
				
				ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
				
				Если (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки) Тогда
					
					ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
					
				КонецЕсли;
				
				Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
					ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					
					ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
					
				КонецЕсли;			
				
				ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				
				ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
				Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
					ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2; ЧВН=");
				КонецЕсли;
				
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
				
				ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
				
				// Выводим отступ
				ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим заголовок накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				//Дата
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
				КонецЦикла; 
				
				// Номер
				Для Инд = 1 По 7 Цикл
					Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
						ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
					Иначе
						ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
					КонецЕсли;
				КонецЦикла; 
				
				// код спец. режима
				ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
				
				// наименование продавца
				ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
				
				// ИНН продавца
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
			    // данные покупателя равны данным поставщика
				
				// название покупателя
				ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
				
				// ИНН покупателя
				Для Инд = 1 По 12 Цикл
					ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
				КонецЦикла; 
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
					
					СтруктураПоказателйПечатнойФормы.Вставить("H03", ОбластьМакетаЗаголовок.Параметры.Сводная);
					
					СтруктураПоказателйПечатнойФормы.Вставить("R03G10S",ОбластьМакетаЗаголовок.Параметры.Освобожденная);
					
					СтруктураПоказателйПечатнойФормы.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
					СтруктураПоказателйПечатнойФормы.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
					
					СтруктураПоказателйПечатнойФормы.Вставить("HFILL",	Шапка.Дата);
					СтруктураПоказателйПечатнойФормы.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
					СтруктураПоказателйПечатнойФормы.Вставить("HNUM1",	КодСпецРежима);
					СтруктураПоказателйПечатнойФормы.Вставить("HNUM2",	"");
					СтруктураПоказателйПечатнойФормы.Вставить("HFBUY",	"");
					
					СтруктураПоказателйПечатнойФормы.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
					СтруктураПоказателйПечатнойФормы.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеОрганизации);
					СтруктураПоказателйПечатнойФормы.Вставить("HKSEL",		ИННОрганизации);
					СтруктураПоказателйПечатнойФормы.Вставить("HKBUY",		ИННОрганизации);
					СтруктураПоказателйПечатнойФормы.Вставить("HBOS",	ПечКтоВыписалНалоговуюНакладную);
					СтруктураПоказателйПечатнойФормы.Вставить("HKBOS",	ИННКтоВыписалНН);
					
				КонецЕсли;
				
				// Выводим шапку накладной вместе с итогами
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				
				ВремТаблица = ТаблицаНоменклатуры.Скопировать();
				ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы Из ВремТаблица Цикл
					
					КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
					
					Если КолонкаДляСуммы = "20" Тогда
						
						ОбластьМакета.Параметры.Сумма20   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						ОбластьМакета.Параметры.ИтогНДС20 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R01G7", СтрокаТаблицы.Сумма);
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "7" Тогда
						
						ОбластьМакета.Параметры.Сумма7   = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						ОбластьМакета.Параметры.ИтогНДС7 = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.СуммаНДС);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R01G109", СтрокаТаблицы.Сумма);
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "902" Тогда
						
						ОбластьМакета.Параметры.Сумма0Укр = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R01G8", СтрокаТаблицы.Сумма);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "901" Тогда
						
						ОбластьМакета.Параметры.Сумма0Эксп = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R01G9", СтрокаТаблицы.Сумма);
						КонецЕсли;
						
					ИначеЕсли КолонкаДляСуммы = "903" Тогда
						
						ОбластьМакета.Параметры.СуммаБезНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма);
						
						Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
							СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R01G10", СтрокаТаблицы.Сумма);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВсегоСумма = 0; ИтогНДС   = 0;
				ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
				Для каждого СтрокаТаблицы из ВремТаблица Цикл
					ВсегоСумма = СтрокаТаблицы.Сумма;
					ИтогНДС    = СтрокаТаблицы.СуммаНДС;
				КонецЦикла;
				
				СуммаВозвратнойТары = 0;
				
				ОбластьМакета.Параметры.ИтогНДС  = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС);
				ОбластьМакета.Параметры.ВозвТара = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаВозвратнойТары);
				ОбластьМакета.Параметры.Всего    = УправлениеНебольшойФирмойСервер.ФорматСумм(ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R04G11", ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
					СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R03G11", ИтогНДС);
					СтруктураПоказателйПечатнойФормы.НалоговыйДокументЗЦ.Вставить("R02G11", СуммаВозвратнойТары);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

				// Выводим табличную часть
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				Если ЗначениеЗаполнено(КодСпецРежима) Тогда
					ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
				Иначе
					ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
				КонецЕсли;
				
				ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
				ДопТекст = СтрЗаменить(ДопТекст,
									   "<визначається автоматично>",
									   ПолныйНомерОсновнойНакладной);
									   
			   Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				   ДопТекст = " (перевищення бази оподаткування, визначеної відповідно до статей 188 і 189 Податкового кодексу України, над фактичною ціною постачання)";	
			   КонецЕсли;
									   
				// Выведем на печать все строки таблицы в раздел I
				Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
					
					Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
						Продолжить
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
						Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
					
					ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
					
					// п 16. 9) не заполняются данные по номенклатуре:
					ОбластьМакета.Параметры.КодУКТВЭД = "";
					ОбластьМакета.Параметры.КодДКПП = "";
					ОбластьМакета.Параметры.Импортированный = "";
					ОбластьМакета.Параметры.КодСХ = "";
					ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
					
					ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) +" "+ ДопТекст;
					Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
						ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції" +" "+ ДопТекст;
					КонецЕсли;
					
					// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
					ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(ТекущийДокумент.ВалютаДокумента,СтрокаТаблицы.СтавкаНДС));
					
					ОбластьМакета.Параметры.Сумма     = УправлениеНебольшойФирмойСервер.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
					
					ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						
						СтрокаСтруктуры = СтруктураПоказателйПечатнойФормы.R.Добавить();
						
						СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
						СтрокаСтруктуры.G4  = ОбластьМакета.Параметры.КодУКТВЭД;
						СтрокаСтруктуры.G32  = ОбластьМакета.Параметры.Импортированный;
						СтрокаСтруктуры.G33  = ОбластьМакета.Параметры.КодДКПП;
						
						СтрокаСтруктуры.G4S     = ОбластьМакета.Параметры.ЕдиницаИзмерения;
						СтрокаСтруктуры.G105_2S = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
						
						СтрокаСтруктуры.G5 = ОбластьМакета.Параметры.Количество;
						СтрокаСтруктуры.G6 = ОбластьМакета.Параметры.ЦенаБезНДС;
						
						СтрокаСтруктуры.G008  = ОбластьМакета.Параметры.КодСтавки;
						//СтрокаСтруктуры.G009  = ОбластьМакета.Параметры.КодЛьготы;
						СтрокаСтруктуры.G010  = СтрокаТаблицы.Сумма;
						СтрокаСтруктуры.G011  = ОбластьМакета.Параметры.КодСХ;
						
					КонецЕсли;				
						
				КонецЦикла;
				
				// Выводим подвал накладной
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				// ДРФО того, кто выписал НН
				Для Инд = 1 По 10 Цикл
					ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
				КонецЦикла; 
				
				ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
				
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТабличныйДокумент);
		
		Возврат ТабличныйДокумент;
		
	КонецЕсли;
	
КонецФункции 

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, 
	
	КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// РегламентированнаяОтчетность
	ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Ложь;
	Если  ТипЗнч(ПараметрыПечати) = Тип("Структура")
		И ПараметрыПечати.Свойство("ТолькоФормироватьСтруктуруПоказателейПечатнойФормы") Тогда
	
		ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина;
	
	КонецЕсли;
	// Конец РегламентированнаяОтчетность
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	ДатаВступленияВСилуПриказа1379 = Константы.ДатаВступленияВСилуПриказа1379.Получить();
	
    ДатаВступленияВСилуПриказа1307 = УчетНДССервер.ДатаВступленияВСилуПриказа1307();	

    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НалоговаяНакладная") Тогда
		
		Если МассивОбъектов[0].Дата >= '20170316' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс2017(МассивОбъектов, ОбъектыПечати, "НалоговаяНакладная2017Альбом", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1307 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати, , ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= '20150101' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= '20141201' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= '20110110' И МассивОбъектов[0].Дата < ДатаВступленияВСилуПриказа1379 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс(МассивОбъектов, ОбъектыПечати));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1379 Тогда
			Если МассивОбъектов[0].Дата >= '20140301' Тогда
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати));
			Иначе	
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФормаНалоговыйКодекс2012(МассивОбъектов, ОбъектыПечати));
			КонецЕсли; 
		ИначеЕсли МассивОбъектов[0].Дата < '20110101' Тогда	
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		Иначе
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладная", "Налоговая накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		КонецЕсли;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НалоговаяНакладнаяАльбом") Тогда
		Если МассивОбъектов[0].Дата >= '20170316' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2017(МассивОбъектов, ОбъектыПечати, "НалоговаяНакладная2017Альбом", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= ДатаВступленияВСилуПриказа1307 Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2016(МассивОбъектов, ОбъектыПечати, "НалоговаяНакладная2016Альбом", ТолькоФормироватьСтруктуруПоказателейПечатнойФормы));
		ИначеЕсли МассивОбъектов[0].Дата >= '20150101' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2015(МассивОбъектов, ОбъектыПечати, "НалоговаяНакладная2015Альбом"));
		ИначеЕсли МассивОбъектов[0].Дата >= '20141201' Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2014Мес12(МассивОбъектов, ОбъектыПечати, "НалоговаяНакладная2014Мес12Альбом"));
		Иначе
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)", ПечатнаяФормаНалоговыйКодекс2014(МассивОбъектов, ОбъектыПечати, "НалоговаяНакладная2014Альбом"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НалоговаяНакладная";
	КомандаПечати.Представление = НСтр("ru='Налоговая накладная';uk='Податкова накладна'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НалоговаяНакладнаяАльбом";
	КомандаПечати.Представление = НСтр("ru='Налоговая накладная (альбом. ориент.)';uk='Податкова накладна (альбом. орієнт.)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.Порядок = 4;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
