#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		//Если ДанныеЗаполнения.Свойство("ПолноеИмяОснования")
		//	И ТипЗнч(ДанныеЗаполнения.ПолноеИмяОснования) = Тип("ПеречислениеСсылка.СобытияРабочегоПроцесса") Тогда
		//	
		//	МетаданныеОснования = Перечисления.СобытияРабочегоПроцесса.СоответствиеСобытияМетаданнымОснования()[ДанныеЗаполнения.ПолноеИмяОснования];
		//	Если МетаданныеОснования <> Неопределено Тогда
		//		ЭтотОбъект.ПолноеИмяОснования = МетаданныеОснования.ПолноеИмя();
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипДействия <> Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьEmail
		И ТипДействия <> Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьSMS Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ШаблонСообщения");
	КонецЕсли;
	
	Если МассивНепроверяемыхРеквизитов.Количество() > 0 Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли