&НаСервере
Процедура СформироватьQR()
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	QRСтрока = "sbumcs" + ";" + АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства + ";" + Пользователь; 
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
	QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	
	Если Найти(АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства, "e1c://") = Истина Тогда
		Элементы.ДекорацияШаг2Заголовок.Заголовок = НСТр("ru='Посетите страницу с описанием настройки синхронизации с мобильным приложением';uk='Відвідайте сторінку з описом налаштування синхронізації з мобільним додатком'");
		Элементы.ДекорацияСсылка.Видимость = Истина;
		Элементы.QRКод.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияШаг2Заголовок.Заголовок = НСТр("ru='После загрузки мобильного приложения используйте этот QR-код для установки соединения';uk='Після завантаження мобільного додатку використайте цей QR-код для встановлення з'єднання'");
		Элементы.ДекорацияСсылка.Видимость = Ложь;
		Элементы.QRКод.Видимость = Истина;
	Конецесли;
		
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ТекПользователь = Пользователи.ТекущийПользователь();
		Если ТекПользователь.Наименование= "<Не указан>" Тогда
			Пользователь = "";
		Иначе
			Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Сценарий = "Директор";
	СформироватьQR();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.ua.smallbusiness";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.ua.smallbusiness";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRiOSНажатие(Элемент)
	
	АдресСтраницы = "https://itunes.apple.com/us/app/1s-upravlenie-nebol-soj-firmoj/id1144434835?mt=8";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаiOSНажатие(Элемент)
	
	АдресСтраницы = "https://itunes.apple.com/us/app/1s-upravlenie-nebol-soj-firmoj/id1144434835?mt=8";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНажатие(Элемент)
	
	АдресСтраницы = "http://sbm.1c.ru/about/nastroyka-mekhanizma-sinkhronizatsii/";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Оповестить("НастройкаМобильногоПриложенияГотово");
	
КонецПроцедуры

