#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	РезервированиеТоваровПоСерийныхНомерах.НомерСтроки КАК НомерСтроки,
	|	РезервированиеТоваровПоСерийныхНомерах.Номенклатура КАК Номенклатура,
	|	РезервированиеТоваровПоСерийныхНомерах.Характеристика КАК Характеристика,
	|	РезервированиеТоваровПоСерийныхНомерах.Партия КАК Партия,
	|	РезервированиеТоваровПоСерийныхНомерах.СерийныйНомер КАК СерийныйНомер,
	|	РезервированиеТоваровПоСерийныхНомерах.Количество КАК КоличествоПередЗаписью,
	|	РезервированиеТоваровПоСерийныхНомерах.Количество КАК КоличествоИзменение,
	|	РезервированиеТоваровПоСерийныхНомерах.Количество КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРезервированиеСерийныхНомеровИзменение
	|ИЗ
	|	РегистрНакопления.гвРезервированиеТоваровПоСерийныхНомерах КАК РезервированиеТоваровПоСерийныхНомерах");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРезервированиеСерийныхНомеровИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли
