#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
	// Если задана связь параметров выбора по значению номенклатуры,
	// то данные выбора получим из справочника "ЕдиницыИзмерения".
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Справочники.ЕдиницыИзмерения.ПолучитьДанныеВыбора(Параметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует дерево классификатора из макета хранимого в конфигурации
Функция ПолучитьДеревоКлассификатора() Экспорт
	
	КлассификаторXML = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование",                             Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("КодЧисловой",                              Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УсловноеОбозначениеНациональное",          Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УсловноеОбозначениеМеждународное",         Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("КодСОЕИ",                                  Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ВесоваяЕдиницаИзмерения",                  Новый ОписаниеТипов("Булево"));
	Для Каждого КлассификаторЗапись Из КлассификаторТаблица Цикл
		
		Если КлассификаторЗапись.Level = "1" Тогда
			СтрокаУровень1 = Дерево.Строки.Добавить();
			НоваяСтрока = СтрокаУровень1;
		ИначеЕсли КлассификаторЗапись.Level = "2" Тогда
			СтрокаУровень2 = СтрокаУровень1.Строки.Добавить();		
			НоваяСтрока = СтрокаУровень2;
		Иначе
			НоваяСтрока = СтрокаУровень2.Строки.Добавить();		
		КонецЕсли;
		
		НоваяСтрока.Наименование                             = КлассификаторЗапись.Name;
		НоваяСтрока.КодЧисловой                              = КлассификаторЗапись.CodeNum;
		НоваяСтрока.УсловноеОбозначениеНациональное          = КлассификаторЗапись.ShortNameN;
		НоваяСтрока.УсловноеОбозначениеМеждународное         = КлассификаторЗапись.ShortNameI;
		НоваяСтрока.КодСОЕИ                                  = КлассификаторЗапись.CodeSOEI;
		
	КонецЦикла;	
	
	Возврат Дерево;

КонецФункции

#КонецОбласти

#КонецЕсли
