
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = Нстр("ru='Серия ';uk='Серія'") + Объект.СерияЛицензионнойКарты + Нстр("ru=' № ';uk=' № '") + Объект.НомерЛицензионнойКарты + Нстр("ru=' от ';uk=' від '") + Формат(Объект.ДатаВыдачиЛицензионнойКарты, "ДФ=dd.MM.yyyy");
	
	Если ЗначениеЗаполнено(Объект.ВладелецЛицензии) Тогда
		
		Объект.Наименование = Объект.Наименование + Нстр("ru='. Владелец: ';uk='. Власник:'") + Объект.ВладелецЛицензии;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СерияЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецЛицензииПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти