
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ДействующийНаДату) Тогда
		
		ДействующийНаДату = Параметры.ДействующийНаДату;
		
		Срез = РегистрыСведений.ПрожиточныйМинимум.СрезПоследних(КонецДня(ДействующийНаДату));
		
		//Список.УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение.Дата= НачалоДня(Срез[0].Период);
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение.Дата = НачалоДня(Срез[0].Период);
		
	КонецЕсли;
КонецПроцедуры
