#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение прожит. минимума на переданную дату
//
Функция МинимумНаДату(Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПрожиточныйМинимумСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ПрожиточныйМинимум.СрезПоследних(&ДатаСреза, ) КАК ПрожиточныйМинимумСрезПоследних");
	Запрос.УстановитьПараметр("ДатаСреза", НачалоГода(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		ВызватьИсключение НСтр("ru='Регистр сведений Прожиточный минимум не заполнен';uk='Регістр відомостей Прожитковий мінімум не заповнений'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли