// Отчет для вызова из обработки ПульсБизнеса

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["СчетаНаОплатуКонтекст"].Вставить("РежимПериода", "ЗаПериод");
	НастройкиВариантов["ЗаказыПокупателейКонтекст"].Вставить("РежимПериода", "ЗаПериод");
	НастройкиВариантов["ЗаказыПоставщикамКонтекст"].Вставить("РежимПериода", "ЗаПериод");
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		
		ОтчетыУНФ.ДобавитьВариантыОформленияСумм(
		ВариантыОформления,
		"Выставлено");
		
	КонецЦикла
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["СчетаНаОплатуКонтекст"].Теги = НСтр("ru='Счета,Контрагенты,Покупатели,Номенклатура,Продажи';uk='Рахунки,Контрагенти,Покупці,Номенклатура,Продажі'");
	НастройкиВариантов["ЗаказыПокупателейКонтекст"].Теги = НСтр("ru='Заказы,Контрагенты,Покупатели,Номенклатура,Продажи';uk='Замовлення,Контрагенти,Покупці,Номенклатура,Продажі'");
	НастройкиВариантов["ЗаказыПоставщикамКонтекст"].Теги = НСтр("ru='Счета,Контрагенты,Поставщики,Номенклатура,Закупки';uk='Рахунки,Контрагенти,Постачальники,Номенклатура,Закупівлі'");
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли