
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("АдресСхемы") ИЛИ НЕ Параметры.Свойство("АдресНастроек") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЗакрыватьПриВыборе = Истина;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемы));
	Компоновщик.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(Параметры.АдресНастроек));
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Идентификатор = Элементы.ДоступныеПоляОтбора.ТекущаяСтрока;
	ОповеститьОВыборе(Строка(Идентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыборДоступныеПоляОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Идентификатор = Элементы.ДоступныеПоляОтбора.ТекущаяСтрока;
	ОповеститьОВыборе(Строка(Идентификатор));
	
КонецПроцедуры

 