
#Область ОписаниеНастроек

Процедура РазделыНастроек(ДеревоРазделов, знач РежимРаботы) Экспорт
	
	Раздел_Компания = ДеревоРазделов.Строки.Добавить();
	Раздел_Компания.Идентификатор = "Компания";
	Раздел_Компания.Представление = НСтр("ru='Компания';uk='Компанія'");
	
	Раздел_CRM = ДеревоРазделов.Строки.Добавить();
	Раздел_CRM.Идентификатор = "CRM";
	Раздел_CRM.Представление = НСтр("ru='CRM';uk='CRM'");
	
	Раздел_Продажи = ДеревоРазделов.Строки.Добавить();
	Раздел_Продажи.Идентификатор = "Продажи";
	Раздел_Продажи.Представление = НСтр("ru='Продажи';uk='Продажі'");
	
	Раздел_Закупки = ДеревоРазделов.Строки.Добавить();
	Раздел_Закупки.Идентификатор = "Закупки";
	Раздел_Закупки.Представление = НСтр("ru='Закупки';uk='Закупівлі'");
	
	Раздел_Работы = ДеревоРазделов.Строки.Добавить();
	Раздел_Работы.Идентификатор = "Работы";
	Раздел_Работы.Представление = НСтр("ru='Работы';uk='Роботи'");
	
	Раздел_Производство = ДеревоРазделов.Строки.Добавить();
	Раздел_Производство.Идентификатор = "Производство";
	Раздел_Производство.Представление = НСтр("ru='Производство';uk='Виробництво'");
	
	Раздел_Деньги = ДеревоРазделов.Строки.Добавить();
	Раздел_Деньги.Идентификатор = "Деньги";
	Раздел_Деньги.Представление = НСтр("ru='Деньги';uk='Гроші'");
	
	Раздел_Зарплата = ДеревоРазделов.Строки.Добавить();
	Раздел_Зарплата.Идентификатор = "Зарплата";
	Раздел_Зарплата.Представление = НСтр("ru='Зарплата';uk='Зарплата'");
	
	Раздел_Персональные = ДеревоРазделов.Строки.Добавить();
	Раздел_Персональные.Идентификатор = "Персональные";
	Раздел_Персональные.Представление = НСтр("ru='Персональные настройки';uk='Персональні налаштування'");
	
	Раздел_ПочтаSMS = Раздел_Персональные.Строки.Добавить();
	Раздел_ПочтаSMS.Идентификатор = "ПочтаSMS";
	Раздел_ПочтаSMS.Представление = НСтр("ru='Почта';uk='Пошта'");
	
	Раздел_ОбменСGoogle = Раздел_Персональные.Строки.Добавить();
	Раздел_ОбменСGoogle.Идентификатор = "ОбменСGoogle";
	Раздел_ОбменСGoogle.Представление = НСтр("ru='Обмен с Google';uk='Обмін з Google'");
	
	Раздел_ПерсональныеПараметрыПечати = Раздел_Персональные.Строки.Добавить();
	Раздел_ПерсональныеПараметрыПечати.Идентификатор = "ПерсональныеПараметрыПечати";
	Раздел_ПерсональныеПараметрыПечати.Представление = НСтр("ru='Параметры печати';uk='Параметри друку'");
	
	Раздел_РаботаСФайлами = Раздел_Персональные.Строки.Добавить();
	Раздел_РаботаСФайлами.Идентификатор = "РаботаСФайлами";
	Раздел_РаботаСФайлами.Представление = НСтр("ru='Работа с файлами';uk='Робота з файлами'");
	
	Раздел_Прочее = Раздел_Персональные.Строки.Добавить();
	Раздел_Прочее.Идентификатор = "Прочее";
	Раздел_Прочее.Представление = НСтр("ru='Прочее';uk='Інше'");
	
	Раздел_Интеграция = ДеревоРазделов.Строки.Добавить();
	Раздел_Интеграция.Идентификатор = "Интеграция";
	Раздел_Интеграция.Представление = НСтр("ru='Интеграция с другими программами';uk='Інтеграція з іншими програмами'");
	
	Раздел_Программы1СПредприятие = Раздел_Интеграция.Строки.Добавить();
	Раздел_Программы1СПредприятие.Идентификатор = "Программы1СПредприятие";
	Раздел_Программы1СПредприятие.Представление = НСтр("ru='Синхронизация с программами 1С:Предприятие';uk='Синхронізація з програмами 1С:Підприємство'");
	
	Раздел_СинхронизацияСМобильнымПриложением = Раздел_Интеграция.Строки.Добавить();
	Раздел_СинхронизацияСМобильнымПриложением.Идентификатор = "СинхронизацияСМобильнымПриложением";
	Раздел_СинхронизацияСМобильнымПриложением.Представление = НСтр("ru='Синхронизация с мобильным приложением';uk='Синхронізація з мобільним додатком'");
	
	Раздел_ОбменССайтом = Раздел_Интеграция.Строки.Добавить();
	Раздел_ОбменССайтом.Идентификатор = "ОбменСЛичнымКабинетом";
	Раздел_ОбменССайтом.Представление = НСтр("ru='Обмен с сайтом Prom.ua';uk='Обмін з сайтом Prom.ua'");
	
	Раздел_ОбменССайтом = Раздел_Интеграция.Строки.Добавить();
	Раздел_ОбменССайтом.Идентификатор = "ОбменССайтом";
	Раздел_ОбменССайтом.Представление = НСтр("ru='Обмен с сайтом';uk='Обмін з сайтом'");
	
	Раздел_Администрирование = ДеревоРазделов.Строки.Добавить();
	Раздел_Администрирование.Идентификатор = "Администрирование";
	Раздел_Администрирование.Представление = НСтр("ru='Администрирование';uk='Адміністрування'");
	
	Раздел_ОбщиеНастройки = Раздел_Администрирование.Строки.Добавить();
	Раздел_ОбщиеНастройки.Идентификатор = "ОбщиеНастройки";
	Раздел_ОбщиеНастройки.Представление = НСтр("ru='Общие настройки';uk='Загальні налаштування'");
	
	Раздел_ПоддержкаИОбслуживание = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПоддержкаИОбслуживание.Идентификатор = "ПоддержкаИОбслуживание";
	Раздел_ПоддержкаИОбслуживание.Представление = НСтр("ru='Поддержка и обслуживание';uk='Підтримка та обслуговування'");
	
	Раздел_ИнтернетПоддержкаПользователей = Раздел_Администрирование.Строки.Добавить();
	Раздел_ИнтернетПоддержкаПользователей.Идентификатор = "ИнтернетПоддержкаПользователей";
	Раздел_ИнтернетПоддержкаПользователей.Представление = НСтр("ru='Интернет-поддержка пользователей';uk='Інтернет-підтримка користувачів'");
	
	Раздел_ПереходМеждуЛокальнымИСервиснымРежимамиРаботы = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПереходМеждуЛокальнымИСервиснымРежимамиРаботы.Идентификатор = "ПереходМеждуЛокальнымИСервиснымРежимамиРаботы";
	Раздел_ПереходМеждуЛокальнымИСервиснымРежимамиРаботы.Представление = НСтр("ru='Работа в сервисе';uk='Робота в сервісі'");
	
	Раздел_ВерсионированиеОбъектов = Раздел_Администрирование.Строки.Добавить();
	Раздел_ВерсионированиеОбъектов.Идентификатор = "ВерсионированиеОбъектов";
	Раздел_ВерсионированиеОбъектов.Представление = НСтр("ru='Версионирование объектов';uk='Версіонування об`єктів'");
	
	Раздел_ДополнительныеРеквизиты = Раздел_Администрирование.Строки.Добавить();
	Раздел_ДополнительныеРеквизиты.Идентификатор = "ДополнительныеРеквизиты";
	Раздел_ДополнительныеРеквизиты.Представление = НСтр("ru='Дополнительные реквизиты';uk='Додаткові реквізити'");
	
	Раздел_КонтактнаяИнформация = Раздел_Администрирование.Строки.Добавить();
	Раздел_КонтактнаяИнформация.Идентификатор = "КонтактнаяИнформация";
	Раздел_КонтактнаяИнформация.Представление = НСтр("ru='Контактная информация';uk='Контактна інформація'");
	
	Раздел_НастройкиПользователейИПрав = Раздел_Администрирование.Строки.Добавить();
	Раздел_НастройкиПользователейИПрав.Идентификатор = "НастройкиПользователейИПрав";
	Раздел_НастройкиПользователейИПрав.Представление = НСтр("ru='Настройки пользователей и прав';uk='Налаштування користувачів і прав'");
	
	Раздел_КорректировкаДанных = Раздел_Администрирование.Строки.Добавить();
	Раздел_КорректировкаДанных.Идентификатор = "КорректировкаДанных";
	Раздел_КорректировкаДанных.Представление = НСтр("ru='Корректировка данных';uk='Коригування даних'");
	
	Раздел_ПечатныеФормыОтчетыОбработки = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПечатныеФормыОтчетыОбработки.Идентификатор = "ПечатныеФормыОтчетыОбработки";
	Раздел_ПечатныеФормыОтчетыОбработки.Представление = НСтр("ru='Печатные формы, отчеты и обработки';uk='Друковані форми, звіти і обробки'");
	
	Раздел_Органайзер = Раздел_Администрирование.Строки.Добавить();
	Раздел_Органайзер.Идентификатор = "Органайзер";
	Раздел_Органайзер.Представление = НСтр("ru='Почта, напоминания';uk='Пошта, нагадування'");
	
	Раздел_НастройкиРаботыСФайлами = Раздел_Администрирование.Строки.Добавить();
	Раздел_НастройкиРаботыСФайлами.Идентификатор = "НастройкиРаботыСФайлами";
	Раздел_НастройкиРаботыСФайлами.Представление = НСтр("ru='Работа с файлами';uk='Робота з файлами'");
	
	Раздел_ПодключаемоеОборудование = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПодключаемоеОборудование.Идентификатор = "ПодключаемоеОборудование";
	Раздел_ПодключаемоеОборудование.Представление = НСтр("ru='Подключаемое оборудование';uk='Підключаєме обладнання'");
	
	Раздел_ОценкаПроизводительностиИЦентрМониторинга = Раздел_Администрирование.Строки.Добавить();
	Раздел_ОценкаПроизводительностиИЦентрМониторинга.Идентификатор = "ОценкаПроизводительностиИЦентрМониторинга";
	Раздел_ОценкаПроизводительностиИЦентрМониторинга.Представление = НСтр("ru='Мониторинг и оценка производительности';uk='Моніторинг та оцінка продуктивності'");
	
	Раздел_РегламентныеОперации = Раздел_Администрирование.Строки.Добавить();
	Раздел_РегламентныеОперации.Идентификатор = "РегламентныеОперации";
	Раздел_РегламентныеОперации.Представление = НСтр("ru='Регламентные операции';uk='Регламентні операції'");
	
КонецПроцедуры

Процедура НастройкиПрограммы(ТаблицаНастроек, знач РежимРаботы) Экспорт
	
	Если Не (СтандартныеПодсистемыСервер.ЭтоМикроВерсияКонфигурации() ИЛИ СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()) Тогда
		
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьНесколькоОрганизаций",
			"Компания",
			НСтр("ru='Несколько организаций';uk='Кілька організацій'"),
			НСтр("ru='В программном продукте предусмотрена возможность ведения учета как по одной организации (предпринимателю без образования юридического лица), так и по двум и более. Если учет по нескольким организациям необходим, то нужно установить эту опцию.';uk='У програмному продукті передбачена можливість ведення обліку як по одній організації (підприємцю без утворення юридичної особи), так і за двома і більше. Якщо облік по декількох організаціях необхідний, то потрібно встановити цю опцію.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"УчетПоКомпании",
			"Компания",
			НСтр("ru='Учет по компании в целом';uk='Облік по компанії в цілому'"),
			НСтр("ru='В программном продукте предусмотрено две схемы учета в случае, когда в учетной системе присутствуют несколько организаций:"
	""
	"• Независимая. Учет ведется обособленно по каждой организации, первичные документы оформляются отдельно по каждой организации. Преимущество такого подхода заключается в использовании общих справочников (объектов аналитики), а также общей информационной базы (вся информация хранится в одном месте). "
	"• По компании. Учет ведется агрегировано, по компании в целом, первичные документы оформляются отдельно по каждой организации. Преимущество такого подхода заключается в использовании общих справочников (объектов аналитики), использовании общей информационной базы (вся информация хранится в одном месте), организации учета по компании (если с точки зрения ведения бизнеса все организации представляют собой единое целое)."
	""
	"ВАЖНО! "
	"Параметр является ключевым. Если ранее осуществлялся учет по компании, переход к ведению учета по отдельным организациям невозможен. Если ранее ведение учета осуществлялось по нескольким организациям, но без агрегирования учетных данных по компании, переход к учету по компании невозможен.';uk='У програмному продукті передбачено дві схеми обліку в разі, коли в обліковій системі присутні кілька організацій:"
	""
	"• Незалежна. Облік ведеться відокремлено по кожній організації, первинні документи оформлюються окремо по кожній організації. Перевага такого підходу полягає у використанні загальних довідників (об`єктів аналітики), а також загальної інформаційної бази (вся інформація зберігається в одному місці)."
	"• За компанією. Облік ведеться агреговано, по компанії в цілому, первинні документи оформлюються окремо по кожній організації. Перевага такого підходу полягає у використанні загальних довідників (об`єктів аналітики), використанні загальної інформаційної бази (вся інформація зберігається в одному місці), організації обліку по компанії (якщо з точки зору ведення бізнесу всі організації являють собою єдине ціле)."
	""
	"ВАЖЛИВО!"
	"Параметр є ключовим. Якщо раніше здійснювався облік по компанії, перехід до ведення обліку по окремим організаціям неможливий. Якщо раніше ведення обліку здійснювалося по декількох організаціях, але без агрегування облікових даних по компанії, перехід до обліку по компанії неможливий.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьНесколькоОрганизаций";
		НоваяНастройка.Зависимости = "ИспользоватьНесколькоОрганизаций";
		
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "Компания";
		НоваяНастройка.Раздел			= "Компания";
		НоваяНастройка.Представление	= НСтр("ru='Компания';uk='Компанія'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.Организации");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьНесколькоОрганизаций";
		НоваяНастройка.Зависимости = "ИспользоватьНесколькоОрганизаций,УчетПоКомпании";
		
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоНесколькимПодразделениям",
		"Компания",
		НСтр("ru='Несколько подразделений';uk='Кілька підрозділів'"),
		НСтр("ru='Включение позволяет указывать подразделение при заполнении документов."
""
"Список подразделений находится в разделе Компания – Подразделения.';uk='Включення дозволяє вказувати підрозділ при заповненні документів."
""
"Список підрозділів знаходиться в розділі Компанія - Підрозділи. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Приходная накладная,Расходная накладная,Акт выполненных работ,Счет на оплату,Задание на работу,Заказ поставщику,Поступление в кассу,Расход из кассы,Поступление на счет,Расход со счета,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';uk='Замовлення покупця,Прибуткова накладна,Видаткова накладна, Акт виконаних робіт,Рахунок на оплату,Завдання на роботу,Замовлення постачальнику,Надходження в касу,Витрата з каси,Надходження на рахунок,Витрата з рахунку,Початкові залишки інше,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности",
		"Компания",
		НСтр("ru='Несколько направлений деятельности';uk='Кілька напрямків діяльності'"),
		НСтр("ru='Включение позволяет указывать направление деятельности при заполнении документов."
""
"Список направлений деятельности находится в разделе Компания – Все справочники – Направления деятельности.';uk='Включення дозволяє вказувати напрямок діяльності при заповненні документів."
""
"Список напрямків діяльності знаходиться в розділі Компанія - Всі довідники - Напрямки діяльності. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Авансовый отчет,Корректировка поступления,Начисление зарплаты,Начисление налогов,Перемещение запасов,Поступление в кассу,Приходная накладная,Прочие затраты (расходы),Расход из кассы,Расход со счета,Начальные остатки прочее,Ввод начальных остатков';uk='Номенклатура,Авансовий звіт,Коригування надходження,Нарахування зарплати,Нарахування податків,Переміщення запасів,Надходження в касу,Прибуткова накладна,Інші витрати,Витрата з каси,Витрата з рахунку,Початкові залишки інше,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьОтчетность",
		"Компания",
		НСтр("ru='Регламентированная отчетность';uk='Регламентована звітність'"),
		НСтр("ru='Включение позволяет формировать регламентированную отчетность и сдавать в контролирующие органы."
""
"Можно сдавать отчетность, если ИП использует упрощенную систему налогообложения (УСН) или единый налог на вмененный доход (ЕНВД).';uk='Включення дозволяє формувати регламентовану звітність і здавати її в контролюючі органи."
""
"Можна здавати звітність, якщо ІП використовує спрощену систему оподаткування (ССО) або єдиний податок (ЄП). '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Авансовый отчет,Отчет о розничных продажах,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета';uk='Авансовий звіт,Звіт про роздрібні продажі,Надходження в касу,Надходження на рахунок,Витрата з каси,Витрата з рахунку'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов",
		"Компания",
		НСтр("ru='Кассовый метод учета доходов и расходов';uk='Касовий метод обліку доходів і витрат'"),
		НСтр("ru='Включение позволяет вести учет доходов и расходов кассовым методом (по оплате)."
""
"Основной метод учета доходов и расходов в программном продукте - метод начисления (по отгрузке). Дополнительно к методу начисления может применяться кассовый метод учета доходов и расходов (по оплате). Учет доходов и расходов кассовым методом ведется в разрезе направлений деятельности, направлений списания и источников поступления денежных средств.';uk='Включення дозволяє вести облік доходів і витрат за касовим методом (по оплаті)."
""
"Основний метод обліку доходів і витрат в програмному продукті - метод нарахування (по відвантаженню). Додатково до методу нарахування може застосовуватися касовий метод обліку доходів і витрат (по оплаті). Облік доходів і витрат за касовим методом ведеться в розрізі напрямків діяльності, напрямків списання та джерел надходження грошових коштів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Авансовый отчет,Приходная накладная,Расходная накладная';uk='Авансовий звіт,Прибуткова накладна,Видаткова накладна'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьБюджетирование",
		"Компания",
		НСтр("ru='Бюджетирование';uk='Бюджетування'"),
		НСтр("ru='Включение позволяет составлять финансовый план фирмы и контролировать его исполнение."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє складати фінансовий план фірми і контролювати його виконання."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетВнеоборотныхАктивов",
		"Компания",
		НСтр("ru='Имущество';uk='Майно'"),
		НСтр("ru='Включение позволяет вести учет имущества фирмы - основных средств и нематериальных активов."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вести облік майна фірми - основних засобів і нематеріальних активів."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки прочее,Ввод начальных остатков';uk='Номенклатура,Початкові залишки інше,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятия",
		"Компания",
		НСтр("ru='Планировать загрузку ресурсов предприятия';uk='Планувати завантаження ресурсів підприємства'"),
		НСтр("ru='Включение позволяет планировать загрузку производственных ресурсов предприятия."
""
"Ресурсом может являться любой производственный ресурс, загрузку которого целесообразно планировать. Например: оборудование, инвентарь, механизмы, бригады рабочих, отдельные работники."
""
"Список ресурсов доступен в разделе Работы - Ресурсы предприятия.';uk='Включення дозволяє планувати завантаження виробничих ресурсів підприємства."
""
"Ресурсом може бути будь-який виробничий ресурс, завантаження якого доцільно планувати. Наприклад: обладнання, інвентар, механізми, бригади робітників, окремі працівники."
""
"Список ресурсів доступний в розділі Роботи - Ресурси підприємства. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ на производство,Заказ покупателя';uk='Замовлення на виробництво, Замовлення покупця'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"АртикулНоменклатурыВСодержание",
		"Компания",
		НСтр("ru='Артикул номенклатуры в печатных формах';uk='Артикул номенклатури в друкованих формах'"),
		НСтр("ru='При печати документов, в полное наименование номенклатуры будет добавляться артикул.';uk='При друку документів, в повне найменування номенклатури буде додаватися артикул.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Расходная накладная,Заказ покупателя,Приходная накладная,Акт выполненных работ,Счет на оплату,Заказ поставщику,Номенклатура';uk='Видаткова накладна,Замовлення покупця,Прибуткова накладна,Акт виконаних робіт,Рахунок на оплату,Замовлення постачальникові,Номенклатура'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи",
		"Продажи",
		НСтр("ru='Скидки и наценки в продажах';uk='Знижки і націнки в продажах'"),
		НСтр("ru='Включение позволяет указывать общую сумму скидки/наценки на документ продажи в целом или отдельно для каждой позиции. А также вести расширенный учет применяемых в фирме скидок/наценок."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вказувати загальну суму знижки/націнки на документ продажу в цілому або окремо для кожної позиції. А також вести розширений облік застосовуваних у фірмі знижок/націнок."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Скидка,Договоры,Акт выполненных работ,Заказ покупателя,Отчет о переработке,Отчет о розничных продажах,Расходная накладная,Счет на оплату,Чек ККМ,Чек ККМ на возврат,Документы по продажам,Начальные остатки расчетов,Ввод начальных остатков';uk='Знижка,Договори,Акт виконаних робіт,Замовлення покупця,Звіт про переробку,Звіт про роздрібні продажі,Видаткова накладна,Рахунок на оплату,Чек ККМ,Чек ККМ на повернення,Документи з продажу,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьДисконтныеКарты",
		"Продажи",
		НСтр("ru='Дисконтные карты';uk='Дисконтні картки'"),
		НСтр("ru='Включение позволяет вести учет дисконтных карт и указывать их при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вести облік дисконтних карт і вказувати їх при оформленні документів продажів."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи";
	НоваяНастройка.Теги = НСтр("ru='Отчет о розничных продажах,Документы по продажам,Скидка,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';uk='Звіт про роздрібні продажі,Документи з продажу,Знижка,Замовлення покупця,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки",
		"Продажи",
		НСтр("ru='Автоматические скидки';uk='Автоматичні знижки'"),
		НСтр("ru='Включение позволяет задавать автоматические скидки и наценки, настраивать условия их предоставления. Скидки и наценки применяются при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє задавати автоматичні знижки і націнки, налаштовувати умови їх надання. Знижки і націнки застосовуються при оформленні документів продажів."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Скидка,Акт выполненных работ,Заказ покупателя,Отчет о переработке,Отчет о розничных продажах,Расходная накладная,Счет на оплату,Чек ККМ,Чек ККМ на возврат,Документы по продажам,Начальные остатки расчетов,Ввод начальных остатков';uk='Знижка,Акт виконаних робіт,Замовлення покупця,Звіт про переробку,Звіт про роздрібні продажі,Видаткова накладна,Рахунок на оплату,Чек ККМ,Чек ККМ на повернення,Документи з продажу,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПередачаТоваровНаКомиссию",
		"Продажи",
		НСтр("ru='Передача товаров на комиссию';uk='Передача товарів на комісію'"),
		НСтр("ru='Включение позволяет передавать собственные товары на комиссию стороннему контрагенту."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє передавати власні товари на комісію сторонньому контрагенту."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Документы по продажам,Начальные остатки товаров,Ввод начальных остатков';uk='Документи з продажу,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПриемТоваровНаКомиссию",
		"Продажи",
		НСтр("ru='Прием товаров на комиссию';uk='Приймання товарів на комісію'"),
		НСтр("ru='Включение позволяет вести учет принятых на комиссию товаров от стороннего контрагента."
""
"ВАЖНО! "
"Для отличия собственных запасов от запасов, принятых на комиссию, используется дополнительный разрез учета - ""Партии номенклатуры"". Поэтому для использования данной возможности необходимо включить опцию ""Партии номенклатуры"" в разделе ""Закупки""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вести облік прийнятих на комісію товарів від стороннього контрагента."
""
"ВАЖЛИВО!"
"Для відмінності власних запасів від запасів, прийнятих на комісію, використовується додатковий розріз обліку - ""Партії номенклатури"". Тому для використання даної можливості необхідно включити опцію ""Партії номенклатури"" в розділі ""Закупівлі""."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПартии";
	НоваяНастройка.Теги = НСтр("ru='Начальные остатки товаров,Ввод начальных остатков';uk='Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьКорректировкиРеализаций",
		"Продажи",
		НСтр("ru='Корректировки реализаций';uk='Коригування реалізацій'"),
		НСтр("ru='Включение позволяет оформлять корректировки реализации товаров."
""
"Корректировочные документы позволяют изменить данные, находящиеся в закрытом и запрещенном для редактирования периоде.';uk='Включення дозволяє оформляти коригування реалізації товарів."
""
"Коректувальні документи дозволяють змінити дані, що знаходяться в закритому і забороненому для редагування періоді. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Расходная накладная,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';uk='Видаткова накладна,Замовлення покупця,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПланПродаж",
		"Продажи",
		НСтр("ru='Планирование продаж';uk='Планування продажів'"),
		НСтр("ru='Возможность позволяет вводить документ ""План продаж"" с детализацией по номенклатуре и характеристикам, а также заказам покупателей."
""
"""План продаж"" существенно облегчает выполнение план-фактного анализа продаж, который является неотъемлемой частью процесса по управлению продажами.';uk='Можливість дозволяє вводити документ ""План продажів"" з деталізацією по номенклатурі і характеристикам, а також замовленням покупців."
""
"""План продажів"" істотно полегшує виконання план-фактного аналізу продажів, який є невід`ємною частиною процесу по управлінню продажами.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Счет на оплату,Документы по продажам';uk='Рахунок на оплату,Документи з продажів'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов",
		"Продажи",
		НСтр("ru='Сверки взаиморасчетов';uk='Звірення взаєморозрахунків'"),
		НСтр("ru='Включение позволяет регистрировать и контролировать сверки взаиморасчетов с контрагентами."
""
"Сверка осуществляется с помощью документа «Сверка взаиморасчетов», доступного в разделах:"
"• Продажи – Расчеты с покупателями – Сверки взаиморасчетов;"
"• Закупки – Расчеты с поставщиками - Сверки взаиморасчетов.';uk='Включення дозволяє реєструвати і контролювати звірки взаєморозрахунків з контрагентами."
""
"Звірка здійснюється за допомогою документа «Звірка взаєморозрахунків», доступного в розділах:"
"• Продажі - Розрахунки з покупцями - Звірки взаєморозрахунків;"
"• Закупівлі - Розрахунки з постачальниками - Звірки взаєморозрахунків. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Контрагенты,Начальные остатки расчетов,Ввод начальных остатков';uk='Витрата з рахунку,Надходження на рахунок,Надходження в касу,Витрата з каси,Контрагенти,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьКорректировкиДолга",
		"Продажи",
		НСтр("ru='Корректировки долга';uk='Коригування боргу'"),
		НСтр("ru='Включение позволяет проводить взаимозачеты, переуступки и корректировки долга с покупателями и поставщиками."
""
"Данные операции осуществляются с помощью документа «Корректировки долга», доступного в разделах:"
"• Продажи – Расчеты с покупателями – Корректировки долга;"
"• Закупки – Расчеты с поставщиками – Корректировки долга.';uk='Включення дозволяє проводити взаємозаліки, переуступки і коригування боргу з покупцями і постачальниками."
""
"Дані операції здійснюються за допомогою документа «Коригування боргу», доступного в розділах:"
"• Продажі - Розрахунки з покупцями - Коригування боргу;"
"• Закупівлі - Розрахунки з постачальниками - Коригування боргу. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Контрагенты,Начальные остатки расчетов,Ввод начальных остатков';uk='Витрата з рахунку,Надходження на рахунок,Надходження в касу,Витрата з каси,Контрагенти,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоПроектам",
		"Продажи",
		НСтр("ru='Проекты';uk='Проекти'"),
		НСтр("ru='Включение позволяет объединять несколько заказов покупателей в один проект."
""
"При указании проекта в заказе покупателя документ, фактически, становится спецификацией к договору с заказчиком и определяет список объектов поставки по договору (перечень товаров, продукции, работ, услуг), цену, стоимость и сроки поставки. Таким образом, учитывая затраты, доходы и расходы в разрезе заказов покупателей, можно получить агрегированную информацию о затратах, доходах и расходах и по проекту в целом."
""
"ПРИМЕР. "
"Компания ""Одеські меблі"" выиграла тендер на разработку и установку системы вентиляции и кондиционирования торгового зала в одном из супермаркетов. С заказчиком было заключено два договора: договор подряда на проектирование и монтаж системы кондиционирования и договор на поставку оборудования. Для компании важно учитывать затраты, доходы и расходы как в разрезе заказов и видов деятельности, так и в целом по конкретному проекту. Для этого в программе открыли новый проект ""Торговый зал"", а так же два заказа: один на поставку оборудования, второй - на выполнение работ. Учитывая затраты, доходы и расход по этим заказам, мы можем получить информацию и в целом по проекту ""Торговый зал"".';uk='Включення дозволяє об`єднувати декілька замовлень покупців в один проект."
""
"При вказівці проекту в замовленні покупця документ, фактично, стає специфікацією до договору із замовником і визначає список об`єктів поставки за договором (перелік товарів, продукції, робіт, послуг), ціну, вартість і терміни поставки. Таким чином, враховуючи витрати, доходи і витрати в розрізі замовлень покупців, можна отримати агреговану інформацію про витрати, доходи та витрати і за проектом в цілому."
""
"ПРИКЛАД."
"Компанія ""Одеські меблі"" виграла тендер на розробку і встановленя системи вентиляції і кондиціонування торгового залу в одному з супермаркетів. Із замовником було укладено два договори: договір підряду на проектування і монтаж системи кондиціонування і договір на поставку обладнання. Для компанії важливо враховувати витрати, доходи і витрати як в розрізі замовлень і видів діяльності, так і в цілому по конкретному проекту. Для цього в програмі відкрили новий проект ""Торговий зал"", а так само два замовлення: один на поставку обладнання, другий - на виконання робіт. З огляду на витрати, доходи і витрати за цими замовленнями, ми можемо отримати інформацію і в цілому по проекту ""Торговий зал"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Событие,Документы по продажам';uk='Замовлення покупця,Подія,Документи з продажу'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников",
		"Продажи",
		НСтр("ru='Печать этикеток и ценников';uk='Друк етикеток і цінників'"),
		НСтр("ru='Включение позволяет печатать этикетки и ценники на товары."
""
"Печать этикеток и ценников осуществляется по настраиваемым шаблонам, доступным в разделе Продажи - Сервис - Печать этикеток и ценников.';uk='Включення дозволяє друкувати етикетки і цінники на товари."
""
"Друк етикеток і цінників здійснюється по налаштованим шаблонами, доступним в розділі Продажі - Сервіс - Друк етикеток і цінників. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Счет на оплату,Номенклатура';uk='Рахунок на оплату,Номенклатура'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьРемонты",
		"Продажи",
		НСтр("ru='Приемка и передача в ремонт';uk='Приймання та передача в ремонт'"),
		НСтр("ru='Включение позволяет принимать проданные товары от покупателей по претензии, учитывать их ремонт или передачу в сервисный центр для ремонта."
""
"ВАЖНО!"
"Для идентификации возвращенных товаров в ремонте используются серийные номера, поэтому для использования данной возможности рекомендуется включить опцию ""Серийные номера"" в разделе ""Закупки""."
""
"Учет запасов в ремонте ведется отдельно от товаров в продаже.';uk='Включення дозволяє приймати продані товари від покупців за претензією, враховувати їх ремонт або передачу в сервісний центр для ремонту."
""
"ВАЖЛИВО!"
"Для ідентифікації повернутих товарів в ремонті використовуються серійні номери, тому для використання даної можливості рекомендується включити опцію ""Серійні номери"" в розділі ""Закупівлі""."
""
"Облік запасів в ремонті ведеться окремо від товарів у продажу. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СрокОплатыПокупателя";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ru='Поступление оплаты от покупателя (в сутках)';uk='Надходження оплати від покупця (у добах)'");
	НоваяНастройка.Описание			= НСтр("ru='Срок отсрочки платежа от покупателя. Указывается в сутках. "
""
"Данное значение устанавливается при создании нового договора с контрагентом. А также используется для определения даты оплаты при планировании платежей.';uk='Термін відстрочки платежу від покупця. Вказується в добах."
""
"Дане значення встановлюється при створенні нового договору з контрагентом. А також використовується для визначення дати оплати при плануванні платежів. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 6);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Счет на оплату,Договоры,Контрагенты';uk='Замовлення покупця,Рахунок на оплату,Договори,Контрагенти'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВидыЗаказовПокупателей",
		"Продажи",
		НСтр("ru='Виды заказов покупателей';uk='Види замовлень покупців'"),
		НСтр("ru='Включение позволяет создавать несколько наборов состояний заказов и фиксировать их взаимный порядок. Набор состояний и их взаимный порядок указываются в виде заказа. Вид заказ выбирается непосредственно в документе Заказ покупателя."
"Использование видов заказов позволяет вести индивидуальные воронки продаж.';uk='Включення дозволяє створювати кілька наборів станів замовлень і фіксувати їх взаємний порядок. Набір станів і їх взаємний порядок вказуються у вигляді замовлення. Вид замовлення вибирається безпосередньо в документі Замовлення покупця."
"Використання видів замовлень дозволяє вести індивідуальні воронки продажів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Бизнес-процесс,Воронка продаж';uk='Замовлення покупця,Бізнес-процес,Воронка продажів'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьСправочникВидыЗаказовПокупателей",
		"Продажи",
		НСтр("ru='Список видов заказов покупателей';uk='Список видів замовлень покупців'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ВидыЗаказовПокупателей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ИспользоватьВидыЗаказовПокупателей";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетРозничныхПродаж",
		"Продажи",
		НСтр("ru='Розничные продажи';uk='Продаж у роздріб'"),
		НСтр("ru='Включение позволяет вести учет продаж в рознице."
""
"Работа с розничными продажами осуществляется в разделе Продажи - Розничные продажи.';uk='Включення дозволяє вести облік продажів в роздрібній торгівлі."
""
"Робота з роздрібними продажами здійснюється в розділі Продажі - Роздрібні продажі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"АрхивироватьЧекиККМПриЗакрытииКассовойСмены",
		"Продажи",
		НСтр("ru='Архивировать чеки ККМ';uk='Архівувати чеки ККМ'"),
		НСтр("ru='При включенной опции, все движения, сформированные чеками ККМ, будут переноситься в отчет о розничных продажах при закрытии кассовой смены."
""
"Данная возможность позволяет значительно уменьшить объем данных при большом количестве розничных продаж за день.';uk='При включеній опції, всі рухи, сформовані чеками ККМ, будуть переноситися в звіт про роздрібні продажі при закритті касової зміни."
""
"Дана можливість дозволяє значно зменшити обсяг даних при великій кількості роздрібних продажів за день. '")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"УдалятьНепробитыеЧекиПриЗакрытииКассовойСмены",
		"Продажи",
		НСтр("ru='Удалять непробитые чеки ККМ';uk='Видаляти непробиті чеки ККМ'"),
		НСтр("ru='При включенной опции, все не пробитые на фискальном регистраторе чеки будут удаляться при закрытии кассовой смены."
""
"Данная возможность позволяет значительно уменьшить объем данных при большом количестве непробитых чеков за день."
""
"Если флаг сброшен и используется резервирование запасов, резерв товаров в непробитых чеках сохраняется при закрытии кассовой смены. Отмену резерва требуется производить вручную в каждом отложенном чеке.';uk='При включеній опції, всі не пробиті на фіскальному реєстраторі чеки будуть видалятися при закритті касової зміни."
""
"Дана можливість дозволяє значно зменшити обсяг даних при великій кількості не пробитих чеків за день."
""
"Якщо прапорець скинутий і використовується резервування запасів, резерв товарів в не пробитих чеках зберігається при закритті касової зміни. Скасування резерву потрібно робити вручну в кожному відкладеному чеку. '")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтролироватьОстаткиПриПробитииЧековККМ",
		"Продажи",
		НСтр("ru='Контролировать остатки при пробитии чеков ККМ';uk='Контролювати залишки при пробитті чеків ККМ'"),
		НСтр("ru='При пробитии чеков ККМ будет осуществляться контроль остатков.';uk='При пробитті чеків ККМ буде здійснюватися контроль залишків.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек",
		"Продажи",
		НСтр("ru='Заказы покупателей в розничной торговле';uk='Замовлення покупців в роздрібній торгівлі'"),
		НСтр("ru='Опция позволяет оформлять чеки ККМ на основании заказов покупателей. Опция доступна для изменения, если сброшен флаг ""Архивировать чеки ККМ""!';uk='Опція дозволяє оформляти чеки ККМ на підставі замовлень покупців. Опція доступна для зміни, якщо знятий прапорець ""Архівувати чеки ККМ""!'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Отчет о розничных продажах,Чек ККМ,Чек ККМ на возврат,Документы по продажам';uk='Замовлення покупця,Звіт про роздрібні продажі,Чек ККМ,Чек ККМ на повернення,Документи з продажу'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ТиповыеСхемыУчета_Розница",
		"Продажи",
		НСтр("ru='Типовые схемы учета';uk='Типові схеми обліку'"),
		НСтр("ru=''"),
		"e1cib/command/Обработка.МенеджерПодсказок.Команда.ТиповыеСхемыУчета_Розница"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьБиллинг",
		"Продажи",
		НСтр("ru='Биллинг и работа с регулярными услугами';uk='Білінг і робота з регулярними послугами'"),
		НСтр("ru='Вам станут доступны тарифные планы, а так же возможность заключать договоры обслуживания и автоматически выставлять по ним Счета на оплату.';uk='Вам стануть доступні тарифні плани, а так само можливість укладати договори обслуговування і автоматично виставляти по ним Рахунки на оплату.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"БиллингВестиУчетРасходовПоДоговорамОбслуживания",
		"Продажи",
		НСтр("ru='Вести учет расходов в разрезе договоров обслуживания';uk='Вести облік витрат в розрізі договорів обслуговування'"),
		НСтр("ru='На каждый договор обслуживания, для накопления расходов, мы будем автоматически создавать уникальное направление деятельности.';uk='На кожен договір обслуговування, для накопичення витрат, ми будемо автоматично створювати унікальний напрямок діяльності.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьБиллинг";
	НоваяНастройка.Зависимости = "ИспользоватьБиллинг";
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "БиллингГоловноеНаправлениеДеятельности";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ru='Головное направление деятельности';uk='Головний напрямок діяльності'");
	НоваяНастройка.Описание			= НСтр("ru='Элемент, в иерархию которого будут добавляться создаваемые автоматически направления деятельности по договорам обслуживания."
"Если не выбран — будут добавляться в общий список.';uk='Елемент, в ієрархію якого будуть додаватися створювані автоматично напрямки діяльності за договорами обслуговування."
"Якщо не обраний - будуть додаватися до загального списку. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 31);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьБиллинг";
	НоваяНастройка.Зависимости = "БиллингВестиУчетРасходовПоДоговорамОбслуживания";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаНалоговогоУчета",
		"Продажи",
		НСтр("ru='Оформление налоговых документов';uk='Оформлення податкових документів'"),
		НСтр("ru=''"),
		"e1cib/command/Обработка.НастройкаПрограммы.Команда.НастройкаНалоговогоУчета"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоНесколькимСкладам",
		"Закупки",
		НСтр("ru='Несколько складов';uk='Кілька складів'"),
		НСтр("ru='Включение позволяет вести учет в разрезе складов. Указание склада будет требоваться во всех складских документах."
""
"Задать имеющиеся склады можно в разделе Компания – Склады.';uk='Включення дозволяє вести облік в розрізі складів. Вказівка ​​складу буде вимагатися в усіх складських документах."
""
"Задати наявні склади можна в розділі Компанія - Склади. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Авансовый отчет,Дополнительные расходы,Заказ покупателя,Заказ поставщику,Приходная накладная,Расходная накладная,Корректировка поступления,Корректировка реализации,Документы по складу,Начальные остатки товаров,Ввод начальных остатков';uk='Авансовий звіт,Додаткові витрати,Замовлення покупця,Замовлення постачальникові,Прибуткова накладна,Видаткова накладна,Коригування надходження,Коригування реалізації,Документи по складу, Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения",
		"Закупки",
		НСтр("ru='Несколько единиц измерения';uk='Кілька одиниць вимірювання'"),
		НСтр("ru='Включение позволяет учитывать номенклатуру в различных единицах измерения. Например в штуках, блоках, коробках или килограммах."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє враховувати номенклатуру в різних одиницях виміру. Наприклад в штуках, блоках, коробках або кілограмах."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Приходная накладная,Расходная накладная,Заказ поставщику,Номенклатура,Начальные остатки товаров,Ввод начальных остатков';uk='Прибуткова накладна,Видаткова накладна,Замовлення постачальникові,Номенклатура,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьХарактеристики",
		"Закупки",
		НСтр("ru='Характеристики номенклатуры';uk='Характеристики номенклатури'"),
		НСтр("ru='Включение позволяет вести учет номенклатуры в разрезе дополнительных характеристик."
""
"Характеристики – это отдельные варианты номенклатуры. Они представляют собой комбинацию конкретных значений по указанным свойствам."
""
"Использование характеристик позволяет избежать создания большого количества схожих номенклатур."
""
"ПРИМЕР."
"Фирма реализует покупателям товары народного потребления: одежду, обувь, бытовую химию. Каждая модель одежды или обуви характеризуется размером и цветом, а у бытовой химии таких свойств нет. Зато могут быть другие свойства: тип упаковки (пластмасса, стекло) и емкость упаковки (в мл.). В этом случае, в программе будет номенклатура ""Футболка мужская"", характеристика ""50, желтая"", свойства: размер = 50, цвет = желтая."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вести облік номенклатури в розрізі додаткових характеристик."
""
"Характеристики - це окремі варіанти номенклатури. Вони являють собою комбінацію конкретних значень за вказаними властивостями."
""
"Використання характеристик дозволяє уникнути створення великої кількості схожих номенклатур."
""
"ПРИКЛАД."
"Фірма реалізує покупцям товари народного споживання: одяг, взуття, побутову хімію. Кожна модель одягу або взуття характеризується розміром і кольором, а у побутової хімії таких властивостей немає. Зате можуть бути інші властивості: тип пакування (пластмаса, скло) і ємність пакування (в мл.). В цьому випадку, в програмі буде номенклатура ""Футболка чоловіча"", характеристика ""50, жовта"", властивості: розмір = 50, колір = жовта."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Категории номенклатуры,Номенклатура,Характеристики,Акт выполненных работ,Задание на работу,Заказ на производство,Заказ покупателя,Заказ поставщику,Перемещение запасов,Приходная накладная,Расходная накладная,Счет на оплату,Счет на оплату (полученный),Начальные остатки товаров,Ввод начальных остатков';uk='Категорії номенклатури,Номенклатура,Характеристики,Акт виконаних робіт,Завдання на роботу,Замовлення на виробництво,Замовлення покупця,Замовлення постачальникові,Переміщення запасів,Прибуткова накладна,Видаткова накладна,Рахунок на оплату,Рахунок на оплату (отриманий),Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПартии",
		"Закупки",
		НСтр("ru='Партии номенклатуры';uk='Партії номенклатури'"),
		НСтр("ru='Включение позволяет учитывать запасы в разрезе конкретных партий номенклатуры."
""
"Партионный учет предполагает, что каждая партия одного и того же запаса может учитываться на складе отдельно. Ведение партионного учета для запасов, принятых на комиссию, в переработку или на ответственное хранение от стороннего контрагента является обязательным. Для собственных запасов определяется спецификой компании."
""
"ВАЖНО!"
"Партия номенклатуры не является аналогом документа оприходования запасов и не используется для определения стоимости списания товарно-материальных запасов по методу FIFO."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє враховувати запаси в розрізі конкретних партій номенклатури."
""
"Партійний облік передбачає, що кожна партія одного і того ж запасу може враховуватися на складі окремо. Ведення партійного обліку для запасів, прийнятих на комісію, в переробку або на відповідальне зберігання від стороннього контрагента є обов`язковим. Для власних запасів визначається специфікою компанії."
""
"ВАЖЛИВО!"
"Партія номенклатури не є аналогом документа оприбуткування запасів і не використовується для визначення вартості списання товарно-матеріальних запасів за методом FIFO."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Авансовый отчет,Дополнительные расходы,Заказ покупателя,Инвентаризация запасов,Корректировка поступления,Корректировка реализации,Оприходование запасов,Отчет комиссионера,Отчет комитенту,Отчет о переработке,Отчет о розничных продажах,Отчет переработчика,Перемещение запасов,Перемещение по ячейкам,Переоценка в рознице (суммовой учет),Принятие к учету,Приходная накладная,Приходный ордер,Распределение затрат,Расходная накладная,Расходный ордер,Резервирование запасов,Сдельный наряд,Списание запасов,Счет на оплату,Счет на оплату (полученный),Счет-фактура,Счет на оплату (полученный),Чек ККМ,Чек ККМ на возврат,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Авансовий звіт,Додаткові витрати,Замовлення покупця,Інвентаризація запасів,Коригування надходження,Коригування реалізації,Оприбуткування запасів,Звіт комісіонера,Звіт комітенту,Звіт про переробку,Звіт про роздрібні продажі,Звіт переробника,Переміщення запасів,Переміщення по комірках,Переоцінка в роздробі (сумовий облік),Прийняття до обліку,Прибуткова накладна,Прибутковий ордер,Розподіл витрат,Видаткова накладна,Витратний ордер,Резервування запасів,Відрядний наряд,Списання запасів,Рахунок на оплату,Рахунок на оплату (отриманий),Рахунок-фактура,Рахунок на оплату (отриманий),Чек ККМ,Чек ККМ на повернення,Документи по закупівлях,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьСерийныеНомера",
		"Закупки",
		НСтр("ru='Серийные номера, гарантийные сроки';uk='Серійні номери, гарантійні терміни'"),
		НСтр("ru='Включение позволяет использовать серийные номера товаров, как справочно (для контроля гарантийного срока после продажи), так и для учета остатков в разрезе серийных номеров."
"Серийный номер - уникальный для каждой единицы товара."
""
"Можно использовать 2 режима серийных номеров:"
"Справочно: серийные номера можно указывать при необходимости. Целесообразно указывать серийный номер при продаже товара, чтобы зафиксировать факт продажи и начало гарантийного срока."
"Учет остатков: серийные номера обязательны к заполнению во всех документах движения товаров. Ведется контроль остатков в разрезе серийных номеров.';uk='Включення дозволяє використовувати серійні номери товарів, як довідково (для контролю гарантійного терміну після продажу), так і для обліку залишків в розрізі серійних номерів."
"Серійний номер - унікальний для кожної одиниці товару."
""
"Можна використовувати 2 режиму серійних номерів:"
"Довідково: серійні номери можна вказувати при необхідності. Доцільно вказувати серійний номер при продажу товару, щоб зафіксувати факт продажу і початок гарантійного терміну."
"Облік залишків: серійні номери є обов`язковими для заповнення у всіх документах руху товарів. Ведеться контроль залишків в розрізі серійних номерів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтрольОстатковСерийныхНомеров",
		"Закупки",
		НСтр("ru='Контроль остатков серийных номеров';uk='Контроль залишків серійних номерів'"),
		НСтр("ru='Контроль остатков запасов с учетом серийных номеров. "
""
"Если контроль остатков ОТКЛЮЧЕН:"
"Серийные номера в документах можно указывать произвольно. Достаточно указывать серийные номера в документах продажи товара, чтобы зафиксировать начало гарантийного срока."
""
"Если контроль остатков ВКЛЮЧЕН:"
"Серийные номера нужно обязательно вводить во всех документах. Можно посмотреть, какие серийные номера есть в наличии, в момент подбора товаров или в отчетах."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе. Необходимо провести инвентаризацию запасов с учетом серийных номеров.';uk='Контроль залишків запасів з урахуванням серійних номерів."
""
"Якщо контроль залишків ВІДКЛЮЧЕНИЙ:"
"Серійні номери в документах можна вказувати довільно. Достатньо вказувати серійні номери в документах продажу товарів, щоб зафіксувати початок гарантійного терміну."
""
"Якщо контроль залишків ВКЛЮЧЕНИЙ:"
"Серійні номери потрібно обов`язково вводити в усіх документах. Можна подивитися, які серійні номери є в наявності, в момент підбору товарів або в звітах."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. Необхідно провести інвентаризацію запасів з урахуванням серійних номерів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСерийныеНомера";
	НоваяНастройка.Зависимости = "ИспользоватьСерийныеНомера";
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки",
		"Закупки",
		НСтр("ru='Скидки и наценки в закупках';uk='Знижки і націнки в закупівлях'"),
		НСтр("ru='Включение позволяет указывать скидку/наценку на отдельные позиции в документах закупок. А также вести расширенный учет применяемых в фирме скидок/наценок.';uk='Включення дозволяє вказувати знижку/націнку на окремі позиції в документах закупівель. А також вести розширений облік застосовуваних у фірмі знижок/націнок.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ поставщику,Приходная накладная,Счет на оплату (полученный),Договоры,Документы по закупкам,Начальные остатки расчетов,Ввод начальных остатков';uk='Замовлення постачальникові,Прибуткова накладна,Рахунок на оплату (отриманий),Договори,Документи по закупкам,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетЦенКонтрагентов",
		"Закупки",
		НСтр("ru='Цены контрагентов';uk='Ціни контрагентів'"),
		НСтр("ru='Включение позволяет фиксировать цены поставщиков (входящие цены) при оформлении приходных накладных."
""
"В программе существует возможность регистрировать входящие цены автоматически. Для этого необходимо заполнить поле ""Вид цен контрагента"" в договоре контрагента.';uk='Включення дозволяє фіксувати ціни постачальників (вхідні ціни) при оформленні прибуткових накладних."
""
"У програмі існує можливість реєструвати вхідні ціни автоматично. Для цього необхідно заповнити поле ""Вид цін контрагента"" в договорі контрагента. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Приходная накладная,Договоры,Контрагенты,Документы по закупкам';uk='Прибуткова накладна,Договори,Контрагенти,Документи по закупівлям'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияРезервированиеЗапасов",
		"Закупки",
		НСтр("ru='Резервирование запасов';uk='Резервування запасів'"),
		НСтр("ru='Включение позволяет резервировать запасы на складах, учитывать материальные и другие прямые затраты в производстве по заказам покупателей, размещать заказы покупателей в открытых заказах поставщикам и заказах на производство (сборку, разборку)."
""
"ВАЖНО! Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє резервувати запаси на складах, враховувати матеріальні та інші прямі витрати у виробництві на замовлення покупців, розміщувати замовлення покупців у відкритих замовленнях постачальникам і замовленнях на виробництво (складання, розбирання)."
""
"ВАЖЛИВО! Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Авансовый отчет,Дополнительные расходы,Заказ на производство,Заказ покупателя,Заказ поставщику,Корректировка реализации,Начисление зарплаты,Отчет о переработке,Отчет переработчика,Перемещение запасов,Приходная накладная,Прочие затраты (расходы),Распределение затрат,Расходная накладная,Сдельный наряд,Производство,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';uk='Авансовий звіт,Додаткові витрати,Замовлення на виробництво,Замовлення покупця,Замовлення постачальникові,Коригування реалізації,Нарахування зарплати,Звіт про переробку,Звіт переробника,Переміщення запасів,Прибуткова накладна,Інші витрати (витрати),Розподіл витрат,Видаткова накладна,Відрядний наряд,Виробництво, Документи по закупівлях,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПриемЗапасовНаОтветхранение",
		"Закупки",
		НСтр("ru='Прием запасов на ответственное хранение';uk='Приймання запасів на відповідальне зберігання'"),
		НСтр("ru='Включение позволяет вести прием запасов на ответственное хранение от сторонних контрагентов."
""
"ВАЖНО!"
"Для отличия собственных запасов от запасов, принятых на ответственное хранение, используется дополнительный разрез учета - ""Партии номенклатуры"". Поэтому для использования данной возможности необходимо включить опцию ""Партии номенклатуры"" в разделе ""Закупки""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вести прийом запасів на відповідальне зберігання від сторонніх контрагентів."
""
"ВАЖЛИВО!"
"Для відмінності власних запасів від запасів, прийнятих на відповідальне зберігання, використовується додатковий розріз обліку - ""Партії номенклатури"". Тому для використання даної можливості необхідно включити опцію ""Партії номенклатури"" в розділі ""Закупівлі""."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПартии";
	НоваяНастройка.Теги = НСтр("ru='Приходная накладная,Номенклатура,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';uk='Прибуткова накладна,Номенклатура,Документи по закупівлям,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПередачаСырьяВПереработку",
		"Закупки",
		НСтр("ru='Передача сырья и материалов в переработку';uk='Передача сировини і матеріалів в переробку'"),
		НСтр("ru='Включение позволяет учитывать передачу собственного сырья и материалов сторонним контрагентам для изготовления продукции или переработки."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє враховувати передачу власної сировини і матеріалів стороннім контрагентам для виготовлення продукції або переробки."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Заказ поставщику,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Замовлення постачальникові,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПередачаЗапасовНаОтветхранение",
		"Закупки",
		НСтр("ru='Передача запасов на ответственное хранение';uk='Передача запасів на відповідальне зберігання'"),
		НСтр("ru='Опция определяет возможность передачи собственных запасов на ответственное хранение сторонним контрагентам."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Опція визначає можливість передачі власних запасів на відповідальне зберігання стороннім контрагентам."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьКорректировкиПоступлений",
		"Закупки",
		НСтр("ru='Корректировки поступлений';uk='Коригування надходжень'"),
		НСтр("ru='Включение позволяет оформлять корректировки поступления товаров."
""
"Корректировочные документы позволяют изменить данные, находящиеся в закрытом и запрещенном для редактирования периоде.';uk='Включення дозволяє оформляти коригування надходження товарів."
""
"Коректувальні документи дозволяють змінити дані, що знаходяться в закритому і забороненому для редагування періоді. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Приходная накладная,Заказ поставщику,Начальные остатки расчетов,Ввод начальных остатков';uk='Прибуткова накладна,Замовлення постачальникові,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьОрдерныйСклад",
		"Закупки",
		НСтр("ru='Ордерные склады';uk='Ордерні склади'"),
		НСтр("ru='Включение позволяет разделить учет запасов на складской и финансовый."
""
"Механизм используется при необходимости разделить учет запасов на складе и учет запасов в управленческом контуре."
""
"В этом случае, для учета запасов на складе используются приходные и расходные складские ордера, а также документ для отражения перемещения запасов внутри структуры склада (например, для распределения поступивших товаров по полкам и ячейкам или комплектации заказа для отгрузки)."
""
"Для учета запасов в управленческом контуре используются финансовые документы - расходные накладные, перемещения запасов и т.д."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє розділити облік запасів на складський і фінансовий."
""
"Механізм використовується при необхідності розділити облік запасів на складі і облік запасів в управлінському контурі."
""
"У цьому випадку, для обліку запасів на складі використовуються прибуткові та видаткові складські ордери, а також документ для відображення переміщення запасів всередині структури складу (наприклад, для розподілу товарів, які поступили, по полицях і комірках або комплектації замовлення для відвантаження)."
""
"Для обліку запасів в управлінському контурі використовуються фінансові документи - видаткові накладні, переміщення запасів і т.і."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Приходная накладная,Расходная накладная,Заказ поставщику,Начальные остатки товаров,Ввод начальных остатков';uk='Прибуткова накладна,Видаткова накладна,Замовлення постачальникові,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоЯчейкам",
		"Закупки",
		НСтр("ru='Ячеистые склады';uk='Комірчаті склади'"),
		НСтр("ru='Включение позволяет детализировать место хранения номенклатуры до складской ячейки."
""
"Перечень ячеек определяется для каждого склада отдельно."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє деталізувати місце зберігання номенклатури до складської комірки."
""
"Перелік комірок визначається для кожного складу окремо."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Авансовый отчет,Заказ покупателя,Заказ поставщику,Корректировка поступления,Корректировка реализации,Оприходование запасов,Перемещение запасов,Приходная накладная,Расходная накладная,Производство,Документы по складу,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Авансовий звіт,Замовлення покупця,Замовлення постачальникові,Коригування надходження,Коригування реалізації,Оприбуткування запасів,Переміщення запасів,Прибуткова накладна,Видаткова накладна,Виробництво,Документи по складу,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСервисРасчетПотребностей",
		"Закупки",
		НСтр("ru='Расчет потребностей (планирование)';uk='Розрахунок потреб (планування)'"),
		НСтр("ru='Включение позволяет рассчитывать потребности фирмы (дефицит) в тех или иных товарах."
""
"Расчет производится на основании:"
"• прогнозируемых остатков товаров;"
"• ожидаемых поступлений и потреблений;"
"• минимального и максимального уровня запасов;"
"• детализации до заказов – источников поступления и потребления товаров."
""
"Сервис доступен в разделах:"
"• Закупки – Планирование – Расчет потребностей;"
"• Производство - Планирование - Расчет потребностей.';uk='Включення дозволяє розраховувати потреби фірми (дефіцит) в тих чи інших товарах."
""
"Розрахунок проводиться на підставі:"
"• прогнозованих залишків товарів;"
"• очікуваних надходжень і споживань;"
"• мінімального і максимального рівня запасів;"
"• деталізації до замовлень - джерел надходження і споживання товарів."
""
"Сервіс доступний в розділах:"
"• Закупівлі - Планування - Розрахунок потреб;"
"• Виробництво - Планування - Розрахунок потреб. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ поставщику';uk='Замовлення постачальникові'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСервисЗакупкаТоваров",
		"Закупки",
		НСтр("ru='Закупка товаров (планирование)';uk='Закупівля товарів (планування)'"),
		НСтр("ru='Включение позволяет формировать заказы поставщикам автоматически, рассчитывая потребности товаров на основании статистики продаж за прошлый период."
""
"Сервис доступен в разделе Закупки – Планирование – Закупка товаров.';uk='Включення дозволяє формувати замовлення постачальникам автоматично, розраховуючи потреби товарів на підставі статистики продажів за минулий період."
""
"Сервіс доступний в розділі Закупівлі - Планування - Закупівля товарів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ поставщику,Номенклатура,Документы по закупкам';uk='Замовлення постачальникові,Номенклатура,Документи по закупівлях'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СрокОплатыПоставщику";
	НоваяНастройка.Раздел			= "Закупки";
	НоваяНастройка.Представление	= НСтр("ru='Срок оплаты поставщику (в сутках)';uk='Термін оплати постачальнику (в добах)'");
	НоваяНастройка.Описание			= НСтр("ru='Срок отсрочки платежа поставщику. Указывается в сутках. "
""
"Данное значение устанавливается при создании нового договора с контрагентом. А также используется для определения даты оплаты при планировании платежей.';uk='Термін відстрочки платежу постачальнику. Вказується в добах."
""
"Дане значення встановлюється при створенні нового договору з контрагентом. А також використовується для визначення дати оплати при плануванні платежів. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 6);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ поставщику,Договоры,Контрагенты,Начальные остатки расчетов,Ввод начальных остатков';uk='Замовлення постачальникові,Договори,Контрагенти,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодсистемуРаботы",
		"Работы",
		НСтр("ru='Выполнение работ и оказание услуг';uk='Виконання робіт і надання послуг'"),
		НСтр("ru='Включает раздел ""Работы"" для выполнения работ и оказания услуг."
""
"Возможности доступны в документе ""Заказ-наряд"" в разделе ""Работы"".';uk='Включає розділ ""Роботи"" для виконання робіт і надання послуг."
""
"Можливості доступні в документі ""Замовлення-наряд"" в розділі ""Роботи"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Акт выполненных работ,Задание на работу,Номенклатура,Заказ покупателя';uk='Акт виконаних робіт,Завдання на роботу,Номенклатура,Замовлення покупця'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВидыЗаказНарядов",
		"Работы",
		НСтр("ru='Виды заказ-нарядов';uk='Види замовлення-нарядів'"),
		НСтр("ru='Включение позволяет создавать несколько наборов состояний заказов и фиксировать их взаимный порядок. Набор состояний и их взаимный порядок указываются в виде заказа. Вид заказ выбирается непосредственно в документе Заказ-наряд."
"Использование видов заказов позволяет вести индивидуальные воронки продаж.';uk='Включення дозволяє створювати кілька наборів станів замовлень і фіксувати їх взаємний порядок. Набір станів і їх взаємний порядок вказуються у вигляді замовлення. Вид замовлення вибирається безпосередньо в документі Замовлення-наряд."
"Використання видів замовлень дозволяє вести індивідуальні воронки продажів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Теги = НСтр("ru='Заказ-наряд,Бизнес-процесс,Воронка продаж';uk='Замовлення-наряд,Бізнес-процес,Воронка продажів'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьСправочникВидыЗаказНарядов",
		"Работы",
		НСтр("ru='Список видов заказ-нарядов';uk='Список видів замовлень-нарядів'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ВидыЗаказНарядов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Зависимости = "ИспользоватьВидыЗаказНарядов";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьРемонты2",
		"Работы",
		НСтр("ru='Приемка и передача в ремонт';uk='Приймання та передача в ремонт'"),
		НСтр("ru='Включение позволяет принимать проданные товары от покупателей по претензии, учитывать их ремонт или передачу в сервисный центр для ремонта."
""
"ВАЖНО!"
"Для идентификации возвращенных товаров в ремонте используются серийные номера, поэтому для использования данной возможности рекомендуется включить опцию ""Серийные номера"" в разделе ""Закупки""."
""
"Учет запасов в ремонте ведется отдельно от товаров в продаже.';uk='Включення дозволяє приймати продані товари від покупців за претензією, враховувати їх ремонт або передачу в сервісний центр для ремонту."
""
"ВАЖЛИВО!"
"Для ідентифікації повернутих товарів в ремонті використовуються серійні номери, тому для використання даної можливості рекомендується включити опцію ""Серійні номери"" в розділі ""Закупівлі""."
""
"Облік запасів в ремонті ведеться окремо від товарів у продажу. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодсистемуПроизводство",
		"Производство",
		НСтр("ru='Планирование и учет производственной деятельности';uk='Планування і облік виробничої діяльності'"),
		НСтр("ru='Включает раздел ""Производство"" для учета выпуска продукции, производственного планирования и контроля.';uk='Включає розділ ""Виробництво"" для обліку випуску продукції, виробничого планування і контролю.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Заказ покупателя,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Замовлення покупця,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьТехоперации",
		"Производство",
		НСтр("ru='Технологические операции';uk='Технологічні операції'"),
		НСтр("ru='Включение позволяет:"
"• использовать технологические операции в спецификациях изготовления изделий и сдельных нарядов;"
"• начислять зарплату сотрудникам по сдельным нарядам; "
"• вводить номенклатуру с типом ""Операция""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє:"
"• використовувати технологічні операції в специфікаціях виготовлення виробів і відрядних нарядів;"
"• нараховувати зарплату співробітникам по відрядних нарядах;"
"• вводити номенклатуру з типом ""Операція""."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	НоваяНастройка.Теги = НСтр("ru='Номенклатура';uk='Номенклатура'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПереработкаДавальческогоСырья",
		"Производство",
		НСтр("ru='Переработка давальческого сырья';uk='Переробка давальницької сировини'"),
		НСтр("ru='Включение позволяет вести прием запасов на переработку от сторонних контрагентов."
""
"ВАЖНО!"
"Для отличия собственных запасов от запасов, принятых на переработку, используется дополнительный разрез учета - ""Партии номенклатуры"". Поэтому для использования данной возможности необходимо включить опцию ""Партии номенклатуры"" в разделе ""Закупки""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє вести прийом запасів на переробку від сторонніх контрагентів."
""
"ВАЖЛИВО!"
"Для відмінності власних запасів від запасів, прийнятих на переробку, використовується додатковий розріз обліку - ""Партії номенклатури"". Тому для використання даної можливості необхідно включити опцію ""Партії номенклатури"" в розділі ""Закупівлі""."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство,ФункциональнаяОпцияИспользоватьПартии";
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';uk='Номенклатура,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяУчетВалютныхОпераций",
		"Деньги",
		НСтр("ru='Несколько валют';uk='Кілька валют'"),
		НСтр("ru='Включение позволяет указывать различные валюты при заполнении документов.';uk='Включення дозволяє вказувати різні валюти при заповненні документів.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Банковские счета,Договоры,Авансовый отчет,Акт выполненных работ,Заказ покупателя,Заказ поставщику,Корректировка поступления,Корректировка реализации,Операция по платежным картам,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Приходная накладная,Расходная накладная,Счет на оплату,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки расчетов,Ввод начальных остатков';uk='Банківські рахунки,Договори,Авансовий звіт,Акт виконаних робіт,Замовлення покупця,Замовлення постачальникові,Коригування надходження,Коригування реалізації,Операція по платіжних картах,Витрата з рахунку,Надходження на рахунок,Надходження в касу,Витрата з каси,Прибуткова накладна,Видаткова накладна,Рахунок на оплату,Документи по банку,Документи по касі,Початкові залишки грошей,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "НациональнаяВалюта";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ru='Национальная валюта';uk='Національна валюта'");
	НоваяНастройка.Описание			= НСтр("ru='Национальная валюта вашей страны."
""
"Например, для Украины национальной валютой являются гривни.';uk='Національна валюта вашої країни."
""
"Наприклад, для України національною валютою є гривні. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.Валюты");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 20);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("БыстрыйВыбор", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяУчетВалютныхОпераций";
	НоваяНастройка.Теги = НСтр("ru='Платежное поручение,Банковские счета,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';uk='Платіжне доручення,Банківські рахунки,Документи по банку,Документи по касі,Початкові залишки грошей,Початкові залишки інше,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ВалютаУчета";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ru='Валюта учета';uk='Валюта обліку'");
	НоваяНастройка.Описание			= НСтр("ru='Валюта учета является основной валютой в программе. "
""
"Все денежные операции отражаются в двух валютах:"
"• в валюте указанной в документе;"
"• в валюте учета."
""
"ВАЖНО!"
"Изменить валюту учета нельзя после начала работы в программе.';uk='Валюта обліку є основною валютою в програмі."
""
"Всі грошові операції відображаються в двох валютах:"
"• у валюті зазначеної в документі;"
"• у валюті обліку."
""
"ВАЖЛИВО!"
"Змінити валюту обліку не можна після початку роботи в програмі. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.Валюты");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 20);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("БыстрыйВыбор", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяУчетВалютныхОпераций";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Приходная накладная,Расходная накладная,Акт выполненных работ,Платежное поручение,Счет на оплату,Заказ поставщику,Банковские счета,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';uk='Замовлення покупця,Витрата з рахунку,Надходження на рахунок,Надходження в касу,Витрата з каси,Прибуткова накладна,Видаткова накладна,Акт виконаних робіт,Платіжне доручення,Рахунок на оплату,Замовлення постачальнику,Банківські рахунки,Документи по банку,Документи по касі,Початкові залишки грошей,Початкові залишки інше,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПлатежныйКалендарь",
		"Деньги",
		НСтр("ru='Платежный календарь';uk='Платіжний календар'"),
		НСтр("ru='Включение позволяет вести платежный календарь."
""
"Платежный календарь является инструментом для оперативного планирования расхода, поступления и перемещения денежных средств.';uk='Включення дозволяє вести платіжний календар."
""
"Платіжний календар є інструментом для оперативного планування витрат, надходження і переміщення грошових коштів. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Заказ поставщику,Операция по платежным картам,Перемещение денег,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета,Счет на оплату,Счет на оплату (полученный),Документы по банку,Документы по продажам,Документы по кассе';uk='Замовлення покупця,Замовлення постачальнику,Операція по платіжних картах,Переміщення грошей,Надходження в касу,Надходження на рахунок,Витрата з каси,Витрата з рахунку,Рахунок на оплату,Рахунок на оплату (отриманий),Документи по банку,Документи з продажу,Документи по касі'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСтатьиДвиженияДенежныхСредств",
		"Деньги",
		НСтр("ru='Статьи движения денежных средств (ДДС)';uk='Статті руху грошових коштів (РГК)'"),
		НСтр("ru='Включение позволяет вести учет в разрезе статей движения денежных средств.';uk='Включення дозволяє вести облік в розрізі статей руху грошових коштів.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Банковские счета,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета,Документы по банку,Документы по кассе,Начальные остатки денег,Ввод начальных остатков';uk='Банківські рахунки,Надходження в касу,Надходження на рахунок,Витрата з каси,Витрата з рахунку,Документи по банку,Документи по касі,Початкові залишки грошей,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером",
		"Деньги",
		НСтр("ru='Расчеты с банком-эквайрером';uk='Розрахунки з банком-еквайрером'"),
		НСтр("ru='Включение позволяет вести расчеты с банком-эквайрером, контролировать остаток задолженности, а также оформлять документы ""Поступление на счет"" и ""Расход со счета"" с операцией ""Отчет эквайрера"".';uk='Включення дозволяє вести розрахунки з банком-еквайрером, контролювати залишок заборгованості, а також оформляти документи ""Надходження на рахунок"" і ""Витрата з рахунку"" з операцією ""Звіт еквайрера"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Платежное поручение,Контрагенты,Банковские счета,Поступление на счет,Расход со счета,Начальные остатки расчетов,Ввод начальных остатков';uk='Платіжне доручення,Контрагенти,Банківські рахунки,Надходження на рахунок,Витрата з рахунку,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям",
		"Деньги",
		НСтр("ru='Разносить оплату по эквайринговым операциям';uk='Розносити оплату по еквайринговим операціям'"),
		НСтр("ru='Включение позволяет разносить оплаты от банка-эквайрера по отдельным эквайринговым операциям. А также относить расходы по эквайрингу на заказы покупателей."
""
"Возможность включается автоматически при использовании кассового метода учета доходов и расходов.';uk='Включення дозволяє розносити оплати від банку-еквайрера по окремих еквайрингових операціях. А також відносити витрати по еквайрингу на замовлення покупців."
""
"Можливість включається автоматично при використанні касового методу обліку доходів і витрат. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером";
	НоваяНастройка.Теги = НСтр("ru='Отчет о розничных продажах,Поступление на счет,Начальные остатки расчетов,Ввод начальных остатков';uk='Звіт про роздрібні продажі,Надходження на рахунок,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьОплатуКартамиВОптовойТорговле",
		"Деньги",
		НСтр("ru='Оплата картами в оптовой торговле';uk='Оплата картками в оптовій торгівлі'"),
		НСтр("ru='Включение позволяет оформлять оплату картами в оптовой торговле на основании следующих документов:"
""
"• Акт выполненных работ;"
"• Счет на оплату;"
"• Заказ покупателя;"
"• Расходная накладная;"
"• Продажа имущества.';uk='Включення дозволяє оформляти оплату картками в оптовій торгівлі на підставі наступних документів:"
""
"• Акт виконаних робіт;"
"• Рахунок на оплату;"
"• Замовлення покупця;"
"• Видаткова накладна;"
"• Продаж майна. '")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияКредитыИЗаймы",
		"Деньги",
		НСтр("ru='Займы и кредиты';uk='Позики й кредити'"),
		НСтр("ru='Включение позволяет вести расчеты по кредитам, полученным от сторонних контрагентов. А также по займам, выданным сотрудникам.';uk='Включення дозволяє вести розрахунки за кредитами, отриманими від сторонніх контрагентів. А також по позиках, виданих співробітникам.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Контрагенты,Сотрудники,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета';uk='Контрагенти,Співробітники,Надходження в касу,Надходження на рахунок,Витрата з каси,Витрата з рахунку'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЧастотаРасчетаКурсовыхРазниц";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ru='Расчет курсовых разниц';uk='Розрахунок курсових різниць'");
	НоваяНастройка.Описание			= НСтр("ru='Настройка частоты расчета курсовых разниц:"
""
"• В момент выполнения операций. Курсовые разницы будут рассчитываться при совершении каждой операции. Включение данной опции может увеличить время проведения документов. "
""
"• При закрытии месяца. Курсовые разницы по каждой операции будут рассчитываться в момент закрытия месяца.';uk='Налаштування частоти розрахунку курсових різниць:"
""
"• У момент виконання операцій. Курсові різниці розраховуватимуться при здійсненні кожної операції. Включення цієї опції може збільшити час проведення документів."
""
"• При закритті місяця. Курсові різниці по кожній операції будуть розраховуватися в момент закриття місяця. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ЧастотаРасчетаКурсовыхРазниц");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.ЧастотаРасчетаКурсовыхРазниц"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяУчетВалютныхОпераций";
	НоваяНастройка.Теги = НСтр("ru='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Платежное поручение,Документы по банку,Документы по кассе,Начальные остатки денег,Ввод начальных остатков';uk='Витрата з рахунку,Надходження на рахунок,Надходження в касу,Витрата з каси,Платіжне доручення,Документи по банку,Документи по касі,Початкові залишки грошей,Введення початкових залишків'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЗачитыватьАвансыДолгиАвтоматически";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ru='Автозачет авансов';uk='Автозалік авансів'");
	НоваяНастройка.Описание			= НСтр("ru='Настройка автоматического зачета авансов и долгов при проведении документов:"
""
"• Да. Перед записью документа будет произведена попытка автоматического зачета аванса или долга. "
""
"• Нет. Авансы и долги в документах необходимо будет разносить вручную.';uk='Налаштування автоматичного заліку авансів і боргів при проведенні документів:"
""
"• Так. Перед записом документа буде проведена спроба автоматичного заліку авансу або боргу."
""
"• Ні. Аванси і борги в документах необхідно буде розносити вручну. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ДаНет");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.ДаНет"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Акт выполненных работ,Платежное поручение,Контрагенты';uk='Замовлення покупця,Витрата з рахунку,Надходження на рахунок,Надходження в касу,Витрата з каси,Акт виконаних робіт,Платіжне доручення,Контрагенти'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодсистемуЗарплата",
		"Зарплата",
		НСтр("ru='Управление персоналом, начисление зарплаты';uk='Управління персоналом, нарахування зарплати'"),
		НСтр("ru='Включает раздел ""Зарплата"" для учета сведений о сотрудниках, учета их рабочего времени, начисления и выплаты зарплаты.';uk='Включає розділ ""Зарплата"" для обліку відомостей про співробітників, обліку їх робочого часу, нарахування та виплати зарплати.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Задание на работу,Сотрудники,Начальные остатки расчетов,Ввод начальных остатков';uk='Завдання на роботу,Співробітники,Початкові залишки розрахунків,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияВестиШтатноеРасписание",
		"Зарплата",
		НСтр("ru='Штатное расписание';uk='Штатний розклад'"),
		НСтр("ru='Включение позволяет вести штатное расписание."
""
"При приеме сотрудников на работу будет осуществляться проверка наличия вакантных ставок.';uk='Включення дозволяє вести штатний розклад."
""
"При прийомі співробітників на роботу буде здійснюватися перевірка наявності вакантних ставок. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги = НСтр("ru='Кадровое перемещение,Прием на работу';uk='Кадрове переміщення,Прийом на роботу'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСовместительство",
		"Зарплата",
		НСтр("ru='Совместительство';uk='Сумісництво'"),
		НСтр("ru='Включение позволяет принимать сотрудника на несколько должностей."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';uk='Включення дозволяє приймати співробітника на кілька посад."
""
"ВАЖЛИВО!"
"Можливість не можна відключити після початку роботи в програмі. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги = НСтр("ru='Сотрудники,Задание на работу';uk='Співробітники,Завдання на роботу'");
	
	Если Не СтандартныеПодсистемыСервер.ЭтоМикроВерсияКонфигурации() Тогда
	
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов",
			"Зарплата",
			НСтр("ru='Учет налога на доходы и взносов';uk='Облік податку на доходи та внесків'"),
			НСтр("ru='Включение позволяет рассчитывать налог на доходы и взносы по организациям, которые формируют регламентированную отчетность."
	""
	"ВАЖНО!"
	"Возможность нельзя отключить после начала работы в программе."
	""
	"ВАЖНО!"
	"Не доступно для Микро версии конфигурации.';uk='Включення дозволяє розраховувати податок на доходи і внески по організаціям, які формують регламентовану звітність."
	""
	"ВАЖЛИВО!"
	"Можливість не можна відключити після початку роботи в програмі."
	""
	"ВАЖЛИВО!"
	"Не доступно для Мікро версії конфігурації.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
		НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
		НоваяНастройка.Теги = НСтр("ru='Кадровое перемещение,Начисление зарплаты,Прием на работу';uk='Кадрове переміщення,Нарахування зарплати,Прийом на роботу'");
	
	КонецЕсли;

	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"МоиУчетныеЗаписи",
		"ПочтаSMS",
		НСтр("ru='Мои учетные записи';uk='Мої облікові записи'"),
		НСтр("ru='Включение и отключение загрузки почты для указанных учетных записей.';uk='Включення і відключення завантаження пошти для зазначених облікових записів.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОтправлятьСлепыеКопииПисем",
		"ПочтаSMS",
		НСтр("ru='Отправлять копии исходящих писем';uk='Відправляти копії вихідних листів'"),
		НСтр("ru='Включение позволяет указать адрес электронной почты, на который будут отправляться копии исходящих писем для текущего пользователя программы.';uk='Включення дозволяє вказати адресу електронної пошти, на яку будуть відправлятися копії вихідних листів для поточного користувача програми.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "АдресПолучателяСкрытойКопии";
	НоваяНастройка.Раздел			= "ПочтаSMS";
	НоваяНастройка.Представление	= НСтр("ru='на адрес';uk='на адресу'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "my_mail@example.org");
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.ВместеС = "ОтправлятьСлепыеКопииПисем";
	НоваяНастройка.Зависимости = "ОтправлятьСлепыеКопииПисем";
	НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаПодписиНовыхСообщений",
		"ПочтаSMS",
		НСтр("ru='Настройка подписи для новых сообщений';uk='Налаштування підпису для нових повідомлень'"),
		НСтр("ru='Подпись подставляется автоматически в текст исходящего письма.';uk='Підпис підставляється автоматично в текст вихідного листа.'"),
		"e1cib/command/Обработка.НастройкаПрограммы.Команда.НастройкаПодписиПочты"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ИмяОтправителяSMS";
	НоваяНастройка.Раздел			= "ПочтаSMS";
	НоваяНастройка.Представление	= НСтр("ru='Имя отправителя SMS';uk='Ім`я відправника SMS'");
	НоваяНастройка.Описание			= НСтр("ru='Имя отправителя SMS, которое будет использоваться по умолчанию при отправке SMS сообщений."
""
"Имя отправителя – это текст, который увидит конечный получатель вместо номера, с которого осуществлялась отправка SMS.';uk='Ім`я відправника SMS, яке буде використовуватися за замовчуванням при відправці SMS повідомлень."
""
"Ім`я відправника - це текст, який побачить кінцевий одержувач замість номера, з якого здійснювалася відправка SMS. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ЗагрузкаКонтактовGoogle",
			"ОбменСGoogle",
			НСтр("ru='Загрузка контактов';uk='Завантаження контактів'"),
			НСтр("ru='Включение позволяет вводить новых контрагентов и заполнять их контактную информацию из данных вашей адресной книги Google."
""
"Возможность доступна в документах, где есть поле для указания контрагента.';uk='Включення дозволяє вводити нових контрагентів і заповнювати їх контактну інформацію з даних вашої адресної книги Google."
""
"Можливість доступна в документах, де є поле для вказівки контрагента. '")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ru='Событие,Контрагенты,Контактные лица';uk='Подія,Контрагенти,Контактні особи'");
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЗагрузитьКонтактыGoogle",
			"ОбменСGoogle",
			НСтр("ru='Загрузить контакты';uk='Завантажити контакти'"),
			НСтр("ru='Команда выполняет загрузку контактов из адресной книги Google.';uk='Команда виконує завантаження контактів з адресної книги Google.'"),
			"e1cib/command/Обработка.ОбменСGoogle.Команда.ЗагрузитьКонтактыGoogle"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ЗагрузкаКонтактовGoogle";
		НоваяНастройка.Зависимости = "ЗагрузкаКонтактовGoogle";
		НоваяНастройка.Теги = НСтр("ru='Событие,Контрагенты,Контактные лица';uk='Подія,Контрагенти,Контактні особи'");
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"СинхронизацияКалендаряGoogle",
			"ОбменСGoogle",
			НСтр("ru='Синхронизация календаря';uk='Синхронізація календаря'"),
			НСтр("ru='При включении будет выполняться автоматическая двусторонняя синхронизация событий в программе с календарем Google."
""
"Созданные в программе события с типами ""Телефонный звонок"", ""Личная встреча"" и ""Прочее"" будут передаваться в календарь Google. Добавленные записи календаря в Google будут также отображаться в УНФ."
""
"Синхронизация происходит только по тем событиям, в которых указан календарь сотрудника с включенным признаком ""Синхронизировать с Google"".';uk='При включенні буде виконуватися автоматична двостороння синхронізація подій в програмі з календарем Google."
""
"Створені в програмі події з типами ""Телефонний дзвінок"", ""Особиста зустріч"" і ""Інше"" будуть передаватися в календар Google. Додані записи календаря в Google будуть також відображатися в УНФ."
""
"Синхронізація відбувається тільки по тих подіях, в яких вказано календар співробітника з включеною ознакою ""Синхронізувати з Google"". '")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"СинхронизироватьКалендарьGoogle",
			"ОбменСGoogle",
			НСтр("ru='Синхронизировать календарь';uk='Синхронізувати календар'"),
			НСтр("ru='Команда выполняет синхронизацию событий"
"из календаря сотрудника с календарем Google.';uk='Команда виконує синхронізацію подій"
"з календаря співробітника з календарем Google. '"),
			"e1cib/command/Обработка.ОбменСGoogle.Команда.СинхронизироватьКалендарьGoogle"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "СинхронизацияКалендаряGoogle";
		НоваяНастройка.Зависимости = "СинхронизацияКалендаряGoogle";
		НоваяНастройка.Теги = НСтр("ru='Событие,Контактные лица';uk='Подія,Контактні особи'");
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ИдентификацияПриложенияGoogle";
	НоваяНастройка.Раздел			= "ОбменСGoogle";
	НоваяНастройка.Представление	= НСтр("ru='Идентификация приложения Google';uk='Ідентифікація додатка Google'");
	НоваяНастройка.Описание			= НСтр("ru='Вставьте идентификатор из https://console.developers.google.com/project для вашего проекта';uk='Вставте ідентифікатор з https://console.developers.google.com/project для вашого проекту'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСнизу);
	НоваяНастройка.СвойстваЭлемента.Вставить("МногострочныйРежим", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "{""web"":{""auth_uri"":""https://accounts.google.com/o/oauth2/auth"",""client_secret"":""...");
	НоваяНастройка.СвойстваЭлемента.Вставить("МаксимальнаяШирина", 70);
	НоваяНастройка.СвойстваЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("МаксимальнаяВысота", 7);
	НоваяНастройка.СвойстваЭлемента.Вставить("АвтоМаксимальнаяВысота", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы И Не ОбщегоНазначения.ИспользованиеРазделителяСеанса();
	НоваяНастройка.Теги = НСтр("ru='Событие';uk='Подія'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"РабочийКаталогПечати",
		"ПерсональныеПараметрыПечати",
		НСтр("ru='Настройка рабочего каталога печати';uk='Налаштування робочого каталогу друку'"),
		НСтр("ru='Указывается каталог на вашем персональном компьютере, в котором временно хранятся файлы, полученные из информационной базы для просмотра или редактирования. Настройка действует для печати в веб-клиенте.';uk='Вказується каталог на вашім персональному комп`ютері, у якім тимчасово зберігаються файли, отримані з інформаційної бази для перегляду або редагування. Налаштування діє для друку у веб-клієнтові.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СписокПрисоединенныхФайлов",
		"РаботаСФайлами",
		НСтр("ru='Хранилище файлов';uk='Сховище файлів'"),
		НСтр("ru='Общие файлы для информационной базы (не присоединенные к объектам).';uk='Загальні файли для інформаційної бази (не приєднані до об`єктів).'"),
		"e1cib/command/Справочник.Файлы.Команда.Файлы"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СписокРедактируемыхФайлов",
		"РаботаСФайлами",
		НСтр("ru='Редактируемые файлы';uk='Файли, що редагуються'"),
		НСтр("ru='Все не присоединенные файлы, занятые пользователями для редактирования.';uk='Все не приєднані файли, зайняті користувачами для редагування.'"),
		"e1cib/command/Справочник.Файлы.Команда.РедактируемыеФайлы"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ПоказыватьЗанятыеФайлыПриЗавершенииРаботы",
		"РаботаСФайлами",
		НСтр("ru='Показывать занятые файлы при завершении работы';uk='Показувати зайняті файли при завершенні роботи'"),
		НСтр("ru='Перед завершением работы выводить окно с занятыми файлами. Появление сообщения исключает вопрос ""При завершении программы"".';uk='Перед завершенням роботи виводити вікно із зайнятими файлами. Поява повідомлення виключає питання ""При завершенні програми"".'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СпрашиватьРежимРедактированияПриОткрытииФайла",
		"РаботаСФайлами",
		НСтр("ru='Выбор режима открытия при выборе файла';uk='Вибір режиму відкриття при виборі файлу'"),
		НСтр("ru='Если файл уже занят для редактирования, то не спрашивать, а  сразу открывать/выбирать. Опция имеет смысл только в режиме выбора файла.';uk='Якщо файл уже зайнятий для редагування, то не запитувати, а  відразу відкривати/вибирати. Опція має сенс тільки в режимі вибору файлу.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если РежимРаботы.ЭтоВебКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ПоказыватьПодсказкиПриРедактированииФайлов",
			"РаботаСФайлами",
			НСтр("ru='Подсказки при редактировании';uk='Підказки при редагуванні'"),
			НСтр("ru='Выводить подсказки при редактировании присоединенного файла.';uk='Виводити підказки при редагуванні приєднаного файлу.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ДействиеСФайламиПоДвойномуЩелчкуМыши";
	НоваяНастройка.Раздел			= "РаботаСФайлами";
	НоваяНастройка.Представление	= НСтр("ru='Действие по двойному щелчку на файле';uk='Дія за подвійним клацанням на файлі'");
	НоваяНастройка.Описание			= НСтр("ru='Действие, которое будет происходить по двойному щелчку на присоединенном файле.';uk='Дія, яке буде відбуватися за подвійним клацанням на приєднаному файлі.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ДействияСФайламиПоДвойномуЩелчку");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.ДействияСФайламиПоДвойномуЩелчку"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СпособСравненияВерсийФайлов";
	НоваяНастройка.Раздел			= "РаботаСФайлами";
	НоваяНастройка.Представление	= НСтр("ru='Способ сравнения версий файлов';uk='Спосіб порівняння версій файлів'");
	НоваяНастройка.Описание			= НСтр("ru='Укажите программу, которая будет использоваться при сравнении файлов следующих типов: ""ODT, DOC, RTF, TXT"".';uk='Вкажіть програму, яка буде використовуватися при порівнянні файлів наступних типів: ""ODT, DOC, RTF, TXT"".'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСравненияВерсийФайлов");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.СпособыСравненияВерсийФайлов"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаСканирования",
		"РаботаСФайлами",
		НСтр("ru='Настройка сканирования';uk='Налаштування сканування'"),
		НСтр("ru='Программа позволяет хранить файлы, полученные напрямую со сканера. Для работы со сканером в программе необходимо произвести настройку сканирования."
""
"Перед выполнением настроек к компьютеру необходимо подключить сканер, при этом в зависимости от возможностей подключенного сканера будут доступны те или иные параметры.';uk='Програма дозволяє зберігати файли, отримані безпосередньо зі сканера. Для роботи зі сканером в програмі необхідно провести налаштування сканування."
""
"Перед виконанням налаштувань до комп`ютера необхідно підключити сканер, при цьому в залежності від можливостей сканера будуть доступні ті чи інші параметри. '")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаРабочегоКаталогаФайлов",
		"РаботаСФайлами",
		НСтр("ru='Настройка основного рабочего каталога';uk='Налаштування основного робочого каталогу'"),
		НСтр("ru='Команда открывает меню, предназначенное для установки настроек каталога на вашем персональном компьютере, в котором временно будут храниться файлы, полученные из информационной базы для просмотра или редактирования.';uk='Команда відкриває меню, призначене для встановки налаштувань каталогу на вашім персональному комп`ютері, у якім тимчасово будуть зберігатися файли, отримані з інформаційної бази для перегляду або редагування.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если РежимРаботы.ЭтоВебКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"УстановкаРасширенияРаботыСФайлами",
			"РаботаСФайлами",
			НСтр("ru='Установить расширение работы с файлами';uk='Встановити розширення роботи з файлами'"),
			НСтр("ru='Для выполнения некоторых операций в браузере (веб-клиенте) требуется установка и подключение расширения работы с файлами.';uk='Для виконання деяких операцій в браузері (веб-клієнті) потрібна установка і підключення розширення роботи з файлами.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"СведенияОПользователе",
		"Прочее",
		НСтр("ru='Сведения о пользователе';uk='Відомості про користувача'"),
		НСтр("ru='Открыть сведения (логин, пароль, права доступа и другие) о текущем пользователе программы.';uk='Відкрити відомості (логін, пароль, права доступу та інші) про поточного користувача програми.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПолнотекстовыйПоиск",
		"Прочее",
		НСтр("ru='Полнотекстовый поиск в данных';uk='Повнотекстовий пошук у даних'"),
		НСтр("ru='Полнотекстовый поиск данных позволяет находить любые сведения не только по полям карточек, но и по содержимому присоединенных файлов.';uk='Повнотекстовий пошук даних дозволяє знаходити будь-які відомості не тільки по полях карток, але й по змісту приєднаних файлів.'"),
		"e1cib/app/Обработка.ПолнотекстовыйПоискВДанных"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуютсяПрофилиБезопасности") Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкаДоступаКПрокси",
			"Прочее",
			НСтр("ru='Настроить доступ к прокси-серверу';uk='Налаштувати доступ до проксі-серверу'"),
			НСтр("ru='Персональные настройки входа в интернет с использованием прокси-сервера.';uk='Персональні налаштування входу в інтернет з використанням проксі-сервера.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ПодключениеИНастройкаОборудования",
			"Прочее",
			НСтр("ru='Подключение и настройка оборудования';uk='Підключення і налаштування обладнання'"),
			НСтр("ru='Работа с подключаемым оборудованием и управление рабочим местом."
""
"Настройка доступна при использовании подключаемого оборудования (Администрирование - Подключаемое оборудование - Использовать подключаемое оборудование).';uk='Робота з підключаємим обладнанням і управління робочим місцем."
""
"Налаштування доступне при використанні підключаємого обладнання (Адміністрування - Підключаєме обладнання - Використовувати підключаєме обладнання). '"),
			"e1cib/command/Справочник.ПодключаемоеОборудование.Команда.ОткрытьПодключаемоеОборудование"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ПодтверждениеПриЗавершенииПрограммы",
		"Прочее",
		НСтр("ru='Подтверждение при завершении программы';uk='Підтвердження при завершенні програми'"),
		НСтр("ru='Показывать окно с подтверждением при закрытии программы';uk='Показувати вікно з підтвердженням при закритті програми'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьСинхронизациюДанных",
			"Программы1СПредприятие",
			НСтр("ru='Синхронизация данных';uk='Синхронізація даних'"),
			НСтр("ru='Включение позволяет использовать синхронизацию с программами 1С:Предприятие.';uk='Включення дозволяє використовувати синхронізацію з програмами 1С:Підприємство.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ru='Договоры,Ввод начальных остатков,Начальные остатки организации';uk='Договори,Введення початкових залишків,Початкові залишки організації'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаСинхронизацииДанных",
		"Программы1СПредприятие",
		НСтр("ru='Настройка синхронизации данных';uk='Налаштування синхронізації даних'"),
		НСтр("ru='Настройка и выполнение синхронизации данных.';uk='Налаштування й виконання синхронізації даних.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"РезультатыСинхронизацииДанных",
		"Программы1СПредприятие",
		НСтр("ru='Предупреждения при синхронизации данных';uk='Попередження при синхронізації даних'"),
		НСтр("ru='Просмотр потенциально ошибочных ситуаций, требующих ручного исправления:"
"• непроведенные документы;"
"• незаполненные реквизиты;"
"• конфликты;"
"• документы, непринятые по дате запрета.';uk='Перегляд потенційно помилкових ситуацій, що вимагають ручного виправлення:"
"• непроведені документи;"
"• незаповнені реквізити;"
"• конфлікти;"
"• документи, пропущені через дату заборони. '"),
		"e1cib/list/РегистрСведений.РезультатыОбменаДанными"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьДатыЗапретаЗагрузки",
		"Программы1СПредприятие",
		НСтр("ru='Запрещать загружать данные прошлых периодов';uk='Забороняти завантажувати дані минулих періодів'"),
		НСтр("ru='Запрет загрузки данных прошлых периодов из других программ.';uk='Заборона завантаження даних минулих періодів з інших програм.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ДатыЗапретаЗагрузкиДанных",
		"Программы1СПредприятие",
		НСтр("ru='Даты запрета загрузки данных';uk='Дати заборони завантаження даних'"),
		НСтр("ru='Запрет загрузки данных прошлых периодов из других программ.';uk='Заборона завантаження даних минулих періодів з інших програм.'"),
		"e1cib/command/РегистрСведений.ДатыЗапретаИзменения.Команда.ДатыЗапретаЗагрузкиДанных"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьДатыЗапретаЗагрузки,ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ПрефиксУзлаРаспределеннойИнформационнойБазы";
		НоваяНастройка.Раздел			= "Программы1СПредприятие";
		НоваяНастройка.Представление	= НСтр("ru='Префикс базы';uk='Префікс бази'");
		НоваяНастройка.Описание			= НСтр("ru='Префикс добавляется автоматически к кодам элементов справочников и номерам документов для того, чтобы различать программы, в которых они были введены, и избежать дублирования данных.';uk='Префікс додається автоматично до кодів елементів довідників "
"та номерів документів для того, щоб розрізняти програми, в "
"яких вони були введені, і уникнути дублювання даних.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 4);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "КонтрольДоговоровПриПроведенииДокументов";
	НоваяНастройка.Раздел			= "Программы1СПредприятие";
	НоваяНастройка.Представление	= НСтр("ru='Контроль договоров';uk='Контроль договорів'");
	НоваяНастройка.Описание			= НСтр("ru='При проведении документов, у которых договор контрагента не соответствует операции документа:"
"• Только предупреждать. Выдается сообщение о несоответствии договора, но документ проводится."
"• Не проводить. Выдается сообщение о несоответствии договора и документ не проводится."
""
"ВАЖНО!"
"Контроль договоров контрагентов выполняется только при настроенной синхронизации данных с программой ""1С: Бухгалтерия для Украины"".';uk='При проведенні документів, у яких договір контрагента не відповідає операції документа:"
"• Тільки попереджати. Видається повідомлення про невідповідність договору, але документ проводиться."
"• Не проводити. Видається повідомлення про невідповідність договору і документ не проводиться."
""
"ВАЖЛИВО!"
"Контроль договорів контрагентів виконується тільки при налаштованої синхронізації даних з програмою ""1С: Бухгалтерія для України"". '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(0, НСтр("ru='Предупреждать';uk='Попереджати'"));
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(1, НСтр("ru='Не проводить';uk='Не проводити'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	Если РежимРаботы.КлиентСерверный И РежимРаботы.ЭтоАдминистраторСистемы И Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "КаталогСообщенийОбменаДаннымиДляWindows";
		НоваяНастройка.Раздел			= "Программы1СПредприятие";
		НоваяНастройка.Представление	= НСтр("ru='Каталог сообщений обмена данными для ОС Windows';uk='Каталог повідомлень обміну даними для ОС Windows'");
		НоваяНастройка.Описание			= НСтр("ru='Путь к единому сетевому каталогу для общих временных файлов серверов 1С:Предприятие, работающих в одном кластере.';uk='Шлях до єдиного мережного каталогу для загальних тимчасових файлів серверів 1С:Підприємство, що працюють в одному кластері.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	КонецЕсли;
	
	Если РежимРаботы.КлиентСерверный И РежимРаботы.ЭтоАдминистраторСистемы И Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "КаталогСообщенийОбменаДаннымиДляLinux";
		НоваяНастройка.Раздел			= "Программы1СПредприятие";
		НоваяНастройка.Представление	= НСтр("ru='Каталог сообщений обмена данными для ОС Linux';uk='Каталог повідомлень обміну даними для ОС Linux'");
		НоваяНастройка.Описание			= НСтр("ru='Путь к единому сетевому каталогу для общих временных файлов серверов 1С:Предприятие, работающих в одном кластере.';uk='Шлях до єдиного мережного каталогу для загальних тимчасових файлів серверів 1С:Підприємство, що працюють в одному кластері.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ИнформацияСинхронизацияБП",
			"Программы1СПредприятие",
			НСтр("ru='Подробнее о синхронизации с ""1C:Бухгалтерия для Украины""';uk='Детальніше про синхронізацію з ""1C:Бухгалтерія для України""'"),
			НСтр("ru=''"),
			"https://1cfresh.com/articles/obmen"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
	"СинхронизацияСМобильнымПриложением",
	"СинхронизацияСМобильнымПриложением",
	НСтр("ru='Как подключить мобильное приложение';uk='Як підключити мобільний додаток'"),
	НСтр("ru='Информация о подключении мобильного приложения, и выполнение синхронизации';uk='Інформація про підключення мобільного додатку, і виконання синхронізації'"),
	"e1cib/command/ПланОбмена.МобильноеПриложение.Команда.ОткрытьМобильноеПриложение"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	Если Не РежимРаботы.МодельСервиса и Не РежимРаботы.ЭтоВебКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОбменСЛичнымКабинетом",
		"ОбменСЛичнымКабинетом",
		НСтр("ru='Обмен с личным кабинетом';uk='Обмін з особистим кабінетом'"),
		НСтр("ru='Обработка обмена с сайтом prom.ua';uk='Обробка обміну з сайтом prom.ua'"),
		"e1cib/app/Обработка.ОбменСЛичнымКабинетом"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ru='';uk=''");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
	"НастройкаМеханизмаСинхронизацииМобильноеПриложение",
	"СинхронизацияСМобильнымПриложением",
	НСтр("ru='Подробнее о синхронизации с мобильным приложением';uk='Детальніше про синхронізацію з мобільним додатком'"),
	НСтр("ru=''"),
	"http://sbm.1c.ru/about/nastroyka-mekhanizma-sinkhronizatsii/"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
	"ФункциональнаяОпцияИспользоватьОбменССайтами",
	"ОбменССайтом",
	НСтр("ru='Обмен с сайтом';uk='Обмін з сайтом'"),
		НСтр("ru='Включение позволяет выполнять синхронизацию с сайтами.';uk='Включення дозволяє виконувати синхронізацію з сайтами.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаОбменаССайтами",
		"ОбменССайтом",
		НСтр("ru='Настройка обмена с сайтом';uk='Налаштування обміну з сайтом'"),
		НСтр("ru='Настройка и выполнение обмена с сайтом.';uk='Налаштування та виконання обміну з сайтом.'"),
		"e1cib/list/ПланОбмена.ОбменУправлениеНебольшойФирмойСайт"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ПрефиксДляОбменаССайтом";
	НоваяНастройка.Раздел			= "ОбменССайтом";
	НоваяНастройка.Представление	= НСтр("ru='Префикс для обмена с сайтом';uk='Префікс для обміну з сайтом'");
	НоваяНастройка.Описание			= НСтр("ru='Префикс автоматически добавляется к номерам заказов покупателей загруженных с сайта для того, чтобы отделить их от заказов, созданных в информационной базе и избежать дублирования данных.';uk='Префікс автоматично додається до номерів замовлень покупців завантажених з сайту для того, щоб відокремити їх від замовлень, створених в інформаційній базі й уникнути дублювання даних.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 4);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ИнформацияОбменССайтом",
			"ОбменССайтом",
			НСтр("ru='Подробнее о настройке и возможностях обмена с сайтом';uk='Детальніше про налаштування й можливості обміну з сайтом'"),
			НСтр("ru=''"),
			"https://1cfresh.com/articles/unf_site"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ru='Ввод начальных остатков,Начальные остатки организации';uk='Введення початкових залишків,Початкові залишки організації'");
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЗаголовокСистемы";
	НоваяНастройка.Раздел			= "ОбщиеНастройки";
	НоваяНастройка.Представление	= НСтр("ru='Заголовок программы';uk='Заголовок програми'");
	НоваяНастройка.Описание			= НСтр("ru='Заголовок программы отображается в верхней части главного окна, вместе с информацией о текущем пользователе и актуальных курсах валют."
""
"СОВЕТ."
"Заголовок полезно задавать, когда вы ведете работу в нескольких программах одновременно. Тогда заголовок открытого окна будет подсказывать, в какой программе вы сейчас работаете.';uk='Заголовок програми відображається у верхній частині головного вікна, разом з інформацією про поточного користувача і актуальні курси валют."
""
"ПОРАДА."
"Заголовок корисно задавати, коли ви ведете роботу в декількох програмах одночасно. Тоді заголовок відкритого вікна буде підказувати, в якій програмі ви зараз працюєте. '");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", НСтр("ru='Заголовок программы';uk='Заголовок програми'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЧасовойПоясПрограммы";
	НоваяНастройка.Раздел			= "ОбщиеНастройки";
	НоваяНастройка.Представление	= НСтр("ru='Часовой пояс';uk='Часовий пояс'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 15);
	НоваяНастройка.СвойстваЭлемента.Вставить("РежимВыбораИзСписка", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ВремяТекущегоСеанса",
		"ОбщиеНастройки",
		НСтр("ru='Время текущего сеанса';uk='Час поточного сеансу'"),
		НСтр("ru=''")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ПереноситьДатуЗапретаРедактирования";
	НоваяНастройка.Раздел			= "ОбщиеНастройки";
	НоваяНастройка.Представление	= НСтр("ru='Перенос даты запрета редактирования';uk='Перенесення дати заборони редагування'");
	НоваяНастройка.Описание			= НСтр("ru='Автоматически переносить дату запрета редактирования при закрытии месяца.';uk='Автоматично переносити дату заборони редагування при закритті місяця.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ДаНет");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления.ДаНет.Да);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления.ДаНет.Нет);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления.ДаНет.ПустаяСсылка(), НСтр("ru='Спрашивать';uk='Запитувати'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтролироватьОстаткиПриПроведении",
		"ОбщиеНастройки",
		НСтр("ru='Контролировать остатки при проведении';uk='Контролювати залишки при проведенні'"),
		НСтр("ru='Включение запрещает проводить и отменять проведение документов, в случае появления отрицательных остатков.';uk='Включення забороняє проводити і скасовувати проведення документів, в разі появи негативних залишків.'")
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РежимРаботы.КлиентСерверный И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ПараметрыПроксиСервера",
			"ОбщиеНастройки",
			НСтр("ru='Параметры доступа в Интернет';uk='Параметри доступу в Інтернет'"),
			НСтр("ru='Настройки параметров прокси-сервера на сервере 1С:Предприятие.';uk='Налаштування параметрів проксі-сервера на сервері 1С:Підприємство.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РаботаВБезопасномРежимеСлужебный.ДоступнаНастройкаПрофилейБезопасности() И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкиИспользованияПрофилейБезопасности",
			"ОбщиеНастройки",
			НСтр("ru='Профили безопасности';uk='Профілі безпеки'"),
			НСтр("ru='Использование профилей безопасности для контроля за использованием программой внешних (относительно кластера серверов 1С:Предприятия) ресурсов.';uk='Використання профілів безпеки для контролю за "
"використанням програмою зовнішніх (відносно кластера "
"серверів 1С:Підприємства) ресурсів.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияИПоддержка",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Информация и поддержка';uk='Інформація та підтримка'"),
		НСтр("ru='Оформление непосредственно из программы запросов в службу поддержки (для пользователей сервиса). Ссылки на правовую и методическую поддержку с портала its.1c.ru';uk='Оформлення безпосередньо з програми запитів в службу підтримки (для користувачів сервісу). Посилання на правову та методичну підтримку з порталу its.1c.ru'"),
		"e1cib/command/ОбщаяКоманда.ОткрытьИнформационныйЦентр"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВЛокальномРежиме") Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЖурналРегистрации",
			"ПоддержкаИОбслуживание",
			НСтр("ru='Журнал регистрации';uk='Журнал реєстрації'"),
			НСтр("ru='Журнал регистрации содержит информацию о том, какие события происходили в информационной базе в определенный момент времени, или какие действия выполнял тот или иной пользователь.';uk='Журнал реєстрації містить інформацію про те, які події відбувалися в інформаційній базі в певний момент часу, або які дії виконував той чи інший користувач.'"),
			"e1cib/app/Обработка.ЖурналРегистрации"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("СтандартныеПодсистемыВЛокальномРежиме") Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"АнализЖурналаРегистрации",
			"ПоддержкаИОбслуживание",
			НСтр("ru='Анализ журнала регистрации';uk='Аналіз журналу реєстрації'"),
			НСтр("ru='Переход к отчету ""Анализ журнала регистрации"". Отчет также позволяет анализировать активность пользователей.';uk='Перехід до звіту ""Аналіз журналу реєстрації"". Звіт також дозволяє аналізувати активність користувачів.'"),
			"e1cib/app/Отчет.АнализЖурналаРегистрации"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"АктивныеПользователи",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Активные пользователи';uk='Активні користувачі'"),
		НСтр("ru='Пользователи, работающие в программе на текущий момент.';uk='Користувачі, що працюють в програмі на поточний момент.'"),
		"e1cib/app/Обработка.АктивныеПользователи"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"БлокировкаРаботыПользователей",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Блокировка работы пользователей';uk='Блокування роботи користувачів'"),
		НСтр("ru='Запрет входа в информационную базу для пользователей.';uk='Заборона входу в інформаційну базу для користувачів.'"),
		"e1cib/app/Обработка.БлокировкаРаботыПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ОбновитьПараметрыСистемы",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Обновить параметры системы';uk='Оновити параметри системи'"),
		НСтр("ru='Сброс кэша, обновление интерфейса с учетом функциональных опций.';uk='Скидання кешу, оновлення інтерфейсу з урахуванням функціональних опцій.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"УдалениеПомеченныхОбъектов",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Удаление помеченных объектов';uk='Видалення відмічених об`єктів'"),
		НСтр("ru='Окончательное удаление объектов, помеченных на удаление, с контролем ссылочной целостности.';uk='Остаточне видалення об`єктів, позначених на видалення, з контролем посилальної цілісності.'"),
		"e1cib/app/Обработка.УдалениеПомеченныхОбъектов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"РезервноеКопированиеИВосстановление",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Резервное копирование и восстановление';uk='Резервне копіювання і відновлення'"),
		НСтр("ru='Создание резервных копий информационных баз, восстановление из копии и настройка резервного копирования.';uk='Створення резервних копій інформаційних баз, відновлення з копії і налаштування резервного копіювання.'"),
		"e1cib/command/Обработка.ОблачныйАрхив.Команда.РезервноеКопированиеИВосстановление"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	//НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
	//	"ИнформацияОбОблачномАрхиве",
	//	"ПоддержкаИОбслуживание",
	//	НСтр("ru='Подробнее о 1С:Облачный архив';uk='Детальніше про 1С:Хмарний архів'"),
	//	НСтр("ru=''"),
	//	"https://portal.1c.ru/app/arhiv"
	//);
	//НоваяНастройка.ПравоРедактирования = Истина;
	
	//Если РежимРаботы.Локальный И РежимРаботы.ЭтоАдминистраторСистемы Тогда
	//	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
	//		"ЗагрузитьКлассификаторБанков",
	//		"ПоддержкаИОбслуживание",
	//		НСтр("ru='Загрузить классификатор банков';uk='Завантажити класифікатор банків'"),
	//		НСтр("ru='Загрузка классификатора банков РФ с диска 1С:ИТС или сайта РБК.';uk='Завантаження класифікатора банків РФ з диска 1С:ІТС або сайту РБК.'"),
	//		"e1cib/command/Справочник.КлассификаторБанковРФ.Команда.ЗагрузкаКлассификатораБанковРФ"
	//	);
	//	НоваяНастройка.ДобавлятьОтступ = Истина;
	//	НоваяНастройка.ПравоРедактирования = Истина;
	//	НоваяНастройка.Теги = НСтр("ru='Банковские счета';uk='Банківські рахунки'");
	//КонецЕсли;
	
	Если РежимРаботы.Локальный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЗагрузкаКурсовВалют",
			"ПоддержкаИОбслуживание",
			НСтр("ru='Загрузить курсы валют';uk='Завантажити курси валют'"),
			НСтр("ru='Загрузка курсов выбранных валют за указанный период с сайта finance.ua.';uk='Завантаження курсів обраних валют за вказаний період з сайту finance.ua.'"),
			"e1cib/app/Обработка.ЗагрузкаКурсовВалют"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ru='Банковские счета';uk='Банківські рахунки'");
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"НастройкаСтандартногоИнтерфейсаOData",
			"ПоддержкаИОбслуживание",
			НСтр("ru='Настройка стандартного интерфейса OData';uk='Налаштування стандартного інтерфейсу OData'"),
			НСтр("ru=''"),
			"e1cib/app/Обработка.НастройкаСтандартногоИнтерфейсаOData"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьДатыЗапретаИзменения",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Запрещать изменения прошлых периодов';uk='Забороняти зміни минулих періодів'"),
		НСтр("ru='Запрет изменения данных прошлых периодов.';uk='Заборона зміни даних минулих періодів.'")
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ДатыЗапретаИзмененияДанных",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Даты запрета изменения данных';uk='Дати заборони зміни даних'"),
		НСтр("ru=''"),
		"e1cib/command/РегистрСведений.ДатыЗапретаИзменения.Команда.ДатыЗапретаИзмененияДанных"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьДатыЗапретаИзменения";
	НоваяНастройка.Зависимости = "ИспользоватьДатыЗапретаИзменения";
	
	Если ПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ОбновлениеПрограммы",
			"ИнтернетПоддержкаПользователей",
			НСтр("ru='Обновление программы';uk='Оновлення програми'"),
			НСтр("ru='Получение информации и установка новых версий конфигурации и платформы 1С:Предприятия.';uk='Отримання інформації і встановлення нових версій конфігурації і платформи 1С: Підприємства.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
	КонецЕсли;
	
	Если ИнтернетПоддержкаПользователейВызовСервера.ДоступноПодключениеИнтернетПоддержки() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ПодключитьИПП",
			"ИнтернетПоддержкаПользователей",
			НСтр("ru='Подключить Интернет-поддержку';uk='Підключити Інтернет-підтримку'"),
			НСтр("ru='Для авторизации в системе Интернет-поддержки пользователей используется тот же логин и пароль, что и на сайте users.v8.1c.ru."
"Если у Вас ещё нет логина и пароля, то выполните регистрацию самостоятельно или обратитесь за помощью к партнёру фирмы ""1С"", с которым у Вас заключен договор ИТС.';uk='Для авторизації в системі Інтернет-підтримки користувачів використовується той же логін і пароль, що і на сайті users.v8.1c.ru."
"Якщо у Вас ще немає логіна і пароля, то виконайте реєстрацію самостійно або зверніться за допомогою до партнера фірми ""1С"", з яким у Вас укладений договір ІТС. '")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если МониторИнтернетПоддержки.ДоступноИспользованиеМонитораИнтернетПоддержки() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"МониторИнтернетПоддержки",
			"ИнтернетПоддержкаПользователей",
			НСтр("ru='Монитор Интернет-поддержки';uk='Монітор Інтернет-підтримки'"),
			НСтр("ru='Информация о поддержке программного продукта, версии программы и др.';uk='Інформація про підтримку програмного продукту, версії програми й ін.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если ИнтернетПоддержкаПользователейВызовСервера.ДоступнаНастройкаПараметровПодключенияКИнтернетПоддержке() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкиСоединенияССерверомИнтернетПоддержки",
			"ИнтернетПоддержкаПользователей",
			НСтр("ru='Настройки соединения с сервером';uk='Налаштування з`єднання із сервером'"),
			НСтр("ru='Настройка параметров сетевого соединения с сервером Интернет-поддержки';uk='Налаштування параметрів мережного з`єднання із сервером Інтернет-підтримки'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"РезультатыОбновленияИДополнительнаяОбработкаДанных",
		"ИнтернетПоддержкаПользователей",
		НСтр("ru='Результаты обновления и дополнительная обработка данных';uk='Результати оновлення і додаткова обробка даних'"),
		НСтр("ru='Сведения о ходе обновления версии программы, отложенное выполнение дополнительных процедур обработки данных.';uk='Відомості про хід оновлення версії програми, відкладене виконання додаткових процедур обробки даних.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ДетализироватьОбновлениеИБВЖурналеРегистрации",
			"ИнтернетПоддержкаПользователей",
			НСтр("ru='Детализировать ход обновления в журнале регистрации';uk='Деталізувати хід оновлення в журналі реєстрації'"),
			НСтр("ru='Записывать в журнал регистрации подробную информацию о ходе выполнения обновления.';uk='Записувати в журнал реєстрації детальну інформацію про хід "
"виконання оновлення.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если ПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы() И Не ПустаяСтрока(ПолучениеОбновленийПрограммы.КаталогСохраненияПоследнегоПолученногоДистрибутива()) Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "КаталогДистрибутиваПлатформы";
		НоваяНастройка.Раздел			= "ИнтернетПоддержкаПользователей";
		НоваяНастройка.Представление	= НСтр("ru='Последний полученный дистрибутив платформы сохранен в папку';uk='Останній отриманий дистрибутив платформи збережений у папку'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеНадписи);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы И РежимРаботы.Локальный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ВыгрузитьДанныеДляПереходаВСервис",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ru='Перейти в сервис';uk='Перейти в сервіс'"),
			НСтр("ru='Вы можете продолжить работу в сервисе со своими данными из этой программы. Для этого необходимо передать или загрузить полученный файл в сервис.';uk='Ви можете продовжити роботу в сервісі зі своїми даними із цієї програми. Для цього необхідно передати або завантажити отриманий файл у сервіс.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы И РежимРаботы.Локальный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ЗагрузитьДанныеИзСервиса",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ru='Загрузить из сервиса';uk='Завантажити з сервісу'"),
			НСтр("ru='Загрузка файла с данными из сервиса. Перед загрузкой необходимо убедится, что версия программы совпадает с версией, из которой выгружались данные.';uk='Завантаження файлу з даними із сервісу. Перед завантаженням необхідно переконатися, що версія програми збігається з версією, з якої вивантажувалися дані.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы И РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ВыгрузитьДанныеВЛокальнуюВерсию",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ru='Выгрузить в локальную версию';uk='Вивантажити в локальну версію'"),
			НСтр("ru='Вы можете продолжить работу с данным этого приложением в локальной версии. Для этого необходимо загрузить данные программу, которая установлена на вашем компьютере.';uk='Ви можете продовжити роботу з даними цього додатку у локальній версії. Для цього необхідно завантажити дані в програму, яка встановлена на вашім комп`ютері.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"АвтономнаяРабота",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ru='Автономная работа';uk='Автономна робота'"),
			НСтр("ru='Работа с приложением, имеющим плохое подключение сервису';uk='Робота з додатком, яке має погане підключення сервісу'"),
			"e1cib/command/ОбщаяКоманда.АвтономнаяРаботаВМоделиСервиса"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если РежимРаботы.Автономный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"АвтономнаяРабота_Локально",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ru='Автономная работа';uk='Автономна робота'"),
			НСтр("ru='Обмен с приложением в интернете';uk='Обмін з додатком в інтернеті'"),
			"e1cib/command/ОбщаяКоманда.АвтономнаяРабота"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВерсионированиеОбъектов",
		"ВерсионированиеОбъектов",
		НСтр("ru='Версионирование объектов';uk='Версіонування об`єктів'"),
		НСтр("ru='Хранение и просмотр версий документов и справочников программы.';uk='Зберігання та перегляд версій документів і довідників програми.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиВерсионированияОбъектов",
		"ВерсионированиеОбъектов",
		НСтр("ru='Настройки версионирования объектов';uk='Налаштування версіонування об`єктів'"),
		НСтр("ru='Настройка вариантов версионирования для документов и справочников.';uk='Налаштування варіантів версіонування для документів і довідників.'"),
		"e1cib/list/РегистрСведений.НастройкиВерсионированияОбъектов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьВерсионированиеОбъектов";
	НоваяНастройка.Зависимости = "ИспользоватьВерсионированиеОбъектов";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ДополнительныеРеквизиты",
		"ДополнительныеРеквизиты",
		НСтр("ru='Дополнительные реквизиты';uk='Додаткові реквізити'"),
		НСтр("ru='Создание реквизитов, их изменение, описание свойств."
"Эти реквизиты отображаются в формах.';uk='Створення реквізитів, їх зміна, опис властивостей."
"Ці реквізити відображаються у формах.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Характеристики';uk='Характеристики'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ДополнительныеСведения",
		"ДополнительныеРеквизиты",
		НСтр("ru='Дополнительные сведения';uk='Додаткові відомості'"),
		НСтр("ru='Создание сведений, их изменение, описание свойств."
"Эти сведения отображаются в отдельной форме,"
"которая открывается специальной командой.';uk='Створення відомостей, їх зміна, опис властивостей."
"Ці відомості відображаються в окремій формі,"
"яка відкривається спеціальною командою.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Характеристики';uk='Характеристики'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбщиеДополнительныеЗначения",
		"ДополнительныеРеквизиты",
		НСтр("ru='Реквизиты и сведения с общим списком значений';uk='Реквізити та відомості із загальним списком значень'"),
		НСтр("ru='Разрешить добавление реквизитов, у которых общий список значений с другими реквизитами (команда Добавить - По образцу).';uk='Дозволити додавання реквізитів, у яких загальний список значень з іншими реквізитами (команда Додати - За зразком).'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Характеристики';uk='Характеристики'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбщиеДополнительныеРеквизитыИСведения",
		"ДополнительныеРеквизиты",
		НСтр("ru='Общие реквизиты и сведения';uk='Загальні реквізити та відомості'"),
		НСтр("ru='Разрешить добавление реквизитов сразу к нескольким объектам программы одновременно (команда Добавить - Общий).';uk='Дозволити додавання реквізитів відразу до кількох об`єктів програми одночасно (команда Додати - Загальний).'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Характеристики';uk='Характеристики'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьВидыКонтактнойИнформации",
		"КонтактнаяИнформация",
		НСтр("ru='Виды контактной информации';uk='Види контактної інформації'"),
		НСтр("ru='Классификация контактной информации различных объектов системы, например, контрагентов, организаций, сотрудников и т.д.';uk='Класифікація контактної інформації різних об`єктів системи, наприклад, контрагентів, організацій, співробітників і т.д.'"),
		"e1cib/list/Справочник.ВидыКонтактнойИнформации"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Контрагенты,Контактные лица';uk='Контрагенти,Контактні особи'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПользователиПрограммы",
		"НастройкиПользователейИПрав",
		НСтр("ru='Пользователи';uk='Користувачі'"),
		НСтр("ru='Ведение списка пользователей, которые работают с программой.';uk='Ведення списку користувачів, які працюють з програмою.'"),
		"e1cib/list/Справочник.Пользователи"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если Пользователи.ОбщиеНастройкиВходаИспользуются() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкаВходаПользователей",
			"НастройкиПользователейИПрав",
			НСтр("ru='Настройка входа пользователей';uk='Налаштування входу користувачів'"),
			НСтр("ru='Сложность и смена паролей, ограничение работы неактивных пользователей.';uk='Складність і зміна паролів, обмеження роботи неактивних користувачів.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиПользователей",
		"НастройкиПользователейИПрав",
		НСтр("ru='Настройки пользователей';uk='Налаштування користувачів'"),
		НСтр("ru='Управление пользовательскими настройками отчетов, внешнего вида программы и прочими настройками.';uk='Управління користувацькими налаштуваннями звітів, зовнішнього вигляду програми і іншими параметрами.'"),
		"e1cib/app/Обработка.НастройкиПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"КопированиеНастроекПользователей",
		"НастройкиПользователейИПрав",
		НСтр("ru='Копирование настроек пользователей';uk='Копіювання налаштувань користувачів'"),
		НСтр("ru='Копирование пользовательских настроек между учетными записями.';uk='Копіювання користувацьких налаштувань між обліковими записами.'"),
		"e1cib/command/Обработка.НастройкиПользователей.Команда.КопированиеНастроекПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОчисткаНастроекПользователей",
		"НастройкиПользователейИПрав",
		НСтр("ru='Очистка настроек';uk='Очищення налаштувань'"),
		НСтр("ru='Удаление настроек у всех или выбранных пользователей.';uk='Видалення налаштувань у всіх або вибраних користувачів.'"),
		"e1cib/command/Обработка.НастройкиПользователей.Команда.ОчисткаНастроекПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОграничиватьДоступНаУровнеЗаписей",
		"НастройкиПользователейИПрав",
		НСтр("ru='Ограничивать доступ на уровне записей';uk='Обмежувати доступ на рівні записів'"),
		НСтр("ru='Расширенная настройка, позволяющая максимально гибко настраивать права доступа к справочникам, документам и другим данным программы в предусмотренных разрезах.';uk='Розширене налаштування, що дозволяє максимально гнучко налаштовувати права доступу до довідників, документів і інших даних програми у передбачених розрізах.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьГруппыДоступаКонтрагентов",
		"НастройкиПользователейИПрав",
		НСтр("ru='Группы доступа контрагентов';uk='Групи доступу контрагентів'"),
		НСтр("ru='Деление контрагентов на группы, по которым можно назначать пользователям права на добавление (изменение), просмотр контрагентов и всех документов по этим контрагентам.';uk='Розподіл контрагентів на групи, по яких можна призначати користувачам права на додавання (зміну), перегляд контрагентів і всіх документів по цих контрагентах.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ОграничиватьДоступНаУровнеЗаписей";
	НоваяНастройка.Зависимости = "ОграничиватьДоступНаУровнеЗаписей";
	НоваяНастройка.Теги = НСтр("ru='Контрагенты';uk='Контрагенти'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьГруппыДоступаКонтрагентов",
		"НастройкиПользователейИПрав",
		НСтр("ru='Группы доступа контрагентов';uk='Групи доступу контрагентів'"),
		НСтр("ru='Создание групп доступа контрагентов.';uk='Створення груп доступу контрагентів.'"),
		"e1cib/list/Справочник.ГруппыДоступаКонтрагентов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ОграничиватьДоступНаУровнеЗаписей";
	НоваяНастройка.Зависимости = "ОграничиватьДоступНаУровнеЗаписей,ИспользоватьГруппыДоступаКонтрагентов";
	НоваяНастройка.Теги = НСтр("ru='Контрагенты';uk='Контрагенти'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияОНастройкеПравДоступа",
		"НастройкиПользователейИПрав",
		НСтр("ru='Подробнее о возможностях прав доступа пользователей';uk='Детальніше про можливості прав доступу користувачів'"),
		НСтр("ru='Статья на ресурсе its.1c.ru, в которой подробно описываются возможности и различные варианты настроек прав доступа пользователей.';uk='Стаття на ресурсі its.1c.ru, у якій докладно описуються можливості й різні варіанти налаштувань прав доступу користувачів.'"),
		"http://its.1c.ru/db/updinfo#content:142:1:issogl2_8"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	//Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
	//	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
	//		"ИспользоватьПроверкуКонтрагентов",
	//		"ПроверкаКонтрагентов",
	//		НСтр("ru='Автоматически проверять контрагентов по ЕГРН';uk='Автоматично перевіряти контрагентів по ЄДРП'"),
	//		НСтр("ru='Включение автоматической проверки может замедлить открытие документов на медленных компьютерах. Для таких компьютеров рекомендуется использовать ручную проверку по кнопке в подменю Еще.';uk='Включення автоматичної перевірки може уповільнити відкриття документів на повільних комп`ютерах. Для таких комп`ютерів рекомендується використовувати ручну перевірку по кнопці в підміню Ще.'")
	//	);
	//	НоваяНастройка.ПравоРедактирования = Истина;
	//	НоваяНастройка.Теги = НСтр("ru='Контрагенты';uk='Контрагенти'");
	//КонецЕсли;
	
	//Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
	//	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
	//		"ПодробнееОПроверкеКонтрагентов",
	//		"ПроверкаКонтрагентов",
	//		НСтр("ru='Подробнее о сервисе';uk='Детальніше про сервіс'"),
	//		НСтр("ru=''"),
	//		"e1cib/app/Обработка.ИнструкцияПоИспользованиюПроверкиКонтрагента"
	//	);
	//	НоваяНастройка.ПравоРедактирования = Истина;
	//	НоваяНастройка.ВместеС = "ИспользоватьПроверкуКонтрагентов";
	//	НоваяНастройка.Теги = НСтр("ru='Контрагенты';uk='Контрагенти'");
	//КонецЕсли;
	
	//Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
	//	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
	//		"ПроверитьДоступКСервисуПроверкиКонтрагентов",
	//		"ПроверкаКонтрагентов",
	//		НСтр("ru='Проверить доступ к веб-сервису';uk='Перевірити доступ до веб-сервісу'"),
	//		НСтр("ru=''")
	//	);
	//	НоваяНастройка.ПравоРедактирования = Истина;
	//	НоваяНастройка.ВместеС = "ИспользоватьПроверкуКонтрагентов";
	//	НоваяНастройка.Теги = НСтр("ru='Контрагенты';uk='Контрагенти'");
	//КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПоискИУдалениеДублей",
		"КорректировкаДанных",
		НСтр("ru='Поиск и удаление дублей';uk='Пошук і видалення дублів'"),
		НСтр("ru='Поиск похожих элементов по заданным условиям сравнения.';uk='Пошук схожих елементів по заданих умовах порівняння.'"),
		"e1cib/app/Обработка.ПоискИУдалениеДублей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ГрупповоеИзменениеРеквизитов",
			"КорректировкаДанных",
			НСтр("ru='Групповое изменение реквизитов';uk='Групова зміна реквізитів'"),
			НСтр("ru='Изменение реквизитов и табличных частей в выбранных элементах.';uk='Зміна реквізитів і табличних частин в обраних елементах.'"),
			"e1cib/app/Обработка.ГрупповоеИзменениеРеквизитов"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ГрупповоеПерепроведениеДокументов",
			"КорректировкаДанных",
			НСтр("ru='Групповое перепроведение документов';uk='Групове перепроведення документів'"),
			НСтр("ru='Переход к обработке, предназначеной для группового перепроведения документов.';uk='Перехід до обробки, призначеної для групового перепроведення документів.'"),
			"e1cib/app/Обработка.ГрупповоеПерепроведениеДокументов"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОчисткаИсторииОбсуждений",
		"КорректировкаДанных",
		НСтр("ru='Очистка истории обсуждений';uk='Очищення історії обговорень'"),
		НСтр("ru='Удаление истории изменений объектов и сообщений пользователей в обсуждениях.';uk='Видалення історії змін об`єктів і повідомлень користувачів в обговореннях.'"),
		"e1cib/app/Обработка.ОчисткаИсторииОбсуждений"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьДокументыКорректировкиРегистров",
		"КорректировкаДанных",
		НСтр("ru='Список документов ""Корректировка регистров""';uk='Список документів ""Коригування регістрів""'"),
		НСтр("ru='Переход к списку документов ""Корректировка регистров"".';uk='Перехід до списку документів ""Коригування регістрів"".'"),
		"e1cib/list/Документ.КорректировкаРегистров"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"МакетыПечатныхФорм",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ru='Макеты печатных форм';uk='Макети друкованих форм'"),
		НСтр("ru='Настройка макетов печатных форм документов.';uk='Налаштування макетів друкованих форм документів.'"),
		"e1cib/list/РегистрСведений.ПользовательскиеМакетыПечати"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ПодменюПечать",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ru='Подменю ""Печать""';uk='Підменю ""Друк""'"),
		НСтр("ru='Настройка видимости команд печати в формах.';uk='Налаштування видимості команд друку у формах.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьВариантыОтчетов",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ru='Отчеты конфигурации';uk='Звіти конфігурації'"),
		НСтр("ru='Просмотр списка всех вариантов отчетов, настройки отчета доступны через контекстное меню.';uk='Перегляд списку всіх варіантів звітів, налаштування звіту доступне через контекстне меню.'"),
		"e1cib/command/ОбщаяКоманда.ПанельОтчетов"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"УниверсальныйОтчет",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ru='Универсальный отчет';uk='Універсальний звіт'"),
		НСтр("ru='Универсальный отчет по справочникам, документам, регистрам и т.д.';uk='Універсальний звіт за довідниками, документами, регістрами і т.і.'"),
		"e1cib/app/Отчет.УниверсальныйОтчет"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РассылкаОтчетов.ПравоДобавления() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОткрытьРассылкиОтчетов",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ru='Рассылки отчетов';uk='Розсилання звітів'"),
			НСтр("ru='Настройка списка рассылок отчетов, отправка по требованию или автоматически по расписанию.';uk='Налаштування списку розсилань звітів, відправлення на вимогу або автоматично за розкладом.'"),
			"e1cib/list/Справочник.РассылкиОтчетов"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьДополнительныеОтчетыИОбработки",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ru='Дополнительные отчеты и обработки';uk='Додаткові звіти й обробки'"),
			НСтр("ru='Использование внешних печатных форм, отчетов и обработок в дополнение к предусмотренным в программе.';uk='Використання зовнішніх друкованих форм, звітів та обробок на "
"додаток до передбачених у програмі.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Или Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОткрытьДополнительныеОтчетыИОбработки",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ru='Дополнительные отчеты и обработки';uk='Додаткові звіти й обробки'"),
			НСтр("ru='Подключение внешних печатных форм, отчетов и обработок в дополнение к предусмотренным в программе.';uk='Підключення зовнішніх друкованих форм, звітів та обробок на "
"додаток до передбачених у програмі.'"),
			"e1cib/list/Справочник.ДополнительныеОтчетыИОбработки"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьДополнительныеОтчетыИОбработки";
		НоваяНастройка.Зависимости = "ИспользоватьДополнительныеОтчетыИОбработки";
	КонецЕсли;
	
	Если ?(РежимРаботы.МодельСервиса, РежимРаботы.ЭтоАдминистраторПрограммы, РежимРаботы.ЭтоАдминистраторСистемы) Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ДополнительныеОбработкиПоАдминистрированию",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ru='Дополнительные обработки по администрированию';uk='Додаткові обробки з адміністрування'"),
			НСтр("ru='Команды дополнительных обработок, подключенных к программе.';uk='Команди додаткових обробок, підключених до програми.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ИспользоватьДополнительныеОтчетыИОбработки";
		НоваяНастройка.Зависимости = "ИспользоватьДополнительныеОтчетыИОбработки";
	КонецЕсли;
	
	Если Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"РасширенияПрограммы",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ru='Расширение возможностей программы';uk='Розширення можливостей програми'"),
			НСтр("ru='Подключение расширений: разделов, отчетов и обработок в дополнение к предусмотренным в программе.';uk='Підключення розширень: розділів, звітів і обробок на додаток до передбачених у програмі.'")
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьНастройкиСистемнойУчетнойЗаписиЭП",
		"Органайзер",
		НСтр("ru='Настройка системной учетной записи почты';uk='Налаштування системного облікового запису пошти'"),
		НСтр("ru='Основная учетная запись электронной почты для отправки уведомлений из программы.';uk='Основний обліковий запис електронної пошти для відправки повідомлень з програми.'"),
		"e1cib/command/ОбщаяКоманда.НастройкаСистемнойУчетнойЗаписиЭлектроннойПочты"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Событие';uk='Подія'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьУчетныеЗаписиЭлектроннойПочты",
		"Органайзер",
		НСтр("ru='Учетные записи электронной почты';uk='Облікові записи електронної пошти'"),
		НСтр("ru='Настройка учетных записей электронной почты.';uk='Налаштування облікових записів електронної пошти.'"),
		"e1cib/list/Справочник.УчетныеЗаписиЭлектроннойПочты"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Событие';uk='Подія'");
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическиЗагружатьПочту",
			"Органайзер",
			НСтр("ru='Автоматически загружать почту';uk='Автоматично завантажувати пошту'"),
			НСтр("ru='Автоматическая загрузка почты по расписанию.';uk='Автоматичне завантаження пошти за розкладом.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ru='Событие';uk='Подія'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"АвтоматическиЗагружатьЭлектроннуюПочтуРасписание",
			"Органайзер",
			НСтр("ru='Расписание';uk='Розклад'"),
			НСтр("ru='Настройка расписания для загрузки электронной почты.';uk='Налаштування розкладу для завантаження електронної пошти.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "АвтоматическиЗагружатьПочту";
		НоваяНастройка.Зависимости = "АвтоматическиЗагружатьПочту";
		НоваяНастройка.Теги = НСтр("ru='Событие';uk='Подія'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НапоминанияПользователей",
		"Органайзер",
		НСтр("ru='Напоминания пользователей';uk='Нагадування користувачів'"),
		НСтр("ru='Переход к списку всех напоминаний всех пользователей. Инструмент предназначен для администраторов приложений.';uk='Перехід до списку всіх нагадувань усіх користувачів. Інструмент призначений для адміністраторів додатків.'"),
		"e1cib/list/РегистрСведений.НапоминанияПользователя"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаОтправкиSMS",
		"Органайзер",
		НСтр("ru='Настройка отправки SMS';uk='Налаштування відправки SMS'"),
		НСтр("ru='Эта настройка используется для отправки SMS сообщений из программы.';uk='Це налаштування використовується для відправки SMS повідомлень з програми.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ХранитьФайлыВТомахНаДиске",
			"НастройкиРаботыСФайлами",
			НСтр("ru='Хранить файлы в томах на диске';uk='Зберігати файли в томах на диску'"),
			НСтр("ru='Выбор между хранением файлов в информационной базе или в томах на диске.';uk='Вибір між збереженням файлів в інформаційній базі або в томах на "
"диску.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ТомаХраненияФайлов",
			"НастройкиРаботыСФайлами",
			НСтр("ru='Тома хранения файлов';uk='Томи зберігання файлів'"),
			НСтр("ru='Настройка подключения к томам (папкам) хранения файлов на файловом сервере.';uk='Налаштування підключення до томів (папок) зберігання файлів на файловому сервері.'"),
			"e1cib/list/Справочник.ТомаХраненияФайлов"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ХранитьФайлыВТомахНаДиске";
		НоваяНастройка.Зависимости = "ХранитьФайлыВТомахНаДиске";
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "МаксимальныйРазмерФайла";
		НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
		НоваяНастройка.Представление	= НСтр("ru='Максимальный размер файла (Мбайт)';uk='Максимальний розмір файлу (Мбайт)'");
		НоваяНастройка.Описание			= НСтр("ru='Ограничение загрузки файлов, превышающих указанный размер.';uk='Обмеження завантаження файлів, що перевищують зазначений розмір.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 8);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если Не (РежимРаботы.Локальный Или РежимРаботы.Автономный) Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "МаксимальныйРазмерФайлаОбластиДанных";
		НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
		НоваяНастройка.Представление	= НСтр("ru='Максимальный размер файла (Мбайт)';uk='Максимальний розмір файлу (Мбайт)'");
		НоваяНастройка.Описание			= НСтр("ru='Ограничение загрузки файлов, превышающих указанный размер.';uk='Обмеження завантаження файлів, що перевищують зазначений розмір.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 8);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаОчисткиФайлов",
		"НастройкиРаботыСФайлами",
		НСтр("ru='Настройка очистки файлов';uk='Налаштування очищення файлів'"),
		НСтр("ru='Переход к форме, которая позволяет настроить расписание автоматического удаления устаревших присоединенных файлов';uk='Перехід до форми, яка дозволяє настроїти розклад автоматичного видалення застарілих приєднаних файлів'"),
		"e1cib/list/РегистрСведений.НастройкиОчисткиФайлов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СписокРасширенийТекстовыхФайлов";
	НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
	НоваяНастройка.Представление	= НСтр("ru='Расширения текстовых файлов';uk='Розширення текстових файлів'");
	НоваяНастройка.Описание			= НСтр("ru='Расширения файлов, содержащих текстовые данные (указываются через ""пробел"").';uk='Розширення файлів, що містять текстові дані (вказуються через ""пробіл"").'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СписокРасширенийФайловOpenDocumentОбластиДанных";
	НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
	НоваяНастройка.Представление	= НСтр("ru='Расширения файлов Open Document';uk='Розширення файлів Open Document'");
	НоваяНастройка.Описание			= НСтр("ru='Расширения файлов открытого формата документов (ODF) для офисных приложений (указываются через ""пробел"").';uk='Розширення файлів відкритого формату документів (ODF) для офісних додатків (вказуються через ""пробіл"").'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ЗапрещатьЗагрузкуФайловПоРасширению",
		"НастройкиРаботыСФайлами",
		НСтр("ru='Запрет загрузки файлов с расширениями';uk='Заборона завантаження файлів з розширеннями'"),
		НСтр("ru=''")
	);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СписокЗапрещенныхРасширенийОбластиДанных";
	НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
	НоваяНастройка.Представление	= НСтр("ru='Список запрещенных расширений';uk='Список заборонених розширень'");
	НоваяНастройка.Описание			= НСтр("ru='Расширения файлов, для которых будет запрещена загрузка в папки программы (указываются через ""пробел"").';uk='Розширення файлів, для яких буде заборонено завантаження в папки програми (вказуються через ""пробіл"").'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "Список запрещенных расширений");
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ЗапрещатьЗагрузкуФайловПоРасширению";
	НоваяНастройка.Зависимости = "ЗапрещатьЗагрузкуФайловПоРасширению";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СинхронизироватьФайлы",
		"НастройкиРаботыСФайлами",
		НСтр("ru='Синхронизировать файлы с облачными сервисами';uk='Синхронізувати файли з хмарними сервісами'"),
		НСтр("ru='Синхронизация с Яндекс.Диск, Box и т.д. для упрощения редактирования файлов.';uk='Синхронізація з Яндекс.Діск, Box і т.і. для спрощення редагування файлів.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Файлы';uk='Файли'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиСинхронизацииФайлов",
		"НастройкиРаботыСФайлами",
		НСтр("ru='Настройки синхронизации файлов';uk='Налаштування синхронізації файлів'"),
		НСтр("ru='Настройка правил синхронизации файлов.';uk='Налаштування правил синхронізації файлів.'"),
		"e1cib/list/РегистрСведений.НастройкиСинхронизацииФайлов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "СинхронизироватьФайлы";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодключаемоеОборудование",
		"ПодключаемоеОборудование",
		НСтр("ru='Подключаемое оборудование';uk='Підключаєме обладнання'"),
		НСтр("ru='Включение позволяет организовать работу с использованием внешнего подключаемого оборудования: весов, принтеров этикеток, терминалов сбора данных и т.д.';uk='Включення дозволяє організувати роботу з використанням зовнішнього підключаємого обладнання: ваг, принтерів етикеток, терміналів збору даних і т.і.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Операция по платежным картам,Поступление в кассу,Начальные остатки прочее,Начальные остатки расчетов,Начальные остатки товаров,Ввод начальных остатков';uk='Замовлення покупця,Операція по платіжних картах,Надходження в касу,Початкові залишки інше,Початкові залишки розрахунків,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьПодключаемоеОборудование",
		"ПодключаемоеОборудование",
		НСтр("ru='Подключаемое оборудование';uk='Підключаєме обладнання'"),
		НСтр("ru='Подключение и настройка используемого оборудования.';uk='Підключення і налаштування використовуваного обладнання.'"),
		"e1cib/command/Справочник.ПодключаемоеОборудование.Команда.ОткрытьПодключаемоеОборудование"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Начальные остатки прочее,Начальные остатки расчетов,Начальные остатки товаров,Ввод начальных остатков';uk='Замовлення покупця,Початкові залишки інше,Початкові залишки розрахунків,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьРабочиеМеста",
		"ПодключаемоеОборудование",
		НСтр("ru='Открыть рабочие места';uk='Відкрити робочі місця'"),
		НСтр("ru='Переход к списку рабочих мест.';uk='Перехід до списку робочих місць.'"),
		"e1cib/list/Справочник.РабочиеМеста"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Начальные остатки прочее,Начальные остатки расчетов,Начальные остатки товаров,Ввод начальных остатков';uk='Замовлення покупця,Початкові залишки інше,Початкові залишки розрахунків,Початкові залишки товарів,Введення початкових залишків'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбменСПодключаемымОборудованиемOffline",
		"ПодключаемоеОборудование",
		НСтр("ru='Обмен с подключаемым оборудованием offline';uk='Обмін з підключаємим обладнанням offline'"),
		НСтр("ru='Включение опции необходимо для использования касс ККМ, весов с печатью этикеток.';uk='Включення опції необхідно для використання кас ККМ, ваг з друком етикеток.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя';uk='Замовлення покупця'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПравилаОбменаСПодключаемымОборудованием",
		"ПодключаемоеОборудование",
		НСтр("ru='Правила обмена с подключаемым оборудованием';uk='Правила обміну з підключаємим обладнанням'"),
		НСтр("ru='Правила обмена используются при работе с кассами ККМ и электронными весами, которые работают в режиме OffLine.';uk='Правила обміну використовуються при роботі з касами ККМ і електронними вагами, які працюють у режимі Offline.'"),
		"e1cib/list/Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьОбменСПодключаемымОборудованиемOffline";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование,ИспользоватьОбменСПодключаемымОборудованиемOffline";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя';uk='Замовлення покупця'");
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ОтправлятьДанныеВЦентрМониторинга";
		НоваяНастройка.Раздел			= "ОценкаПроизводительностиИЦентрМониторинга";
		НоваяНастройка.Представление	= НСтр("ru='Отправлять данные в центр мониторинга';uk='Відправляти дані в центр моніторингу'");
		НоваяНастройка.Описание			= НСтр("ru='Статистические отчеты позволяют нам определить наиболее востребованные механизмы в программе. Их мы стараемся улучшить в первую очередь."
""
"Собранные сведения являются обезличенными и содержат только статистические показатели. Подготовка и отправка отчетов не замедлит работу программы.';uk='Статистичні звіти дозволяють нам визначити найбільш затребувані механізми в програмі. Їх ми намагаємося поліпшити в першу чергу."
""
"Зібрані відомості є знеособленими і містять тільки статистичні показники. Підготовка та відправка звітів не уповільнює роботу програми. '");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("КоличествоКолонок", 1);
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(0, НСтр("ru='Разрешить отправку сведений в фирму ""1С""';uk='Дозволити відправлення відомостей у фірму ""1С""'"));
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(1, НСтр("ru='Разрешить отправку сведений стороннему разработчику';uk='Дозволити відправлення відомостей сторонньому розробнику'"));
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(2, НСтр("ru='Запретить отправку сведений';uk='Заборонити відправлення відомостей'"));
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "АдресСервисаЦентраМониторинга";
		НоваяНастройка.Раздел			= "ОценкаПроизводительностиИЦентрМониторинга";
		НоваяНастройка.Представление	= НСтр("ru='Адрес сервиса центра мониторинга';uk='Адреса сервісу центру моніторингу'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", НСтр("ru='Адрес сервиса';uk='Адреса сервісу'"));
		НоваяНастройка.СвойстваЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("МаксимальнаяШирина", 60);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ОтправлятьДанныеВЦентрМониторинга";
		НоваяНастройка.Зависимости = "ОтправлятьДанныеВЦентрМониторинга";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ВыполнятьЗамерыПроизводительности",
			"ОценкаПроизводительностиИЦентрМониторинга",
			НСтр("ru='Выполнять замеры производительности';uk='Виконувати заміри продуктивності'"),
			НСтр("ru='Оценка интегральной производительности программы по методике APDEX.';uk='Оцінка інтегральної продуктивності програми за методикою "
"APDEX.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОценкаПроизводительности",
			"ОценкаПроизводительностиИЦентрМониторинга",
			НСтр("ru='Показатели производительности';uk='Показники продуктивності'"),
			НСтр("ru='Просмотр и оценка результатов замеров производительности.';uk='Перегляд та оцінка результатів вимірів продуктивності.'"),
			"e1cib/app/Обработка.ОценкаПроизводительности"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ВыполнятьЗамерыПроизводительности";
		НоваяНастройка.Зависимости = "ВыполнятьЗамерыПроизводительности";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"НастройкиОценкиПроизводительности",
			"ОценкаПроизводительностиИЦентрМониторинга",
			НСтр("ru='Настройки оценки производительности';uk='Налаштування оцінки продуктивності'"),
			НСтр("ru='Настройки параметров оценки производительности.';uk='Налаштування параметрів оцінки продуктивності.'"),
			"e1cib/command/Обработка.ОценкаПроизводительности.Команда.НастройкиОценкиПроизводительности"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ВыполнятьЗамерыПроизводительности";
		НоваяНастройка.Зависимости = "ВыполнятьЗамерыПроизводительности";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"РегламентныеИФоновыеЗадания",
			"РегламентныеОперации",
			НСтр("ru='Регламентные и фоновые задания';uk='Регламентні й фонові завдання'"),
			НСтр("ru='Планирование и запуск регламентных заданий.';uk='Планування і запуск регламентних завдань.'"),
			"e1cib/app/Обработка.РегламентныеИФоновыеЗадания"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"РазблокироватьРаботуСВнешнимиРесурсами",
			"РегламентныеОперации",
			НСтр("ru='Разблокировать работу с внешними ресурсами';uk='Розблокувати роботу із зовнішніми ресурсами'"),
			НСтр("ru='Работа со всеми внешними ресурсами (синхронизация данных, отправка почты и т.п.), выполняемая по расписанию заблокирована для предотвращения конфликтов с основной информационной базой.';uk='Робота з усіма зовнішніми ресурсами (синхронізація даних, відправка пошти тощо), що виконується за розкладом заблокована для запобігання конфліктів з основною інформаційною базою.'"),
			"e1cib/command/ОбщаяКоманда.РазблокироватьРаботуСВнешнимиРесурсами"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы И (РежимРаботы.Локальный Или РежимРаботы.Автономный) Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"УправлениеИтогамиИАгрегатами",
			"РегламентныеОперации",
			НСтр("ru='Управление итогами и агрегатами';uk='Управління підсумками і агрегатами'"),
			НСтр("ru='Установка периода рассчитанных итогов."
"Перестройка, заполнение и оптимизация агрегатов.';uk='Встановлення періоду розрахованих підсумків."
"Перебудова, заповнення та оптимізація агрегатів.'"),
			"e1cib/app/Обработка.УправлениеИтогамиИАгрегатами"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"УправлениеПолнотекстовымПоискомИИзвлечениемТекстов",
			"РегламентныеОперации",
			НСтр("ru='Управление полнотекстовым поиском';uk='Управління повнотекстовим пошуком'"),
			НСтр("ru='Обновление и очистка индекса полнотекстового поиска."
"Управление извлечением текстов из файлов.';uk='Оновлення та очищення індексу повнотекстового пошуку."
"Управління вилученням текстів з файлів.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическоеУдалениеПомеченных",
			"РегламентныеОперации",
			НСтр("ru='Автоматически удалять помеченные объекты по расписанию';uk='Автоматично видаляти позначені об`єкти за розкладом'"),
			НСтр("ru='Включение позволяет выполнять автоматическое удаление объектов, помеченных на удаление, в соответствии с заданным расписанием.';uk='Включення дозволяє виконувати автоматичне видалення об`єктів, позначених на видалення, відповідно до заданого розкладу.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "УдалениеПомеченныхРасписание";
		НоваяНастройка.Раздел			= "РегламентныеОперации";
		НоваяНастройка.Представление	= НСтр("ru='Расписание';uk='Розклад'");
		НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "АвтоматическоеУдалениеПомеченных";
		НоваяНастройка.Зависимости = "АвтоматическоеУдалениеПомеченных";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСлужебныхСобытий

Процедура ПриПолученииЗначенияНастройки(знач Идентификатор, Значение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Идентификатор = "ИспользоватьРемонты2" Тогда
		
		Значение = Константы.ИспользоватьРемонты.Получить();
		
	ИначеЕсли Идентификатор = "ОтправлятьСлепыеКопииПисем" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПараметрыОтправкиСкрытыхКопий", "ОтправлятьСлепыеКопииПисем", Ложь);
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПараметрыОтправкиСкрытыхКопий", "АдресПолучателяСкрытойКопии", "");
		
	//ИначеЕсли Идентификатор = "ИмяОтправителяSMS" Тогда
	//	
	//	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиSMS", "ИмяОтправителяSMS", "");
		
	ИначеЕсли Идентификатор = "ЗагрузкаКонтактовGoogle" Тогда
		
		ОтключенныеОбластиДоступа = РегистрыСведений.СеансовыеДанныеGoogle.ОтключенныеОбластиДоступа(Пользователи.ТекущийПользователь());
		Значение = ОтключенныеОбластиДоступа.Найти(Перечисления.ОбластиДоступаGoogle.Контакты) = Неопределено;
		Если Значение И РегистрыСведений.СчетчикиПодсказок.ПревышеноЗначение(Перечисления.ВидыПодсказок.Google, 5,,, Ложь) Тогда
			Значение = Ложь;
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "СинхронизацияКалендаряGoogle" Тогда
		
		ОтключенныеОбластиДоступа = РегистрыСведений.СеансовыеДанныеGoogle.ОтключенныеОбластиДоступа(Пользователи.ТекущийПользователь());
		Значение = ОтключенныеОбластиДоступа.Найти(Перечисления.ОбластиДоступаGoogle.Календарь) = Неопределено;
		
	ИначеЕсли Идентификатор = "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы", Истина);
		
	ИначеЕсли Идентификатор = "СпрашиватьРежимРедактированияПриОткрытииФайла" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиОткрытияФайлов", "СпрашиватьРежимРедактированияПриОткрытииФайла", Истина);
		
	ИначеЕсли Идентификатор = "ПоказыватьПодсказкиПриРедактированииФайлов" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиОткрытияФайлов", "ПоказыватьПодсказкиПриРедактированииФайлов", Истина);
		
	ИначеЕсли Идентификатор = "ДействиеСФайламиПоДвойномуЩелчкуМыши" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиОткрытияФайлов", "ДействиеПоДвойномуЩелчкуМыши", Перечисления.ДействияСФайламиПоДвойномуЩелчку.ОткрыватьФайл);
		
	ИначеЕсли Идентификатор = "СпособСравненияВерсийФайлов" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиСравненияФайлов", "СпособСравненияВерсийФайлов", Перечисления.СпособыСравненияВерсийФайлов.MicrosoftOfficeWord);
		
	ИначеЕсли Идентификатор = "ПодтверждениеПриЗавершенииПрограммы" Тогда
		
		Значение = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
		
	ИначеЕсли Идентификатор = "КонтрольДоговоровПриПроведенииДокументов" Тогда
		
		Значение = ?(Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Получить(), 1, 0);
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОтправкаОформленныхЭД);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "АвтоматическоеПолучениеЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПолучениеНовыхЭД);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "ЧасовойПоясПрограммы" Тогда
		
		Значение = ПолучитьЧасовойПоясИнформационнойБазы();
		Если ПустаяСтрока(Значение) Тогда
			Значение = ЧасовойПояс();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "КаталогДистрибутиваПлатформы" Тогда
		
		Каталог = ПолучениеОбновленийПрограммы.КаталогСохраненияПоследнегоПолученногоДистрибутива();
		Значение = ?(ПустаяСтрока(Каталог), НСтр("ru='<Еще не сохранялся>';uk='<Ще не зберігався>'"), Каталог);
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьПочту" Тогда
		
		РегЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(Перечисления.ОбластиДоступаGoogle.Почта);
		Значение = ?(РегЗадание = Неопределено, Ложь, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайла" Тогда
		
		Значение = ФайловыеФункции.МаксимальныйРазмерФайлаОбщий() / (1024*1024);
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайлаОбластиДанных" Тогда
		
		Значение = ФайловыеФункции.МаксимальныйРазмерФайла() / (1024*1024);
		
	ИначеЕсли Идентификатор = "ИспользоватьЭлектронныеПодписи2" Тогда
		
		Значение = Константы.ИспользоватьЭлектронныеПодписи.Получить();
		
	ИначеЕсли Идентификатор = "ОтправлятьДанныеВЦентрМониторинга" Тогда
		
		Значение = УправлениеНебольшойФирмойСервер.ПолучитьПереключательОтправкиДанных();
		
	ИначеЕсли Идентификатор = "АдресСервисаЦентраМониторинга" Тогда
		
		Значение = УправлениеНебольшойФирмойСервер.ПолучитьАдресСервисаЦентраМониторинга();
		
	ИначеЕсли Идентификатор = "АвтоматическоеУдалениеПомеченных" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.УдалениеПомеченных);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриПроверкеКорректностиНастройки(знач Идентификатор, НовоеЗначение, ТекстОшибки, Отказ) Экспорт
	
	Если Идентификатор = "ИспользоватьНесколькоОрганизаций" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьИспользоватьНесколькоОрганизаций();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "УчетПоКомпании" Тогда
		
		Если НовоеЗначение Тогда
			Если УправлениеНебольшойФирмойСервер.ЕстьДвиженияПоДругимОрганизациям(Справочники.Организации.ОсновнаяОрганизация) Тогда
				ТекстОшибки = НСтр("ru='В базе есть движения по организации, отличной от основной. Для включения опции необходимо очистить данные по прочим организациям.';uk='У базі є рухи по організації, відмінной від основної. Для включення опції необхідно очистити дані по іншим організаціям.'");
			КонецЕсли;
		Иначе
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьУчетПоКомпании();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "Компания" Тогда
		
		Если Не ЗначениеЗаполнено(НовоеЗначение) И Константы.УчетПоКомпании.Получить() Тогда
			ТекстОшибки = НСтр("ru='Не заполнена организация-компания для ведения учета по компании';uk='Не заповнена організація-компанія для ведення обліку по компанії'");
		ИначеЕсли НовоеЗначение <> Константы.Компания.Получить() Тогда
			Если УправлениеНебольшойФирмойСервер.ЕстьДвиженияПоДругимОрганизациям(НовоеЗначение) Тогда
				ТекстОшибки = НСтр("ru='В базе есть движения по организации, отличной от выбранной. Для включения опции необходимо очистить данные по прочим организациям.';uk='У базі є рухи по організації, відмінной від обраної. Для включення опції необхідно очистити дані по іншим організаціям.'");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоНесколькимПодразделениям" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
			И Справочники.СтруктурныеЕдиницы.КоличествоСтруктурныхЕдиниц(Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, Ложь) > 0 Тогда
			
			ТекстОшибки = НСтр("ru='В базе имеются подразделения, отличные от основного! Снятие опции запрещено!';uk='У базі є підрозділи, відмінні від основного! Зняття опції заборонено!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить()
			И Справочники.НаправленияДеятельности.КоличествоНаправленийДеятельности(Ложь, Ложь) > 0 Тогда
			
			ТекстОшибки = НСтр("ru='В базе имеются направления деятельности, отличные от основного! Снятие опции запрещено!';uk='У базі є напрямки діяльності, відмінні від основного! Зняття опції заборонено!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов" Тогда
		
		Если НовоеЗначение И Не Константы.ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов.Получить()
			И Не ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям")
			И РегистрыНакопления.РасчетыПоЭквайрингу.ЕстьДвиженияПоЭквайрингу() Тогда
			
			ТекстОшибки = НСтр("ru='Регистр накопления ""Расчеты по эквайрингу"" содержит информацию об эквайринговых операциях! Установка опции запрещена!"
"Выполнить анализ можно в отчете ""Расчеты по эквайрингу (сводно)"" с детализацией до регистратора. Отчет вызывается из раздела ""Деньги"".';uk='Регістр накопичення ""Розрахунки по еквайрингові"" містить інформацію по еквайрингових операціях! Установка опції заборонена!"
"Виконати аналіз можна у звіті ""Розрахунки по еквайрингові (сводно)"" з деталізацією до реєстратора. Звіт викликається з розділу ""Гроші"".'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетВнеоборотныхАктивов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетВнеоборотныхАктивов.Получить()
			И Справочники.ВнеоборотныеАктивы.ЕстьДвиженияПоВнеоборотнымАктивам() Тогда
			
			ТекстОшибки = НСтр("ru='В базе присутствуют движения по внеоборотным активам! Снятие опции запрещено!';uk='У базі присутні рухи по позаоборотних активах! Зняття опції заборонено!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСкидкиНаценки();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьДисконтныеКарты" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьДисконтныеКарты.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьДисконтныеКарты();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПередачаТоваровНаКомиссию" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПередачаТоваровНаКомиссию.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПередачаТоваровНаКомиссию();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемТоваровНаКомиссию" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПриемТоваровНаКомиссию.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПриемТоваровНаКомиссию();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты" Тогда
		
		Если Не НовоеЗначение И Константы.ИспользоватьРемонты.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьРемонты();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьВидыЗаказовПокупателей" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьВидыЗаказовПокупателей();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетРозничныхПродаж" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетРозничныхПродаж();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек.Получить() Тогда
		ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговле();
КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьБиллинг" Тогда
		
		Если НЕ НовоеЗначение И Справочники.ДоговорыКонтрагентов.ЕстьДоговорыОбслуживания() Тогда
			ТекстОшибки = НСтр("ru='В базе имеются договоры обслуживания! Снятие опции запрещено!';uk='У базі є договори обслуговування! Зняття опції заборонено!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "БиллингВестиУчетРасходовПоДоговорамОбслуживания" Тогда
		
		Если НЕ НовоеЗначение И Справочники.ДоговорыКонтрагентов.ЕстьДоговорыОбслуживанияСУникальнымиНаправлениямиДеятельности() Тогда
			ТекстОшибки = НСтр("ru='В базе имеются договоры обслуживания с выбранными направлениями деятельности! Снятие опции запрещено!';uk='У базі є договори обслуговування з обраними напрямками діяльності! Зняття опції заборонено!'");
		КонецЕсли;
		Если НЕ НовоеЗначение И Справочники.ТарифныеПланыДоговоровОбслуживания.ЕстьТарифныеПланыСУчетомЗатрат() Тогда
			ТекстОшибки = НСтр("ru='В базе имеются тарифные планы с заданными правилами выставления затрат! Снятие опции запрещено!';uk='У базі є тарифні плани з заданими правилами виставлення витрат! Зняття опції заборонено!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоНесколькимСкладам" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятиеУчетПоНесколькимСкладам();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьХарактеристики" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьХарактеристики();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПартии" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПартии.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПартии();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьСерийныеНомера" Тогда
		
		Если Не НовоеЗначение И Константы.ИспользоватьСерийныеНомера.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСерийныеНомера();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "КонтрольОстатковСерийныхНомеров" Тогда
		
		Если НовоеЗначение = Ложь И 
			Константы.КонтрольОстатковСерийныхНомеров.Получить()=Истина Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСерийныеНомера();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетЦенКонтрагентов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетЦенКонтрагентов.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетЦенКонтрагентов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияРезервированиеЗапасов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияРезервированиеЗапасов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемЗапасовНаОтветхранение" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПриемЗапасовНаОтветхранение.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПриемЗапасовНаОтветхранение();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПередачаСырьяВПереработку" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПередачаСырьяВПереработку.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПередачаСырьяВПереработку();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПередачаЗапасовНаОтветхранение" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПередачаЗапасовНаОтветхранение.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПередачаЗапасовНаОтветхранение();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьОрдерныйСклад" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьОрдерныйСклад.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьОрдерныйСклад();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоЯчейкам" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоЯчейкам.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетПоЯчейкам();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодсистемуРаботы();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьВидыЗаказНарядов" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьВидыЗаказНарядов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		Если Не НовоеЗначение И Константы.ИспользоватьРемонты.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьРемонты();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодсистемуПроизводство();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьТехоперации" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьТехоперации.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьТехоперации();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПереработкаДавальческогоСырья" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПереработкаДавальческогоСырья.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПереработкаДавальческогоСырья();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяУчетВалютныхОпераций" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяУчетВалютныхОпераций.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяУчетВалютныхОпераций();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ВалютаУчета" Тогда
		
		ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказИзменитьВалютаУчета();
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияКредитыИЗаймы" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияКредитыИЗаймы.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияКредитыИЗаймы();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодсистемуЗарплата();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьСовместительство" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСовместительство();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов" Тогда
			
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов();
		КонецЕсли;
			
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		ТекстОшибки = СобытияУНФКлиентСервер.ПроверитьКорректностьАдресаЭлектроннойПочты(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ИдентификацияПриложенияGoogle" Тогда
		
		Если Не ПустаяСтрока(НовоеЗначение) Тогда
			ТекстОшибки = ОбменСGoogle.ИдентификацияПриложенияGoogleКорректна(НовоеЗначение);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьОбменССайтами" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьОбменССайтами.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьИспользоватьОбменССайтом();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьПочту" Тогда
		
		РегЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(Перечисления.ОбластиДоступаGoogle.Почта);
	Если РегЗадание = Неопределено Тогда
		ТекстОшибки = "Учетная запись электронной почты не подключена";
	КонецЕсли;

		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайла" Тогда
		
		ТекстОшибки = ?(НовоеЗначение = 0, НСтр("ru='Поле ""Максимальный размер файла"" не заполнено.';uk='Поле ""Максимальний розмір файлу"" не заповнене.'"),"");
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайлаОбластиДанных" Тогда
		
		ТекстОшибки = ?(НовоеЗначение = 0, НСтр("ru='Поле ""Максимальный размер файла"" не заполнено.';uk='Поле ""Максимальний розмір файлу"" не заповнене.'"),"");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеЗначенияНастройки(знач Идентификатор, НовоеЗначение, ОповещенияНаКлиенте, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Идентификатор = "ИспользоватьНесколькоОрганизаций" Тогда
		
		СтандартнаяОбработка = Истина;
		Если Не НовоеЗначение Тогда
			Константы.УчетПоКомпании.Установить(Ложь);
			Константы.Компания.Установить(Справочники.Организации.ПустаяСсылка());
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "УчетПоКомпании");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "Компания");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "УчетПоКомпании" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение И Не ЗначениеЗаполнено(Константы.Компания.Получить()) Тогда
			Константы.Компания.Установить(Справочники.Организации.ОсновнаяОрганизация);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "Компания");
		ИначеЕсли Не НовоеЗначение Тогда
			Константы.Компания.Установить(Справочники.Организации.ПустаяСсылка());
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "Компания");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение Тогда
			Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Установить(Истина);
			Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Установить(Истина);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ВестиУчетМаркировкиПродукцииВГИСМ" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение Тогда
			Константы.ИспользоватьСерийныеНомера.Установить(Истина);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ИспользоватьСерийныеНомера");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьДисконтныеКарты" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение И Не Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить() Тогда
			Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Установить(Истина);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек" Тогда
		
		Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек.Установить(НовоеЗначение);
Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговле.Установить(НовоеЗначение И Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить());
		
	ИначеЕсли Идентификатор = "ИспользоватьБиллинг" Тогда
		
		Константы.ИспользоватьБиллинг.Установить(НовоеЗначение);
		Если НовоеЗначение = Ложь Тогда
			Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Установить(Ложь);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "БиллингВестиУчетРасходовПоДоговорамОбслуживания" Тогда
		
		Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Установить(НовоеЗначение);
Если НовоеЗначение И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
			Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Установить(НовоеЗначение);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "БиллингГоловноеНаправлениеДеятельности" Тогда
		
		Константы.БиллингГоловноеНаправлениеДеятельности.Установить(НовоеЗначение);
		Справочники.НаправленияДеятельности.СгруппироватьНаправленияДеятельностиДоговоровОбслуживания();
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		Константы.ИспользоватьРемонты.Установить(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение = Ложь Тогда
			Константы.ФункциональнаяОпцияПереработкаДавальческогоСырья.Установить(Ложь);
			Константы.ФункциональнаяОпцияИспользоватьТехоперации.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияПереработкаДавальческогоСырья");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияИспользоватьТехоперации");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером" Тогда
		
		СтандартнаяОбработка = Истина;
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Получить() = Истина Тогда
			Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение = Ложь Тогда
			Константы.ФункциональнаяОпцияИспользоватьСовместительство.Установить(Ложь);
			Константы.ФункциональнаяОпцияВестиШтатноеРасписание.Установить(Ложь);
			Константы.ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияИспользоватьСовместительство");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияВестиШтатноеРасписание");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ОтправлятьСлепыеКопииПисем" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПараметрыОтправкиСкрытыхКопий", "ОтправлятьСлепыеКопииПисем", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПараметрыОтправкиСкрытыхКопий", "АдресПолучателяСкрытойКопии", НовоеЗначение);
		
	//ИначеЕсли Идентификатор = "ИмяОтправителяSMS" Тогда
	//	
	//	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиSMS", "ИмяОтправителяSMS", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ЗагрузкаКонтактовGoogle" Тогда
		
		Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "ОчиститьСеансовыеДанные", Новый Структура, Идентификатор);
		
		РегистрыСведений.СчетчикиПодсказок.Сбросить(Перечисления.ВидыПодсказок.Google);
		РегистрыСведений.СеансовыеДанныеGoogle.ОтключитьОбластьДоступа(
			Пользователи.ТекущийПользователь(),
			Перечисления.ОбластиДоступаGoogle.Контакты,
			Не НовоеЗначение);
		
	ИначеЕсли Идентификатор = "СинхронизацияКалендаряGoogle" Тогда
		
		Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "ОчиститьСеансовыеДанные", Новый Структура, Идентификатор);
		
		РегистрыСведений.СеансовыеДанныеGoogle.ОтключитьОбластьДоступа(
			Пользователи.ТекущийПользователь(),
			Перечисления.ОбластиДоступаGoogle.Календарь,
			Не НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиПрограммы", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "СпрашиватьРежимРедактированияПриОткрытииФайла" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиОткрытияФайлов", "СпрашиватьРежимРедактированияПриОткрытииФайла", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПоказыватьПодсказкиПриРедактированииФайлов" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиОткрытияФайлов", "ПоказыватьПодсказкиПриРедактированииФайлов", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ДействиеСФайламиПоДвойномуЩелчкуМыши" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиОткрытияФайлов", "ДействиеПоДвойномуЩелчкуМыши", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "СпособСравненияВерсийФайлов" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиСравненияФайлов", "СпособСравненияВерсийФайлов", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПодтверждениеПриЗавершенииПрограммы" Тогда
		
		ОбщегоНазначения.СохранитьПерсональныеНастройки(Новый Структура("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", НовоеЗначение));
		
	ИначеЕсли Идентификатор = "КонтрольДоговоровПриПроведенииДокументов" Тогда
		
		Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Установить(НовоеЗначение = 1);
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОтправкаОформленныхЭД);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "АвтоматическоеПолучениеЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПолучениеНовыхЭД);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "ЧасовойПоясПрограммы" Тогда
		
		Если НовоеЗначение <> ПолучитьЧасовойПоясИнформационнойБазы() Тогда 
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				ОбщегоНазначения.ЗаблокироватьИБ();
				УстановитьЧасовойПоясИнформационнойБазы(НовоеЗначение);
				ОбщегоНазначения.РазблокироватьИБ();
			Исключение
				ОбщегоНазначения.РазблокироватьИБ();
				ВызватьИсключение;
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
			УстановитьЧасовойПоясСеанса(НовоеЗначение);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ОграничиватьДоступНаУровнеЗаписей" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение = Ложь Тогда
			Константы.ИспользоватьГруппыДоступаКонтрагентов.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ИспользоватьГруппыДоступаКонтрагентов");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьПроверкуКонтрагентов" Тогда
		
		ПроверкаКонтрагентовВызовСервера.ПриВключенииВыключенииПроверки(НовоеЗначение = 1);
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьПочту" Тогда
		
		РегЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(Перечисления.ОбластиДоступаGoogle.Почта);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайла" Тогда
		
		Константы.МаксимальныйРазмерФайла.Установить(НовоеЗначение * 1024 * 1024);
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайлаОбластиДанных" Тогда
		
		Константы.МаксимальныйРазмерФайлаОбластиДанных.Установить(НовоеЗначение * 1024 * 1024);
		
	ИначеЕсли Идентификатор = "ИспользоватьЭлектронныеПодписи2" Тогда
		
		Константы.ИспользоватьЭлектронныеПодписи.Установить(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ОтправлятьДанныеВЦентрМониторинга" Тогда
		
		УправлениеНебольшойФирмойСервер.УстановитьПереключательОтправкиДанных(НовоеЗначение);
		Если НовоеЗначение = 0 Или НовоеЗначение = 2 Тогда
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "АдресСервисаЦентраМониторинга");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АдресСервисаЦентраМониторинга" Тогда
		
		УправлениеНебольшойФирмойСервер.УстановитьАдресСервисаЦентраМониторинга(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "АвтоматическоеУдалениеПомеченных" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.УдалениеПомеченных);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриОпределенииДоступности(знач Идентификатор, ЭлементФормы, Форма) Экспорт
	
	Если Идентификатор = "УчетПоКомпании" Тогда
		
		Если СтандартныеПодсистемыСервер.ЭтоМикроВерсияКонфигурации() Тогда
			
			ЭлементФормы.Доступность = Ложь;
			
		Иначе	
			
			ЭлементФормы.Доступность = Форма.ИспользоватьНесколькоОрганизаций;
			
		КонецЕсли;
				
	ИначеЕсли Идентификатор = "Компания" Тогда
		
		
		Если СтандартныеПодсистемыСервер.ЭтоМикроВерсияКонфигурации() Тогда
			
			ЭлементФормы.Доступность = Ложь;
			
		Иначе	
			
			ЭлементФормы.Доступность = Форма.ИспользоватьНесколькоОрганизаций И Форма.УчетПоКомпании;
			
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьДисконтныеКарты" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемТоваровНаКомиссию" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПартии;
		
	ИначеЕсли Идентификатор = "ОткрытьСправочникВидыЗаказовПокупателей" Тогда
		
		ЭлементФормы.Видимость = Форма.ИспользоватьВидыЗаказовПокупателей;
		
	ИначеЕсли Идентификатор = "АрхивироватьЧекиККМПриЗакрытииКассовойСмены" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "УдалятьНепробитыеЧекиПриЗакрытииКассовойСмены" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "КонтролироватьОстаткиПриПробитииЧековККМ" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "БиллингВестиУчетРасходовПоДоговорамОбслуживания" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьБиллинг;
		
	ИначеЕсли Идентификатор = "БиллингГоловноеНаправлениеДеятельности" Тогда
		
		ЭлементФормы.Доступность = Форма.БиллингВестиУчетРасходовПоДоговорамОбслуживания;
		
	ИначеЕсли Идентификатор = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "ДатаНачалаРегистрацииРозничныхПродажВЕГАИС" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж И Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
		
	ИначеЕсли Идентификатор = "ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС" Тогда
		
		ЭлементФормы.Доступность = Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
		
	ИначеЕсли Идентификатор = "НастройкиОбменаЕГАИС" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж И Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
		
	ИначеЕсли Идентификатор = "КонтрольОстатковСерийныхНомеров" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьСерийныеНомера
		
	ИначеЕсли Идентификатор = "КонтролироватьОстаткиПоНомерамГТД" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетГТД;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемЗапасовНаОтветхранение" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПартии;
		
	ИначеЕсли Идентификатор = "ИспользоватьВидыЗаказНарядов" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуРаботы;
		
	ИначеЕсли Идентификатор = "ОткрытьСправочникВидыЗаказНарядов" Тогда
		
		ЭлементФормы.Видимость = Форма.ИспользоватьВидыЗаказНарядов;
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуРаботы;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьТехоперации" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПереработкаДавальческогоСырья" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство И Форма.ФункциональнаяОпцияИспользоватьПартии;
		
	ИначеЕсли Идентификатор = "УчетМерныхИзделий" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство;
		
	ИначеЕсли Идентификатор = "НациональнаяВалюта" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяУчетВалютныхОпераций;
		
	ИначеЕсли Идентификатор = "ВалютаУчета" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяУчетВалютныхОпераций;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером;
		
	ИначеЕсли Идентификатор = "ЧастотаРасчетаКурсовыхРазниц" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяУчетВалютныхОпераций;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиШтатноеРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьСовместительство" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов" Тогда
		
		Если СтандартныеПодсистемыСервер.ЭтоМикроВерсияКонфигурации() Тогда
			
			ЭлементФормы.Доступность = Ложь;
			
		Иначе	
			
			ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата;
			
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		ЭлементФормы.Доступность = Форма.ОтправлятьСлепыеКопииПисем;
		
	ИначеЕсли Идентификатор = "ЗагрузитьКонтактыGoogle" Тогда
		
		ЭлементФормы.Доступность = Форма.ЗагрузкаКонтактовGoogle;
		
	ИначеЕсли Идентификатор = "СинхронизироватьКалендарьGoogle" Тогда
		
		ЭлементФормы.Доступность = Форма.СинхронизацияКалендаряGoogle;
		
	ИначеЕсли Идентификатор = "ПодключениеИНастройкаОборудования" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "НастройкаСинхронизацииДанных" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "РезультатыСинхронизацииДанных" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "ИспользоватьДатыЗапретаЗагрузки" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "ДатыЗапретаЗагрузкиДанных" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") И Форма.ИспользоватьДатыЗапретаЗагрузки;
		
	ИначеЕсли Идентификатор = "ПрефиксУзлаРаспределеннойИнформационнойБазы" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "КонтрольДоговоровПриПроведенииДокументов" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "КаталогСообщенийОбменаДаннымиДляWindows" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "КаталогСообщенийОбменаДаннымиДляLinux" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "НастройкаОбменаССайтами" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьОбменССайтами;
		
	ИначеЕсли Идентификатор = "ПрефиксДляОбменаССайтом" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьОбменССайтами;
		
	ИначеЕсли Идентификатор = "ТиповыеСоглашенияОбИспользованииЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "СоглашенияОбИспользованииЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "ОтправкаОформленныхЭДРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД И Форма.АвтоматическаяОтправкаЭД;
		
	ИначеЕсли Идентификатор = "АвтоматическоеПолучениеЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "ПолучениеНовыхЭДРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД И Форма.АвтоматическоеПолучениеЭД;
		
	ИначеЕсли Идентификатор = "ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "НастройкиЭлектроннойПодписиИШифрования" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи;
		
	ИначеЕсли Идентификатор = "ПодключениеКСервису1С_ЭДО" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи;
		
	ИначеЕсли Идентификатор = "ПомощникПодключенияКСервису1СТакском" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи;
		
	ИначеЕсли Идентификатор = "НастройкиОбменаСБанками" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменСБанками;
		
	ИначеЕсли Идентификатор = "ДатыЗапретаИзмененияДанных" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьДатыЗапретаИзменения;
		
	ИначеЕсли Идентификатор = "УправлениеНовостями" Тогда
		
		ЭлементФормы.Доступность = Форма.РазрешенаРаботаСНовостями;
		
	ИначеЕсли Идентификатор = "НастройкиВерсионированияОбъектов" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьВерсионированиеОбъектов;
		
	ИначеЕсли Идентификатор = "ЗагрузитьАдресныйКлассификатор" Тогда
		
		ЭлементФормы.Доступность = ПустаяСтрока(Форма.ИсточникДанныхАдресногоКлассификатора);
		
	ИначеЕсли Идентификатор = "ОчиститьАдресныйКлассификатор" Тогда
		
		ЭлементФормы.Доступность = ПустаяСтрока(Форма.ИсточникДанныхАдресногоКлассификатора);
		
	ИначеЕсли Идентификатор = "ИспользоватьГруппыДоступаКонтрагентов" Тогда
		
		ЭлементФормы.Доступность = Форма.ОграничиватьДоступНаУровнеЗаписей;
		
	ИначеЕсли Идентификатор = "ОткрытьГруппыДоступаКонтрагентов" Тогда
		
		ЭлементФормы.Доступность = Форма.ОграничиватьДоступНаУровнеЗаписей И Форма.ИспользоватьГруппыДоступаКонтрагентов;
		
	ИначеЕсли Идентификатор = "ОткрытьДополнительныеОтчетыИОбработки" Тогда
		
		ЭлементФормы.Доступность = Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить();
		
	ИначеЕсли Идентификатор = "ДополнительныеОбработкиПоАдминистрированию" Тогда
		
		ЭлементФормы.Доступность = Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить();
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьЭлектроннуюПочтуРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.АвтоматическиЗагружатьПочту
		
	ИначеЕсли Идентификатор = "ТомаХраненияФайлов" Тогда
		
		ЭлементФормы.Доступность = Форма.ХранитьФайлыВТомахНаДиске;
		
	ИначеЕсли Идентификатор = "СписокЗапрещенныхРасширенийОбластиДанных" Тогда
		
		ЭлементФормы.Доступность = Форма.ЗапрещатьЗагрузкуФайловПоРасширению;
		
	ИначеЕсли Идентификатор = "НастройкиКриптографии" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи2 Или Форма.ИспользоватьШифрование;
		
	ИначеЕсли Идентификатор = "НастройкиСинхронизацииФайлов" Тогда
		
		ЭлементФормы.Доступность = Форма.СинхронизироватьФайлы;
		
	ИначеЕсли Идентификатор = "ОткрытьПодключаемоеОборудование" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "ОткрытьРабочиеМеста" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "ИспользоватьОбменСПодключаемымОборудованиемOffline" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "ПравилаОбменаСПодключаемымОборудованием" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование И Форма.ИспользоватьОбменСПодключаемымОборудованиемOffline;
		
	ИначеЕсли Идентификатор = "АдресСервисаЦентраМониторинга" Тогда
		
		ЭлементФормы.Доступность = Форма.ОтправлятьДанныеВЦентрМониторинга = 1;
		
	ИначеЕсли Идентификатор = "ОценкаПроизводительности" Тогда
		
		ЭлементФормы.Доступность = Форма.ВыполнятьЗамерыПроизводительности;
		
	ИначеЕсли Идентификатор = "НастройкиОценкиПроизводительности" Тогда
		
		ЭлементФормы.Доступность = Форма.ВыполнятьЗамерыПроизводительности;
		
	ИначеЕсли Идентификатор = "УдалениеПомеченныхРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.АвтоматическоеУдалениеПомеченных;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
