#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат ПрисоединенныеФайлы.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Перем КлючФормы;
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ",КлючФормы) Тогда
		СтандартнаяОбработка = Ложь;
		ВладелецЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КлючФормы,"ВладелецФайла");
		Если ТипЗнч(ВладелецЭД) = тип("ДокументСсылка.ЭлектронныйДокументВходящий") Тогда
			ВыбраннаяФорма = "Документ.ЭлектронныйДокументВходящий.Форма.ФормаПросмотраЭД";
		Иначе
			ВыбраннаяФорма = "Документ.ЭлектронныйДокументИсходящий.Форма.ФормаПросмотраЭД";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
