////////////////////////////////////////////////////////////////////////////////
// Серверные события формы отчета.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// В данной процедуре следует описать дополнительные зависимости объектов метаданных
//   конфигурации, которые будут использоваться для связи настроек отчетов.
//
// Параметры:
//   СвязиОбъектовМетаданных - ТаблицаЗначений - Таблица связей.
//       * ПодчиненныйРеквизит - Строка - Имя реквизита подчиненного объекта метаданных.
//       * ПодчиненныйТип      - Тип    - Тип подчиненного объекта метаданных.
//       * ВедущийТип          - Тип    - Тип ведущего объекта метаданных.
//
Процедура ДополнитьСвязиОбъектовМетаданных(СвязиОбъектовМетаданных) Экспорт
	
	
	
КонецПроцедуры

// Вызывается в форме отчета перед выводом настройки.
//
// Параметры:
//   Форма - УправляемаяФорма, Неопределено - Форма отчета.
//   СвойстваНастройки - Структура - Описание настройки отчета, которая будет выведена в форме отчета.
//       * ОписаниеТипов - ОписаниеТипов -
//           Тип настройки.
//       * ЗначенияДляВыбора - СписокЗначений -
//           Объекты, которые будут предложены пользователю в списке выбора.
//           Дополняет список объектов, уже выбранных пользователем ранее.
//       * ЗапросЗначенийВыбора - Запрос -
//           Возвращает объекты, которыми необходимо дополнить ЗначенияДляВыбора.
//           Первой колонкой (с 0м индексом) должен выбираться объект,
//           который следует добавить в ЗначенияДляВыбора.Значение.
//           Для отключения автозаполнения
//           в свойство ЗапросЗначенийВыбора.Текст следует записать пустую строку.
//       * ОграничиватьВыборУказаннымиЗначениями - Булево -
//           Когда Истина, то выбор пользователя будет ограничен значениями,
//           указанными в ЗначенияДляВыбора (его конечным состоянием).
//
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//   ОтчетыКлиентПереопределяемый.ОбработчикКоманды().
//
// Пример 1 - Добавление команды с обработчиком в ОтчетыКлиентПереопределяемый.ОбработчикКоманды:
//	Команда = ФормаОтчета.Команды.Добавить("МояОсобеннаяКоманда");
//	Команда.Действие  = "Подключаемый_Команда";
//	Команда.Заголовок = НСтр("ru='Моя команда...';uk='Моя команда...'");
//	
//	Кнопка = ФормаОтчета.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), ФормаОтчета.Элементы.<ИмяПодменю>);
//	Кнопка.ИмяКоманды = Команда.Имя;
//	
//	ФормаОтчета.ПостоянныеКоманды.Добавить(КомандаСоздать.Имя);
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.Элементы.БыстрыеНастройки.ЦветФона = ЦветаСтиля.БыстрыеНастройкиФонГруппы;
	Форма.Элементы.ОтчетТабличныйДокумент.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
	
	// Гунько 2021-01-18
	Если Форма.ИмяФормы = "ВнешнийОтчет.гвОстаткиСерийныхНомеровНаСкладах.Форма"
		ИЛИ Форма.ИмяФормы = "ВнешнийОтчет.гвЗаказТехникиНаМагазин.Форма" Тогда
		
		Команда = Форма.Команды.Добавить("ДобавленнаяКоманда_СформироватьЗаказРезервирование");
		Команда.Действие  = "Подключаемый_Команда";
		Команда.Заголовок = НСтр("ru = 'Зарезервировать';uk = 'Зарезервувати'");
		Кнопка = Форма.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Форма.Элементы.ГруппаНастройкиОтчета);
		Кнопка.ИмяКоманды = Команда.Имя;
		Форма.ПостоянныеКоманды.Добавить(Команда.Имя);
		
		Команда = Форма.Команды.Добавить("ДобавленнаяКоманда_Переместить");
		Команда.Действие  = "Подключаемый_Команда";
		Команда.Заголовок = НСтр("ru = 'Переместить';uk = 'Перемістити'");
		Кнопка = Форма.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Форма.Элементы.ГруппаНастройкиОтчета);
		Кнопка.ИмяКоманды = Команда.Имя;
		Форма.ПостоянныеКоманды.Добавить(Команда.Имя);
		
   		Команда = Форма.Команды.Добавить("ДобавленнаяКоманда_СформироватьЗаказНаПроизводство");
		Команда.Действие  = "Подключаемый_Команда";
		Команда.Заголовок = НСтр("ru = 'Заказать';uk = 'Замовити'");
		Кнопка = Форма.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Форма.Элементы.ГруппаНастройкиОтчета);
		Кнопка.ИмяКоманды = Команда.Имя;
		Форма.ПостоянныеКоманды.Добавить(Команда.Имя);
	КонецЕсли;
	// ...Гунько 2021-01-18
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//
// См. также:
//   "Расширение управляемой формы для отчета.ПередЗагрузкойВариантаНаСервере" в синтакс-помощнике.
//
Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	// Гунько 2021-02-07
	Если Форма.ИмяФормы = "ВнешнийОтчет.гвЗаказТехникиНаМагазин.Форма" Тогда
		лПараметр = НовыеНастройкиКД.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("СкладМагазин"));
		лПараметр.Значение = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("НФ-000001");
	КонецЕсли;	
	// ...Гунько 2021-02-07
	// Гунько 2021-03-28
	Если Форма.ИмяФормы = "ВнешнийОтчет.гвРасходы.Форма" Тогда
		
		лПараметр = НовыеНастройкиКД.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("СчетГруппа"));
		лПараметр.Значение = ПланыСчетов.Управленческий.НайтиПоКоду("91");
		
		лСписокСчетов = Новый СписокЗначений;
		лСписокСчетов.Добавить(ПланыСчетов.Управленческий.РасчетыСПоставщиками);
		лСписокСчетов.Добавить(ПланыСчетов.Управленческий.РасчетыСПерсоналомПоОплатеТруда);
		
		лПараметр = НовыеНастройкиКД.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("СчетаК"));
		лПараметр.Значение = лСписокСчетов;
		
	КонецЕсли;
	// ...Гунько 2021-03-28
КонецПроцедуры

#КонецОбласти
