////////////////////////////////////////////////////////////////////////////////
// ОбменСКонтрагентамиОбработчикиОбновления: механизм обмена электронными документами.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Появился новый справочник ПрофилиНастроекЭДО.
Процедура ЗаполнитьДанныеОПрофиляхНастроекЭДО() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		// Пометим на удаление не действующие настройки ЭДО
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СоглашенияОбИспользованииЭД.Ссылка
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
		|ГДЕ
		|	НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
		|	И СоглашенияОбИспользованииЭД.СтатусСоглашения <> ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует)
		|	И СоглашенияОбИспользованииЭД.СтатусПодключения = ЗНАЧЕНИЕ(Перечисление.СтатусыУчастниковОбменаЭД.ПустаяСсылка)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НастройкаЭДО = Выборка.Ссылка.ПолучитьОбъект();
			НастройкаЭДО.УстановитьПометкуУдаления(Истина);
			НастройкаЭДО.Комментарий = НСтр("ru='##Настройка ЭДО помечена на удаление автоматически при обновлении.';uk='##Настройка ЭДО помечена на удаление автоматически при обновлении.'");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);
		КонецЦикла;
		
		// Создаем элементы справочника ПрофилиНастроекЭДО.
		// Проверим не было ли обновления.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрофилиНастроекЭДО.Ссылка
		|ИЗ
		|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			
			ИспользуютсяЭП = ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЗначениеФункциональнойОпции(
				"ИспользоватьЭлектронныеПодписи");
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СоглашенияОбИспользованииЭД.Организация,
			|	ВЫРАЗИТЬ(СоглашенияОбИспользованииЭД.ИдентификаторОрганизации КАК СТРОКА(100)) КАК ИдентификаторОрганизации,
			|	СоглашенияОбИспользованииЭД.СпособОбменаЭД,
			|	ВЫБОР
			|		КОГДА СоглашенияОбИспользованииЭД.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.ЧерезОператораЭДОТакском)
			|			ТОГДА СоглашенияОбИспользованииЭД.Ссылка
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Ссылка,
			|	СоглашенияОбИспользованииЭД.РесурсВходящихДокументов,
			|	СоглашенияОбИспользованииЭД.УдалитьАдресСервера КАК АдресСервера,
			|	СоглашенияОбИспользованииЭД.УдалитьПользователь КАК Пользователь,
			|	СоглашенияОбИспользованииЭД.УдалитьПароль КАК Пароль,
			|	СоглашенияОбИспользованииЭД.УдалитьПортFTP КАК Порт,
			|	СоглашенияОбИспользованииЭД.УдалитьПассивноеСоединениеFTP КАК ПассивноеСоединение
			|ИЗ
			|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
			|ГДЕ
			|	СоглашенияОбИспользованииЭД.СтатусСоглашения = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует)
			|	И СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)
			|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
			|	И НЕ СоглашенияОбИспользованииЭД.ЭтоИнтеркампани";
			
		СпособыОбменаЭД = Новый Массив;
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
		Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
		
		Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НовыйПрофильНастроек = Справочники.ПрофилиНастроекЭДО.СоздатьЭлемент();
				
				ШаблонНаименование = НСтр("ru='%1, %2';uk='%1, %2'");
				НовыйПрофильНастроек.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименование,
					Выборка.Организация, Выборка.СпособОбменаЭД);
				
				НовыйПрофильНастроек.Организация = Выборка.Организация;
				НовыйПрофильНастроек.ИдентификаторОрганизации = Выборка.ИдентификаторОрганизации;
				НовыйПрофильНастроек.СпособОбменаЭД = Выборка.СпособОбменаЭД;
				
				АктуальныеВидыЭД = ОбменСКонтрагентамиПовтИсп.ПолучитьАктуальныеВидыЭД();
				
				Для Каждого ЗначениеПеречисления Из АктуальныеВидыЭД Цикл
					Если ЗначениеПеречисления <> Перечисления.ВидыЭД.Подтверждение
						И ЗначениеПеречисления <> Перечисления.ВидыЭД.ВозвратТоваровМеждуОрганизациями
						И ЗначениеПеречисления <> Перечисления.ВидыЭД.ПередачаТоваровМеждуОрганизациями
						И ЗначениеПеречисления <> Перечисления.ВидыЭД.Подтверждение
						И ЗначениеПеречисления <> Перечисления.ВидыЭД.УведомлениеОбУточнении
						И ЗначениеПеречисления <> Перечисления.ВидыЭД.Ошибка
						И ЗначениеПеречисления <> Перечисления.ВидыЭД.ИзвещениеОПолучении Тогда
						
						НоваяСтрока = НовыйПрофильНастроек.ИсходящиеДокументы.Добавить();
						НоваяСтрока.Формировать = Истина;
						НоваяСтрока.ИсходящийДокумент = ЗначениеПеречисления;
						
						Если ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЗначениеФункциональнойОпции(
							"ИспользоватьЭлектронныеПодписи") Тогда
							НоваяСтрока.ИспользоватьЭП = Истина;
						КонецЕсли;
						
						Если Выборка.СпособОбменаЭД <> Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском Тогда
							
							НоваяСтрока.Формировать = Ложь;
							НоваяСтрока.ИспользоватьЭП = Ложь;
							
						КонецЕсли;
						// Проставим в новые соглашения прямого обмена версию формата обмена.
						ВерсияФормата = "CML 4.02";
						Если ЗначениеПеречисления = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
							ВерсияФормата = "";
						ИначеЕсли ЗначениеПеречисления = Перечисления.ВидыЭД.АктЗаказчик
							ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.АктИсполнитель
							ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ТОРГ12Покупатель
							ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ТОРГ12Продавец
							ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель
							ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиПолучатель Тогда
							ВерсияФормата = НСтр("ru='ФНС 5.01';uk='ФНС 5.01'");
						ИначеЕсли ЗначениеПеречисления = Перечисления.ВидыЭД.АктНаПередачуПрав Тогда
							ВерсияФормата = "CML 2.08";
						КонецЕсли;
						НоваяСтрока.ВерсияФормата = ВерсияФормата;
					КонецЕсли;
				КонецЦикла;
				
				НовыйПрофильНастроек.ИсходящиеДокументы.Сортировать("ИсходящийДокумент");
				
				Если Выборка.СпособОбменаЭД <> Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском
					И ИспользуютсяЭП Тогда
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	СертификатыЭП.Ссылка
					|ИЗ
					|	Справочник.УдалитьСертификатыЭП КАК СертификатыЭП
					|ГДЕ
					|	НЕ СертификатыЭП.ПометкаУдаления
					|	И НЕ СертификатыЭП.Отозван
					|	И СертификатыЭП.Организация = &Организация";
					Запрос.УстановитьПараметр("Организация", Выборка.Организация);
					ВыборкаСертификатов = Запрос.Выполнить().Выбрать();
					Пока ВыборкаСертификатов.Следующий() Цикл
						НоваяСтрока = НовыйПрофильНастроек.СертификатыПодписейОрганизации.Добавить();
						НоваяСтрока.Сертификат = ВыборкаСертификатов.Ссылка;
					КонецЦикла;
				КонецЕсли;
				
				// Настройки обмена ЭД
				Если Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезКаталог Тогда
					ПутьКаталога = Выборка.РесурсВходящихДокументов;
					СтрокиПути = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПутьКаталога);
					
					Если СтрокиПути.Количество() >= 1 Тогда
						НовоеИмя = СтрокиПути[СтрокиПути.Количество() - 1];
					КонецЕсли;
					ПутьКаталога = СтрЗаменить(ПутьКаталога, НовоеИмя, "");
					НовыйПрофильНастроек.РесурсВходящихДокументов = ПутьКаталога;
				ИначеЕсли Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту Тогда
					НовыйПрофильНастроек.РесурсВходящихДокументов = Выборка.РесурсВходящихДокументов;
				ИначеЕсли Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезFTP Тогда
					НовыйПрофильНастроек.АдресСервера             = Выборка.АдресСервера;
					НовыйПрофильНастроек.Порт                     = Выборка.Порт;
					НовыйПрофильНастроек.ПассивноеСоединение      = Выборка.ПассивноеСоединение;
					НовыйПрофильНастроек.Логин                    = Выборка.Пользователь;
					НовыйПрофильНастроек.Пароль                   = Выборка.Пароль;
					ПутьКаталога = Выборка.РесурсВходящихДокументов;
					СтрокиПути = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПутьКаталога);
					Если СтрокиПути.Количество() >= 1 Тогда
						НовоеИмя = СтрокиПути[СтрокиПути.Количество() - 1];
					КонецЕсли;
					ПутьКаталога = СтрЗаменить(ПутьКаталога, НовоеИмя, "");
					НовыйПрофильНастроек.РесурсВходящихДокументов = ПутьКаталога;
				ИначеЕсли Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском Тогда
					// Настройки сертификатов - переносим в профиль.
					Для каждого Строка Из Выборка.Ссылка.СертификатыПодписейОрганизации Цикл
						НоваяСтрока = НовыйПрофильНастроек.СертификатыПодписейОрганизации.Добавить();
						НоваяСтрока.Сертификат = Строка.Сертификат;
					КонецЦикла;
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовыйПрофильНастроек);

			КонецЦикла;
		КонецЕсли;
		
		// Обновляем р/с СостоянияОбменовЭДЧерезОператоровЭДО
		НаборЗаписей = РегистрыСведений.СостоянияОбменовЭДЧерезОператоровЭДО.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПрофилиНастроекЭДО.Ссылка
			|ИЗ
			|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
			|ГДЕ
			|	ПрофилиНастроекЭДО.СпособОбменаЭД = &СпособОбменаЭД
			|	И ПрофилиНастроекЭДО.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация", Запись.УдалитьСоглашениеОбИспользованииЭД.Организация);
			Запрос.УстановитьПараметр("СпособОбменаЭД", Запись.УдалитьСоглашениеОбИспользованииЭД.СпособОбменаЭД);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Запись.ПрофильНастроекЭДО = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		
		// Обновляем соглашения прямого обмена.
		// Проверим на уникальность настроек прямого обмена.
		// Лишние настройки пометим на удаление.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(СоглашенияОбИспользованииЭД.Ссылка) КАК Ссылка,
		|	СоглашенияОбИспользованииЭД.Контрагент
		|ПОМЕСТИТЬ КонтрагентыДубли
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
		|ГДЕ
		|	СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)
		|	И СоглашенияОбИспользованииЭД.СтатусСоглашения = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует)
		|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	СоглашенияОбИспользованииЭД.Контрагент
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(СоглашенияОбИспользованииЭД.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоглашенияОбИспользованииЭД.Ссылка,
		|	СоглашенияОбИспользованииЭД.Контрагент КАК Контрагент
		|ИЗ
		|	КонтрагентыДубли КАК КонтрагентыДубли
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
		|		ПО КонтрагентыДубли.Контрагент = СоглашенияОбИспользованииЭД.Контрагент
		|ГДЕ
		|	СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)
		|	И СоглашенияОбИспользованииЭД.СтатусСоглашения = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует)
		|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент";
		
		СпособыОбменаЭД = Новый Массив;
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
		Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ИскомыйКонтрагент = "";
		Пока Выборка.Следующий() Цикл
			Если ИскомыйКонтрагент = Выборка.Контрагент Тогда
				НастройкаЭДО = Выборка.Ссылка.ПолучитьОбъект();
				НастройкаЭДО.УстановитьПометкуУдаления(Истина);
				НастройкаЭДО.Комментарий = НСтр("ru='##Настройка ЭДО помечена на удаление автоматически при обновлении.';uk='##Настройка ЭДО помечена на удаление автоматически при обновлении.'");
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);
			Иначе
				ИскомыйКонтрагент = Выборка.Контрагент;
			КонецЕсли;
		КонецЦикла;
		
		// Заполним недостающую информацию в настройках ЭДО.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоглашенияОбИспользованииЭД.Ссылка,
		|	ПрофилиНастроекЭДО.Ссылка КАК ПрофильНастроекЭДО,
		|	ВЫРАЗИТЬ(СоглашенияОбИспользованииЭД.ИдентификаторКонтрагента КАК СТРОКА(100)) КАК ИдентификаторКонтрагента,
		|	ВЫРАЗИТЬ(СоглашенияОбИспользованииЭД.ИдентификаторОрганизации КАК СТРОКА(100)) КАК ИдентификаторОрганизации,
		|	СоглашенияОбИспользованииЭД.Контрагент,
		|	СоглашенияОбИспользованииЭД.СпособОбменаЭД,
		|	СоглашенияОбИспользованииЭД.РесурсВходящихДокументов,
		|	СоглашенияОбИспользованииЭД.РесурсИсходящихДокументов
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
		|		ПО СоглашенияОбИспользованииЭД.СпособОбменаЭД = ПрофилиНастроекЭДО.СпособОбменаЭД
		|			И СоглашенияОбИспользованииЭД.Организация = ПрофилиНастроекЭДО.Организация
		|ГДЕ
		|	СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)
		|	И СоглашенияОбИспользованииЭД.СтатусСоглашения = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует)
		|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
		|	И НЕ СоглашенияОбИспользованииЭД.ЭтоИнтеркампани";
		
		СпособыОбменаЭД = Новый Массив;
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
		Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НастройкаЭДО = Выборка.Ссылка.ПолучитьОбъект();
			
			НастройкаЭДО.Наименование       = Строка(Выборка.Контрагент);
			НастройкаЭДО.ПрофильНастроекЭДО = Выборка.ПрофильНастроекЭДО;

			ИсходнаяТаблицаЭД = НастройкаЭДО.ИсходящиеДокументы.Выгрузить();
			
			ИсходнаяТаблицаЭД.ЗаполнитьЗначения(Выборка.ПрофильНастроекЭДО,       "ПрофильНастроекЭДО");
			ИсходнаяТаблицаЭД.ЗаполнитьЗначения(Выборка.СпособОбменаЭД,           "СпособОбменаЭД");
			ИсходнаяТаблицаЭД.ЗаполнитьЗначения(Выборка.ИдентификаторОрганизации, "ИдентификаторОрганизации");
			ИсходнаяТаблицаЭД.ЗаполнитьЗначения(Выборка.ИдентификаторКонтрагента, "ИдентификаторКонтрагента");
			
			НастройкаЭДО.ИсходящиеДокументы.Загрузить(ИсходнаяТаблицаЭД);
			
			НастройкаЭДО.ИсходящиеДокументы.Сортировать("ИсходящийДокумент");
			
			НастройкаЭДО.СтатусПодключения   = Перечисления.СтатусыУчастниковОбменаЭД.Присоединен;
			НастройкаЭДО.СостояниеСоглашения = Перечисления.СостоянияСоглашенийЭД.Действует;
			
			Если ЗначениеЗаполнено(НастройкаЭДО.СертификатОрганизацииДляРасшифровки) Тогда
				ШифроватьДанныеПакетаЭД = Истина;
			КонецЕсли;
			Если НастройкаЭДО.СертификатыПодписейКонтрагента.Количество() > 0 Тогда
				ПроверятьСертификатыПодписей = Истина;
			КонецЕсли;
			
			// Настройки обмена ЭД
			Если Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезКаталог Тогда
				ПутьВходящегоКаталога = Выборка.Ссылка.РесурсВходящихДокументов;
				ПутьИсходящегоКаталога = Выборка.Ссылка.РесурсИсходящихДокументов;
				СтрокиПутиВходящегоКаталога = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПутьВходящегоКаталога);
				СтрокиПутиИсходящегоКаталога = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПутьИсходящегоКаталога);
				
				Если СтрокиПутиВходящегоКаталога.Количество() >= 1 Тогда
					НовоеИмяВходящегоКаталога = СтрокиПутиВходящегоКаталога[СтрокиПутиВходящегоКаталога.Количество() - 1];
				КонецЕсли;
				Если СтрокиПутиИсходящегоКаталога.Количество() >= 1 Тогда
					НовоеИмяИсходящегоКаталога = СтрокиПутиИсходящегоКаталога[СтрокиПутиИсходящегоКаталога.Количество() - 1];
				КонецЕсли;
				НастройкаЭДО.КаталогВходящихДокументов = НовоеИмяВходящегоКаталога;
				НастройкаЭДО.КаталогИсходящихДокументов = НовоеИмяИсходящегоКаталога;
				
			ИначеЕсли Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту Тогда
				НастройкаЭДО.ЭлектроннаяПочтаКонтрагента = Выборка.РесурсИсходящихДокументов;
			
			ИначеЕсли Выборка.СпособОбменаЭД = Перечисления.СпособыОбменаЭД.ЧерезFTP Тогда
				ПутьВходящегоКаталога = Выборка.Ссылка.РесурсВходящихДокументов;
				ПутьИсходящегоКаталога = Выборка.Ссылка.РесурсИсходящихДокументов;
				СтрокиПутиВходящегоКаталога = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПутьВходящегоКаталога);
				СтрокиПутиИсходящегоКаталога = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПутьИсходящегоКаталога);
				
				Если СтрокиПутиВходящегоКаталога.Количество() >= 1 Тогда
					НовоеИмяВходящегоКаталога = СтрокиПутиВходящегоКаталога[СтрокиПутиВходящегоКаталога.Количество()-1];
					
				ИначеЕсли СтрокиПутиВходящегоКаталога.Количество() = 1 Тогда
					НовоеИмяВходящегоКаталога = СтрокиПутиВходящегоКаталога[0];
				КонецЕсли;
				Если СтрокиПутиИсходящегоКаталога.Количество() >= 1 Тогда
					НовоеИмяИсходящегоКаталога = СтрокиПутиИсходящегоКаталога[СтрокиПутиИсходящегоКаталога.Количество()-1];
					
				ИначеЕсли СтрокиПутиИсходящегоКаталога.Количество() = 1 Тогда
					НовоеИмяИсходящегоКаталога = СтрокиПутиИсходящегоКаталога[0];
				КонецЕсли;
				НастройкаЭДО.КаталогВходящихДокументовFTP = НовоеИмяВходящегоКаталога;
				НастройкаЭДО.КаталогИсходящихДокументовFTP = НовоеИмяИсходящегоКаталога;
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);

		КонецЦикла;
		
		// Обновляем соглашения обмена через оператора.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.СоглашениеОбИспользованииЭД,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.Участник,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.АдресЭП,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.ВерсияРегламентаЭДО,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.ДатаИзмененияСтатуса,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.Идентификатор,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.Статус,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.ФорматФайловОбменаЭД,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.ОписаниеОшибки,
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.СоглашениеОбИспользованииЭД.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.УдалитьУчастникиОбменовЭДЧерезОператоровЭДО КАК УдалитьУчастникиОбменовЭДЧерезОператоровЭДО
		|ГДЕ
		|	УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.СоглашениеОбИспользованииЭД.СтатусСоглашения = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийЭД.Действует)
		|	И НЕ УдалитьУчастникиОбменовЭДЧерезОператоровЭДО.СоглашениеОбИспользованииЭД.ПометкаУдаления";
		
		ВыборкаУчастников = Запрос.Выполнить().Выбрать();
		Пока ВыборкаУчастников.Следующий() Цикл
			
			Если Не ВыборкаУчастников.СоглашениеОбИспользованииЭД.ПометкаУдаления Тогда
				НастройкаЭДО = ВыборкаУчастников.СоглашениеОбИспользованииЭД.ПолучитьОбъект();
				НастройкаЭДО.УстановитьПометкуУдаления(Истина);
				НастройкаЭДО.Наименование = НСтр("ru='Не использовать';uk='Не використовувати'") + " - " + НастройкаЭДО.Наименование;
				НастройкаЭДО.Комментарий = НСтр("ru='##Настройка ЭДО помечена на удаление автоматически при обновлении.';uk='##Настройка ЭДО помечена на удаление автоматически при обновлении.'");
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПрофилиНастроекЭДО.Ссылка
			|ИЗ
			|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
			|ГДЕ
			|	ПрофилиНастроекЭДО.СпособОбменаЭД = Значение(Перечисление.СпособыОбменаЭД.ЧерезОператораЭДОТакском)
			|	И ПрофилиНастроекЭДО.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация", ВыборкаУчастников.Организация);
			ВыборкаПрофилейНастроекЭДО = Запрос.Выполнить().Выбрать();
			ВыборкаПрофилейНастроекЭДО.Следующий();
			ПрофильНастроекЭДО = ВыборкаПрофилейНастроекЭДО.Ссылка;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СоглашенияОбИспользованииЭД.Ссылка КАК НастройкаЭДО,
			|	СоглашенияОбИспользованииЭД.РасширенныйРежимНастройкиСоглашения КАК РасширенныйРежимНастройки,
			|	СоглашенияОбИспользованииЭД.СпособОбменаЭД КАК СпособОбменаЭД,
			|	СоглашенияОбИспользованииЭД.ИдентификаторКонтрагента КАК Идентификатор,
			|	СоглашенияОбИспользованииЭД.СтатусПодключения
			|ИЗ
			|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
			|ГДЕ
			|	НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
			|	И СоглашенияОбИспользованииЭД.Контрагент = &Контрагент
			|	И СоглашенияОбИспользованииЭД.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Контрагент",  ВыборкаУчастников.Участник);
			Запрос.УстановитьПараметр("Организация", ВыборкаУчастников.Организация);
			ВыборкаНастроек = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаНастроек.Следующий() Тогда
				НастройкаЭДО = ВыборкаНастроек.НастройкаЭДО.ПолучитьОбъект();

				Если Не ВыборкаНастроек.РасширенныйРежимНастройки
					И ВыборкаНастроек.СпособОбменаЭД <> Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском Тогда
					
					НастройкаЭДО.РасширенныйРежимНастройкиСоглашения = Истина;
					
					ПараметрыПрофиляНастроек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрофильНастроекЭДО,
						"ИдентификаторОрганизации, СпособОбменаЭД");
					
				Иначе
					Отбор = Новый Структура;
					Отбор.Вставить("ПрофильНастроекЭДО", ПрофильНастроекЭДО);
					НайденныеСтроки = НастройкаЭДО.ИсходящиеДокументы.НайтиСтроки(Отбор);
					Для каждого Строка Из НайденныеСтроки Цикл
						Строка.ИдентификаторКонтрагента = ВыборкаУчастников.Идентификатор;
					КонецЦикла;
				КонецЕсли;
			Иначе
				НастройкаЭДО = Справочники.СоглашенияОбИспользованииЭД.СоздатьЭлемент();
				НастройкаЭДО.Контрагент = ВыборкаУчастников.Участник;
				НастройкаЭДО.Наименование = Строка(ВыборкаУчастников.Участник);
				
				НастройкаЭДО.ПрофильНастроекЭДО = ПрофильНастроекЭДО;
				ПараметрыПрофиляНастроек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрофильНастроекЭДО,
				"Организация, ИдентификаторОрганизации, СпособОбменаЭД, ШаблонТекстаПриглашений, ИсходящиеДокументы");
				
				НастройкаЭДО.Организация              = ПараметрыПрофиляНастроек.Организация;
				НастройкаЭДО.СпособОбменаЭД           = ПараметрыПрофиляНастроек.СпособОбменаЭД;
				НастройкаЭДО.ИдентификаторОрганизации = ПараметрыПрофиляНастроек.ИдентификаторОрганизации;
				НастройкаЭДО.ВерсияФорматаПакета      = Перечисления.ВерсииФорматаПакетаЭД.Версия30;
				
				// Загружаем ТЧ из профиля настроек ЭДО.
				ИсходнаяТаблицаЭД = ПараметрыПрофиляНастроек.ИсходящиеДокументы.Выгрузить();
				ИсходнаяТаблицаЭД.Колонки.Добавить("ПрофильНастроекЭДО");
				ИсходнаяТаблицаЭД.Колонки.Добавить("СпособОбменаЭД");
				ИсходнаяТаблицаЭД.Колонки.Добавить("ИдентификаторОрганизации");
				ИсходнаяТаблицаЭД.Колонки.Добавить("ИдентификаторКонтрагента");
				
				ИсходнаяТаблицаЭД.ЗаполнитьЗначения(ПрофильНастроекЭДО,                                "ПрофильНастроекЭДО");
				ИсходнаяТаблицаЭД.ЗаполнитьЗначения(ПараметрыПрофиляНастроек.СпособОбменаЭД,           "СпособОбменаЭД");
				ИсходнаяТаблицаЭД.ЗаполнитьЗначения(ПараметрыПрофиляНастроек.ИдентификаторОрганизации, "ИдентификаторОрганизации");
				ИсходнаяТаблицаЭД.ЗаполнитьЗначения(ВыборкаУчастников.Идентификатор,                   "ИдентификаторКонтрагента");
				
				НастройкаЭДО.ИсходящиеДокументы.Загрузить(ИсходнаяТаблицаЭД);
			КонецЕсли;
			
			НастройкаЭДО.ИдентификаторКонтрагента = ВыборкаУчастников.Идентификатор;
			НастройкаЭДО.СтатусПодключения = ВыборкаУчастников.Статус;
			СостояниеСоглашения = Перечисления.СостоянияСоглашенийЭД.ОжидаетсяСогласование;
			Если ВыборкаУчастников.Статус = Перечисления.СтатусыУчастниковОбменаЭД.Присоединен Тогда
				СостояниеСоглашения = Перечисления.СостоянияСоглашенийЭД.Действует;
			ИначеЕсли ВыборкаУчастников.Статус = Перечисления.СтатусыУчастниковОбменаЭД.Отсоединен Тогда
				СостояниеСоглашения = Перечисления.СостоянияСоглашенийЭД.Закрыто;
			КонецЕсли;
			НастройкаЭДО.СостояниеСоглашения = СостояниеСоглашения;
			
			НастройкаЭДО.ОписаниеОшибки = ВыборкаУчастников.ОписаниеОшибки;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);

		КонецЦикла;
		
		// Определим и заполним в электронных документах реквизиты "ПрофильНастроекЭДО" и "НастройкаЭДО".
		
		СправочникКонтрагенты = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяПрикладногоСправочника("Контрагенты");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭДПрисоединенныеФайлы.Ссылка КАК ЭлектронныйДокумент,
		|	ЭДПрисоединенныеФайлы.УдалитьКонтрагент,
		|	ЭДПрисоединенныеФайлы.УдалитьОрганизация,
		|	СоглашенияОбИспользованииЭДИсходящиеДокументы.Ссылка КАК НастройкаЭДО,
		|	СоглашенияОбИспользованииЭДИсходящиеДокументы.ПрофильНастроекЭДО
		|ИЗ
		|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияОбИспользованииЭД.ИсходящиеДокументы КАК СоглашенияОбИспользованииЭДИсходящиеДокументы
		|		ПО ЭДПрисоединенныеФайлы.УдалитьКонтрагент = СоглашенияОбИспользованииЭДИсходящиеДокументы.Ссылка.Контрагент
		|			И ЭДПрисоединенныеФайлы.УдалитьОрганизация = СоглашенияОбИспользованииЭДИсходящиеДокументы.ПрофильНастроекЭДО.Организация
		|ГДЕ
		|	НЕ ЭДПрисоединенныеФайлы.ПометкаУдаления
		|	И НЕ СоглашенияОбИспользованииЭДИсходящиеДокументы.Ссылка.ПометкаУдаления
		|	И ЭДПрисоединенныеФайлы.УдалитьСоглашениеЭД <> ЗНАЧЕНИЕ(Справочник.СоглашенияОбИспользованииЭД.ПустаяСсылка)
		|	И &ПроверкаТипаКонтрагенты
		|
		|СГРУППИРОВАТЬ ПО
		|	СоглашенияОбИспользованииЭДИсходящиеДокументы.ПрофильНастроекЭДО,
		|	ЭДПрисоединенныеФайлы.Ссылка,
		|	СоглашенияОбИспользованииЭДИсходящиеДокументы.Ссылка,
		|	ЭДПрисоединенныеФайлы.УдалитьКонтрагент,
		|	ЭДПрисоединенныеФайлы.УдалитьОрганизация";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПроверкаТипаКонтрагенты",
			"ЭДПрисоединенныеФайлы.УдалитьКонтрагент ССЫЛКА Справочник." + СправочникКонтрагенты);
		
		Выборка = Запрос.Выполнить().Выбрать();
			
		Пока Выборка.Следующий() Цикл
			ЭлектронныйДокумент = Выборка.ЭлектронныйДокумент.ПолучитьОбъект();
			ЭлектронныйДокумент.УдалитьПрофильНастроекЭДО = Выборка.ПрофильНастроекЭДО;
			ЭлектронныйДокумент.УдалитьСоглашениеЭД       = Выборка.НастройкаЭДО;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлектронныйДокумент);
		КонецЦикла;
		
		// Определим и заполним в незавершенных пакетахЭД реквизиты "ПрофильНастроекЭДО" и "НастройкаЭДО".
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПакетЭД.Ссылка КАК ПакетЭД,
		|	ПакетЭД.Отправитель,
		|	ПакетЭД.Получатель,
		|	ПакетЭД.ПрофильНастроекЭДО,
		|	ПакетЭД.Направление
		|ИЗ
		|	Документ.ПакетЭД КАК ПакетЭД
		|ГДЕ
		|	ПакетЭД.СтатусПакета В(&СтатусыПакетаЭД)
		|	И НЕ ПакетЭД.ПометкаУдаления";
		
		СтатусыПакетаЭД = Новый Массив;
		СтатусыПакетаЭД.Добавить(Перечисления.СтатусыПакетовЭД.КРаспаковке);
		СтатусыПакетаЭД.Добавить(Перечисления.СтатусыПакетовЭД.ПодготовленКОтправке);
		Запрос.УстановитьПараметр("СтатусыПакетаЭД", СтатусыПакетаЭД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Отправитель) И ЗначениеЗаполнено(Выборка.Получатель)
				И Не ЗначениеЗаполнено(Выборка.ПрофильНастроекЭДО) Тогда
				Если Выборка.Направление = Перечисления.НаправленияЭД.Входящий Тогда
					ПараметрыНастройкиЭДО = ОбменСКонтрагентамиСлужебный.ПолучитьНастройкиОбменаЭДПоИД(Выборка.Получатель, Выборка.Отправитель);
				ИначеЕсли Выборка.Направление = Перечисления.НаправленияЭД.Исходящий Тогда
					ПараметрыНастройкиЭДО = ОбменСКонтрагентамиСлужебный.ПолучитьНастройкиОбменаЭДПоИД(Выборка.Отправитель, Выборка.Получатель);
				КонецЕсли;
				Если ПараметрыНастройкиЭДО <> Неопределено Тогда
					ПакетЭД = Выборка.ПакетЭД.ПолучитьОбъект();
					ПакетЭД.ПрофильНастроекЭДО = ПараметрыНастройкиЭДО.ПрофильНастроекЭДО;
					ПакетЭД.НастройкаЭДО       = ПараметрыНастройкиЭДО.НастройкаЭДО;
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПакетЭД);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Выполняет первоначальное заполнение регистра на основе справочника контрагентов.
// 		Заполнение выполняется:
// 		1. После ручного включения проверки фоновым заданием.
// 		2. В режиме сервисов - обновлением ИБ в каждой области отдельно.
//
// Параметры:
//  Параметры	 - Структура,Неопределено - Параметры очереди заданий в модели сервиса.
//		В локальной версии - Неопределено.
Процедура ПроверитьКонтрагентовБЭД(Параметры = Неопределено) Экспорт
	
	ЭтоОбновлениеИБВМоделиСервиса = ОбщегоНазначенияПовтИсп.РазделениеВключено();
	
	// Дозаписываем недостающие ИНН и КПП в регистр в локальном режиме,
	// либо в модели сервисов в отложенном обновлении из областей данных.
	Если НЕ ЭтоОбновлениеИБВМоделиСервиса
		ИЛИ ЭтоОбновлениеИБВМоделиСервиса И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		ОбменСКонтрагентамиСлужебный.ПроверитьНепроверенныхКонтрагентов(ЭтоОбновлениеИБВМоделиСервиса, Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик обновления видов ЭД актуальными.
// Используется при необходимости добавить новый вид ЭД в справочники БЭД.
//
// Параметры:
//  ВидЭД - ЗначениеПеречисления - значение перечисления ВидыЭД.
//
Процедура ОбновитьНастройкиЭДО(ВидЭД) Экспорт
	
	НачатьТранзакцию();
	
	// В справочниках показываем только главные титулы электронных документов.
	Если ВидЭД <> Перечисления.ВидыЭД.АктЗаказчик
		И ВидЭД <> Перечисления.ВидыЭД.ТОРГ12Покупатель
		И ВидЭД <> Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиПолучатель
		И ВидЭД <> Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПокупателя
		И ВидЭД <> Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПокупателя Тогда
		
		// Обновим элементы справочника Профили настроек ЭДО.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрофилиНастроекЭДО.Ссылка
		|ИЗ
		|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
		|ГДЕ
		|	НЕ ПрофилиНастроекЭДО.ПометкаУдаления";
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			
			ИскомыйПрофильНастроек = Результат.Ссылка.ПолучитьОбъект();
			ЗаписатьОбъект = Ложь;
			
			СтрокаВидЭД = ИскомыйПрофильНастроек.ИсходящиеДокументы.Найти(ВидЭД, "ИсходящийДокумент");
			Если СтрокаВидЭД = Неопределено Тогда
				
				НоваяСтрока = ИскомыйПрофильНастроек.ИсходящиеДокументы.Добавить();
				НоваяСтрока.ИсходящийДокумент         = ВидЭД;
				Если ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЗначениеФункциональнойОпции(
					"ИспользоватьЭлектронныеПодписи") Тогда
					НоваяСтрока.ИспользоватьЭП = Истина;
				КонецЕсли;
				
				ВерсияФормата = "CML 2.08";
				Если ВидЭД = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
					
					ВерсияФормата = "";
				ИначеЕсли ВидЭД = Перечисления.ВидыЭД.АктИсполнитель
					ИЛИ ВидЭД = Перечисления.ВидыЭД.ТОРГ12Продавец
					ИЛИ ВидЭД = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель Тогда
					
					ВерсияФормата = НСтр("ru='ФНС 5.01';uk='ФНС 5.01'");
				ИначеЕсли ВидЭД = Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПродавца Тогда
					
					ВерсияФормата = НСтр("ru='ФНС 5.01 (СЧФ+ДОП)';uk='ФНС 5.01 (СЧФ+ДОП)'");
				ИначеЕсли ВидЭД = Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПродавца Тогда
					
					ВерсияФормата = НСтр("ru='ФНС 5.01 (КСЧФ+ДИС)';uk='ФНС 5.01 (КСЧФ+ДИС)'");
				КонецЕсли;
				НоваяСтрока.ВерсияФормата = ВерсияФормата;
				
				ЗаписатьОбъект = Истина;
			КонецЕсли;
			
			Если ЗаписатьОбъект Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ИскомыйПрофильНастроек);
			КонецЕсли;
			
		КонецЦикла;
		
		// Обновим элементы справочника Настройки ЭДО.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СоглашенияОбИспользованииЭД.Ссылка
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
		|ГДЕ
		|	НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
		|	И СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)";
		
		СпособыОбменаЭД = Новый Массив;
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
		СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
		Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			
			ИскомаяНастройка = Результат.Ссылка.ПолучитьОбъект();
			ЗаписатьОбъект = Ложь;
			
			СтрокаВидЭД = ИскомаяНастройка.ИсходящиеДокументы.Найти(ВидЭД, "ИсходящийДокумент");
			
			Если СтрокаВидЭД = Неопределено Тогда
				НоваяСтрока = ИскомаяНастройка.ИсходящиеДокументы.Добавить();
				НоваяСтрока.ИсходящийДокумент         = ВидЭД;
				Если ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ЗначениеФункциональнойОпции(
					"ИспользоватьЭлектронныеПодписи") Тогда
					НоваяСтрока.ИспользоватьЭП = Истина;
				КонецЕсли;
				
				ВерсияФормата = "CML 2.08";
				Если ВидЭД = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
					
					ВерсияФормата = "";
				ИначеЕсли  ВидЭД = Перечисления.ВидыЭД.АктИсполнитель
					ИЛИ ВидЭД = Перечисления.ВидыЭД.ТОРГ12Продавец
					ИЛИ ВидЭД = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель Тогда
					
					ВерсияФормата = НСтр("ru='ФНС 5.01';uk='ФНС 5.01'");
				ИначеЕсли ВидЭД = Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПродавца Тогда
					
					ВерсияФормата = НСтр("ru='ФНС 5.01 (СЧФ+ДОП)';uk='ФНС 5.01 (СЧФ+ДОП)'");
				ИначеЕсли ВидЭД = Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПродавца Тогда
					
					ВерсияФормата = НСтр("ru='ФНС 5.01 (КСЧФ+ДИС)';uk='ФНС 5.01 (КСЧФ+ДИС)'");
				КонецЕсли;
				НоваяСтрока.ВерсияФормата = ВерсияФормата;
				
				Если ИскомаяНастройка.РасширенныйРежимНастройкиСоглашения Тогда
					НоваяСтрока.ПрофильНастроекЭДО = ИскомаяНастройка.ИсходящиеДокументы[0].ПрофильНастроекЭДО;
					НоваяСтрока.СпособОбменаЭД = ИскомаяНастройка.ИсходящиеДокументы[0].СпособОбменаЭД;
					НоваяСтрока.ИдентификаторОрганизации = ИскомаяНастройка.ИсходящиеДокументы[0].ИдентификаторОрганизации;
					НоваяСтрока.ИдентификаторКонтрагента = ИскомаяНастройка.ИсходящиеДокументы[0].ИдентификаторКонтрагента;
				Иначе
					НоваяСтрока.ПрофильНастроекЭДО = ИскомаяНастройка.ПрофильНастроекЭДО;
					НоваяСтрока.СпособОбменаЭД = ИскомаяНастройка.СпособОбменаЭД;
					НоваяСтрока.ИдентификаторОрганизации = ИскомаяНастройка.ИдентификаторОрганизации;
					НоваяСтрока.ИдентификаторКонтрагента = ИскомаяНастройка.ИдентификаторКонтрагента;
				КонецЕсли;
				
				ЗаписатьОбъект = Истина;
			КонецЕсли;
			
			Если ЗаписатьОбъект Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ИскомаяНастройка);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Обновим элементы справочника Сертификаты ЭП.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат КАК Сертификат
	|ПОМЕСТИТЬ Сертификаты
	|ИЗ
	|	Справочник.ПрофилиНастроекЭДО.СертификатыПодписейОрганизации КАК ПрофилиНастроекЭДОСертификатыПодписейОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|		ПО (СоглашенияОбИспользованииЭД.ПрофильНастроекЭДО = ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Ссылка)
	|ГДЕ
	|	НЕ ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат.ПометкаУдаления
	|	И НЕ ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат.Отозван
	|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
	|	И СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сертификаты.Сертификат КАК СертификатЭП,
	|	ПодписываемыеВидыЭД.ВидЭД,
	|	ПодписываемыеВидыЭД.Использовать
	|ИЗ
	|	Сертификаты КАК Сертификаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписываемыеВидыЭД КАК ПодписываемыеВидыЭД
	|		ПО Сертификаты.Сертификат.Ссылка = ПодписываемыеВидыЭД.СертификатЭП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сертификаты.Сертификат КАК СертификатЭП
	|ИЗ
	|	Сертификаты КАК Сертификаты";
	
	СпособыОбменаЭД = Новый Массив;
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
	Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[2].Выбрать();
	ТЗ = Результат[1].Выгрузить();
	Попытка
		Пока Выборка.Следующий() Цикл
			Отбор = Новый Структура("СертификатЭП", Выборка.СертификатЭП);
			КопияТЗ = ТЗ.Скопировать(Отбор);
			ЗаписатьОбъект = Ложь;
			
			СтрокаВидЭД = КопияТЗ.Найти(ВидЭД, "ВидЭД");
			Если СтрокаВидЭД = Неопределено Тогда
				НоваяСтрока = КопияТЗ.Добавить();
				НоваяСтрока.ВидЭД        = ВидЭД;
				НоваяСтрока.Использовать = Истина;
				НоваяСтрока.СертификатЭП = Выборка.СертификатЭП;
				ЗаписатьОбъект = Истина;
			ИначеЕсли НЕ СтрокаВидЭД.Использовать Тогда
				СтрокаВидЭД.Использовать = Истина;
				ЗаписатьОбъект = Истина;
			КонецЕсли;
			
			Если ЗаписатьОбъект Тогда
				СохранитьПодписываемыеВидыЭД(Выборка.СертификатЭП, КопияТЗ);
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ВидОперации = НСтр("ru='Обновление информационной базы';uk='Оновлення інформаційної бази'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки);
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.2.4.4
// Переносит настройки контекста криптографии в объект БСП СоздаватьЭлектронныеПодписиНаСервере.
//
Процедура ПеренестиНастройкиКонтекстаКриптографии() Экспорт
	
	НачатьТранзакцию();
	Попытка
		Если Константы.ИспользоватьЭлектронныеПодписи.Получить() Тогда
			РаботатьСЭПНаСервере = НЕ (ОбщегоНазначения.ИнформационнаяБазаФайловая()
					ИЛИ ОбщегоНазначенияПовтИсп.РазделениеВключено())
				И (Константы.УдалитьКонтекстКриптографии.Получить() = Перечисления.УдалитьКонтекстыРаботыСЭД.НаСервере
					ИЛИ Константы.УдалитьКонтекстАвторизации.Получить() = Перечисления.УдалитьКонтекстыРаботыСЭД.НаСервере);
			МенеджерЗначения = Константы.СоздаватьЭлектронныеПодписиНаСервере.СоздатьМенеджерЗначения();
			МенеджерЗначения.Значение = РаботатьСЭПНаСервере;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
			МенеджерЗначения = Константы.ПроверятьЭлектронныеПодписиНаСервере.СоздатьМенеджерЗначения();
			МенеджерЗначения.Значение = РаботатьСЭПНаСервере;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Удаление устаревших отложенных разделенных обработчиков обновления.
Процедура УдалитьУстаревшиеОбработчики() Экспорт
	
	ОбновлениеИнформационнойБазы.УдалитьОтложенныйОбработчикИзОчереди(
		"ЭлектронныеДокументыСлужебный.ПроверитьНепроверенныхКонтрагентов");
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.2.20
// Переносит настройки контекста криптографии в объект БСП СоздаватьЭлектронныеПодписиНаСервере.
//
Процедура НастроитьАвтоПереходНаНовыеВерсииФорматовЭД() Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СоглашенияОбИспользованииЭД.Ссылка КАК НастройкаЭДО
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
		|ГДЕ
		|	НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НастройкаЭДО = Выборка.НастройкаЭДО.ПолучитьОбъект();
			НастройкаЭДО.АвтоПереходНаНовыеФорматы = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаЭДО);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru='Обновление подсистемы обмена с контрагентами';uk='Обновление подсистемы обмена с контрагентами'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='При обновлении подсистемы обмена с контрагентами произошла ошибка';uk='При обновлении подсистемы обмена с контрагентами произошла ошибка'");
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.4.8
// Добавляет новые виды ЭД в справочники БЭД.
//
Процедура ДобавитьНовыеВидыЭДУПД_УКД() Экспорт
	
	ОбновитьНастройкиЭДО(Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПродавца);
	ОбновитьНастройкиЭДО(Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПокупателя);
	
	ОбновитьНастройкиЭДО(Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПродавца);
	ОбновитьНастройкиЭДО(Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПокупателя);
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.6.2
Процедура ПеренестиПаролиВБезопасноеХранилище() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		НачатьТранзакцию();
	
		СоответствиеСертификатов = Константы.УдалитьКонтекстРаботыЭД.Получить().Получить();
		
		Если ТипЗнч(СоответствиеСертификатов) = Тип("Соответствие") Тогда
			
			Для Каждого КлючЗначение Из СоответствиеСертификатов Цикл
				
				Если ТипЗнч(КлючЗначение.Значение) = Тип("Структура") Тогда
					СоответствиеПользовательПароль = Новый Соответствие;
					СоответствиеПользовательПароль.Вставить(КлючЗначение.Значение.Пользователь,КлючЗначение.Значение.Пароль);
					
					ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КлючЗначение.Ключ,СоответствиеПользовательПароль,"ПаролиСертификатов");
				КонецЕсли;
				
			КонецЦикла;
			
			Константы.УдалитьКонтекстРаботыЭД.Установить(Неопределено);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.6.4
// Заполняет в справочнике СоглашенияОбИспользованииЭД табличную часть ВходящиеДокументы
// способами по умолчанию.
Процедура ЗаполнитьВходящиеДокументыНастроек() Экспорт 
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СоглашенияОбИспользованииЭД.Ссылка
		|ИЗ
		|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Настройка = Выборка.Ссылка.ПолучитьОбъект();
			Настройка.ВходящиеДокументы.Очистить();
			Настройка.ВходящиеДокументы.Загрузить(ОбменСКонтрагентамиСлужебный.ТаблицаПредопределенногоПрофиля("Автоматически"));
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Настройка);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru='Обновление подсистемы обмена с контрагентами';uk='Обновление подсистемы обмена с контрагентами'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='При обновлении подсистемы обмена с контрагентами произошла ошибка';uk='При обновлении подсистемы обмена с контрагентами произошла ошибка'");
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.6.4.
// Создает входящие и исходящие электронные документы и перепривязывает к ним присоединенные файлы.
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//
Процедура ПеревестиНаНовуюАрхитектуруЭДО(Параметры) Экспорт 
	
	Попытка
		НачатьТранзакцию();
	
		ТипыЭлементовВерсийЭД = Новый Массив;
		ТипыЭлементовВерсийЭД.Добавить(Перечисления.ТипыЭлементовВерсииЭД.ПервичныйЭД);
		
		ВидыИсключаемыхЭД = Новый Массив;
		ВидыИсключаемыхЭД.Добавить(Перечисления.ВидыЭД.ТОРГ12Покупатель);
		ВидыИсключаемыхЭД.Добавить(Перечисления.ВидыЭД.АктЗаказчик);
		ВидыИсключаемыхЭД.Добавить(Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиПолучатель);
		ВидыИсключаемыхЭД.Добавить(Перечисления.ВидыЭД.ПроизвольныйЭД);
		ВидыИсключаемыхЭД.Добавить(Перечисления.ВидыЭД.ПустаяСсылка());
		
		Если НЕ Параметры.Свойство("ВсегоДокументовЭДО") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭДПрисоединенныеФайлы.Ссылка) КАК КоличествоДокументов
			|ИЗ
			|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
			|ГДЕ
			|	ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В(&ТипыЭлементовВерсийЭД)
			|	И НЕ ЭДПрисоединенныеФайлы.ВладелецФайла ССЫЛКА Документ.ЭлектронныйДокументВходящий
			|	И НЕ ЭДПрисоединенныеФайлы.ВладелецФайла ССЫЛКА Документ.ЭлектронныйДокументИсходящий
			|	И НЕ ЭДПрисоединенныеФайлы.УдалитьВидЭД В (&ВидыИсключаемыхЭД)";
			Запрос.УстановитьПараметр("ТипыЭлементовВерсийЭД",ТипыЭлементовВерсийЭД);
			Запрос.УстановитьПараметр("ВидыИсключаемыхЭД",ВидыИсключаемыхЭД);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Параметры.Вставить("ВсегоДокументовЭДО", Выборка.КоличествоДокументов);
			Иначе
				Параметры.Вставить("ВсегоДокументовЭДО", 0);
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЭДПрисоединенныеФайлы.УдалитьВерсияРегламентаЭДО КАК ВерсияРегламентаЭДО,
		|	ЭДПрисоединенныеФайлы.УдалитьВидЭД КАК ВидЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаВыпискиБанка КАК ДатаВыпискиБанка,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаДокументаОтправителя КАК ДатаДокументаОтправителя,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаИзмененияВнешнегоСтатусаЭД КАК ДатаИзмененияВнешнегоСтатусаЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьКонтрагент КАК Контрагент,
		|	ЭДПрисоединенныеФайлы.УдалитьНомерВерсииЭД КАК НомерВерсииЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьНомерДокументаОтправителя КАК НомерДокументаОтправителя,
		|	ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД  КАК ТипЭлементаВерсииЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьОрганизация КАК Организация,
		|	ЭДПрисоединенныеФайлы.УдалитьОтветственный КАК Ответственный,
		|	ЭДПрисоединенныеФайлы.УдалитьПричинаОтклонения КАК ПричинаОтклонения,
		|	ЭДПрисоединенныеФайлы.УдалитьПрофильНастроекЭДО КАК ПрофильНастроекЭДО,
		|	ЭДПрисоединенныеФайлы.УдалитьСоглашениеЭД КАК НастройкаЭДО,
		|	ЭДПрисоединенныеФайлы.УдалитьСуммаДокумента КАК СуммаДокумента,
		|	ЭДПрисоединенныеФайлы.УникальныйИД КАК УникальныйИД,
		|	ЭДПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ЭДПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		|	ЭДПрисоединенныеФайлы.НаправлениеЭД КАК НаправлениеЭД,
		|	ЭДПрисоединенныеФайлы.НомерЭД КАК НомерЭД,
		|	ЭДПрисоединенныеФайлы.ДатаСоздания,
		|	ЕСТЬNULL(СостоянияЭД.СостояниеВерсииЭД, НЕОПРЕДЕЛЕНО) КАК СостояниеВерсииЭД,
		|	ЕСТЬNULL(СостоянияЭД.Комментарий, """") КАК Комментарий,
		|	ЭДПрисоединенныеФайлы.ПометкаУдаления,
		|	ЭДПрисоединенныеФайлы.ИдентификаторыОснованийВладельцаФайла.(
		|		ИдентификаторДокументаОснования,
		|		ИдентификаторЭДДокументаОснования
		|	) КАК Основания
		|ИЗ
		|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
		|		ПО (СостоянияЭД.ЭлектронныйДокумент = ЭДПрисоединенныеФайлы.Ссылка)
		|			И (СостоянияЭД.СсылкаНаОбъект = ЭДПрисоединенныеФайлы.ВладелецФайла)
		|ГДЕ
		|	ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД В(&ТипыЭлементовВерсийЭД)
		|	И НЕ ЭДПрисоединенныеФайлы.ВладелецФайла ССЫЛКА Документ.ЭлектронныйДокументВходящий
		|	И НЕ ЭДПрисоединенныеФайлы.ВладелецФайла ССЫЛКА Документ.ЭлектронныйДокументИсходящий
		|	И НЕ ЭДПрисоединенныеФайлы.УдалитьВидЭД В (&ВидыИсключаемыхЭД)";
		Запрос.УстановитьПараметр("ТипыЭлементовВерсийЭД",ТипыЭлементовВерсийЭД);
		Запрос.УстановитьПараметр("ВидыИсключаемыхЭД",ВидыИсключаемыхЭД);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			
			Если Параметры.Свойство("ОбработаноДокументовЭДО") Тогда
				Параметры.ОбработаноДокументовЭДО = Параметры.ОбработаноДокументовЭДО + Выборка.Количество();
			Иначе
				Параметры.Вставить("ОбработаноДокументовЭДО", Выборка.Количество());
			КонецЕсли;
			
			Параметры.ОбработкаЗавершена = Ложь;
			Параметры.ПрогрессВыполнения.ВсегоОбъектов = Параметры.ВсегоДокументовЭДО;
			Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ОбработаноДокументовЭДО;
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.НаправлениеЭД = Перечисления.НаправленияЭД.Входящий Тогда
					ДокументОбъект = Документы.ЭлектронныйДокументВходящий.СоздатьДокумент();
					НоваяСтрока = ДокументОбъект.ДокументыОснования.Добавить();
					НоваяСтрока.ДокументОснование = Выборка.ВладелецФайла;
				Иначе
					ДокументОбъект = Документы.ЭлектронныйДокументИсходящий.СоздатьДокумент();
					НоваяСтрока = ДокументОбъект.ДокументыОснования.Добавить();
					НоваяСтрока.ДокументОснование = Выборка.ВладелецФайла;
				КонецЕсли;
				
				ВыборкаОснований = Выборка.Основания.Выбрать();
				
				Пока ВыборкаОснований.Следующий() Цикл
					НоваяСтрока = ДокументОбъект.ИдентификаторыОснованийВладельцаФайла.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаОснований);
				КонецЦикла;
				
				ДокументОбъект.Дата = Выборка.ДатаСоздания;
				ЗаполнитьЗначенияСвойств(ДокументОбъект,Выборка);
				
				ДокументОбъект.УстановитьНовыйНомер();
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
				
				ВыборкаЭД = ПолучитьВыборкуЭД(Выборка.УникальныйИД, Выборка.ВладелецФайла);
				
				ВторойТитул = Неопределено;
				
				Пока ВыборкаЭД.Следующий() Цикл
					
					СправочникОбъект = ВыборкаЭД.Ссылка.ПолучитьОбъект();
					СправочникОбъект.ВладелецФайла = ДокументОбъект.Ссылка;
					
					Если СправочникОбъект.УдалитьВидЭД = Перечисления.ВидыЭД.ТОРГ12Покупатель Тогда
						СправочникОбъект.ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовВерсииЭД.ТОРГ12Покупатель;
						ВторойТитул = ВыборкаЭД.Ссылка;
					ИначеЕсли СправочникОбъект.УдалитьВидЭД = Перечисления.ВидыЭД.АктЗаказчик Тогда
						СправочникОбъект.ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовВерсииЭД.АктЗаказчик;
						ВторойТитул = ВыборкаЭД.Ссылка;
					ИначеЕсли СправочникОбъект.УдалитьВидЭД = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиПолучатель Тогда
						СправочникОбъект.ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовВерсииЭД.СоглашениеОбИзмененииСтоимостиПолучатель;
						ВторойТитул = ВыборкаЭД.Ссылка;
					КонецЕсли;
					
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
					
				КонецЦикла;
				
				Если Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.Аннулирован
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ЗакрытПринудительно 
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ОбменЗавершен
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ОбменЗавершенСИсправлением
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.Отклонен
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ОшибкаПередачи Тогда
					
					ДокументОбъект.СостояниеЭДО = Выборка.СостояниеВерсииЭД;
					
					Если ПустаяСтрока(ДокументОбъект.ПричинаОтклонения) 
						И НЕ ПустаяСтрока(Выборка.Комментарий) Тогда
						
						ДокументОбъект.ПричинаОтклонения = Выборка.Комментарий;
					КонецЕсли;
					
				Иначе
					ДокументОбъект.СостояниеЭДО = ОбменСКонтрагентамиСлужебный.ОпределитьСостояниеВерсииПоСтатусуЭД(Выборка.Ссылка);
				КонецЕсли;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
				
				НаборЗаписей = РегистрыСведений.СостоянияЭД.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(Выборка.ВладелецФайла,Истина);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() > 0 Тогда
					Если (НаборЗаписей[0].ЭлектронныйДокумент = Выборка.Ссылка 
						ИЛИ НаборЗаписей[0].ЭлектронныйДокумент = ВторойТитул)Тогда
						
						НаборЗаписей[0].ЭлектронныйДокумент = ДокументОбъект.Ссылка;
						НаборЗаписей.Записать();
					Иначе
						ДокументОбъект.ПометкаУдаления = Истина;
						ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			Параметры.ОбработкаЗавершена = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.6.4.
// Переводит на новую архитектуру произвольные документы.
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//
Процедура ПеревестиНаНовуюАрхитектуруПроизвольныхЭД(Параметры) Экспорт 
	
	Попытка
		НачатьТранзакцию();
		
		Если НЕ Параметры.Свойство("ВсегоПроизвольныхЭД") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроизвольныйЭД.Ссылка) КАК КоличествоДокументов
			|ИЗ
			|	Документ.УдалитьПроизвольныйЭД КАК ПроизвольныйЭД
			|ГДЕ
			|	НЕ ПроизвольныйЭД.ПометкаУдаления";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Параметры.Вставить("ВсегоПроизвольныхЭД", Выборка.КоличествоДокументов);
			Иначе
				Параметры.Вставить("ВсегоПроизвольныхЭД", 0);
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПроизвольныйЭД.Направление,
		|	ПроизвольныйЭД.Прочитан,
		|	ПроизвольныйЭД.СтатусДокумента,
		|	ВЫРАЗИТЬ(ПроизвольныйЭД.Текст КАК СТРОКА(1000)) КАК Текст,
		|	ПроизвольныйЭД.ТребуетсяПодтверждение,
		|	ПроизвольныйЭД.ТипДокумента,
		|	ПроизвольныйЭД.ДокументОснование,
		|	ПроизвольныйЭД.ДоговорКонтрагента,
		|	ЭДПрисоединенныеФайлы.УдалитьВерсияРегламентаЭДО КАК ВерсияРегламентаЭДО,
		|	Значение(Перечисление.ВидыЭД.ПроизвольныйЭД) КАК ВидЭД,
		|	Значение(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД) КАК ТипЭлементаВерсииЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаВыпискиБанка КАК ДатаВыпискиБанка,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаДокументаОтправителя КАК ДатаДокументаОтправителя,
		|	ЭДПрисоединенныеФайлы.УдалитьДатаИзмененияВнешнегоСтатусаЭД КАК ДатаИзмененияВнешнегоСтатусаЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьНомерВерсииЭД КАК НомерВерсииЭД,
		|	ЭДПрисоединенныеФайлы.УдалитьНомерДокументаОтправителя КАК НомерДокументаОтправителя,
		|	ЭДПрисоединенныеФайлы.УдалитьОтветственный КАК Ответственный,
		|	ЭДПрисоединенныеФайлы.УдалитьПричинаОтклонения КАК ПричинаОтклонения,
		|	ЭДПрисоединенныеФайлы.УдалитьПрофильНастроекЭДО КАК ПрофильНастроекЭДО,
		|	ЭДПрисоединенныеФайлы.УдалитьСоглашениеЭД КАК НастройкаЭДО,
		|	ЭДПрисоединенныеФайлы.УдалитьСуммаДокумента КАК СуммаДокумента,
		|	ЭДПрисоединенныеФайлы.УникальныйИД КАК УникальныйИД,
		|	ЭДПрисоединенныеФайлы.УникальныйИДВнешний КАК УникальныйИДВнешний,
		|	ПроизвольныйЭД.Организация,
		|	ПроизвольныйЭД.Контрагент,
		|	ПроизвольныйЭД.Дата,
		|	ПроизвольныйЭД.Ссылка,
		|	ЭДПрисоединенныеФайлы.Ссылка КАК ЭД,
		|	ПроизвольныйЭД.Номер КАК НомерПЭД,
		|	СостоянияЭД.СостояниеВерсииЭД,
		|	ЭДПрисоединенныеФайлы.ИдентификаторыОснованийВладельцаФайла.(
		|		ИдентификаторДокументаОснования,
		|		ИдентификаторЭДДокументаОснования
		|	) КАК Основания,
		|	ЕСТЬNULL(СостоянияЭД.Комментарий, """") КАК Комментарий
		|ИЗ
		|	Документ.УдалитьПроизвольныйЭД КАК ПроизвольныйЭД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
		|		ПО ПроизвольныйЭД.Ссылка = ЭДПрисоединенныеФайлы.ВладелецФайла
		|			И (ЭДПрисоединенныеФайлы.ТипЭлементаВерсииЭД = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
		|		ПО (СостоянияЭД.СсылкаНаОбъект = ПроизвольныйЭД.Ссылка)
		|ГДЕ
		|	НЕ ПроизвольныйЭД.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			
			Если Параметры.Свойство("ОбработаноПроизвольныхЭД") Тогда
				Параметры.ОбработаноПроизвольныхЭД = Параметры.ОбработаноПроизвольныхЭД + Выборка.Количество();
			Иначе
				Параметры.Вставить("ОбработаноПроизвольныхЭД", Выборка.Количество());
			КонецЕсли;
			
			Параметры.ОбработкаЗавершена = Ложь;
			Параметры.ПрогрессВыполнения.ВсегоОбъектов = Параметры.ВсегоПроизвольныхЭД;
			Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ОбработаноПроизвольныхЭД;
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Направление = Перечисления.НаправленияЭД.Входящий Тогда
					ДокументОбъект = Документы.ЭлектронныйДокументВходящий.СоздатьДокумент();
					Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
						НоваяСтрока = ДокументОбъект.ДокументыОснования.Добавить();
						НоваяСтрока.ДокументОснование = Выборка.ДокументОснование;
					КонецЕсли;
				Иначе
					ДокументОбъект = Документы.ЭлектронныйДокументИсходящий.СоздатьДокумент();
					Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
						НоваяСтрока = ДокументОбъект.ДокументыОснования.Добавить();
						НоваяСтрока.ДокументОснование = Выборка.ДокументОснование;
					КонецЕсли;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ДокументОбъект,Выборка);
				
				Если Выборка.Направление = Перечисления.НаправленияЭД.Исходящий Тогда
					ДокументОбъект.НомерДокументаОтправителя = Выборка.НомерПЭД;
				КонецЕсли;
				
				Если ДокументОбъект.ПрофильНастроекЭДО.Пустая() Тогда
					НастройкиЭД = ОбменСКонтрагентамиСлужебный.ОпределитьНастройкиОбменаЭДПоИсточнику(ДокументОбъект, ,,,ДокументОбъект.ВидЭД); 
					Если ЗначениеЗаполнено(НастройкиЭД) Тогда
						ДокументОбъект.НастройкаЭДО = НастройкиЭД.СоглашениеЭД;
						ДокументОбъект.ПрофильНастроекЭДО = НастройкиЭД.ПрофильНастроекЭДО;
					КонецЕсли;
				КонецЕсли;
				
				Если ДокументОбъект.ВерсияРегламентаЭДО.Пустая() Тогда
					ДокументОбъект.ВерсияРегламентаЭДО = Перечисления.ВерсииРегламентаОбмена1С.Версия10;
				КонецЕсли;
				
				Если ПустаяСтрока(ДокументОбъект.УникальныйИД) Тогда
					ДокументОбъект.УникальныйИД = Новый УникальныйИдентификатор;
				КонецЕсли;
				
				ВыборкаОснований = Выборка.Основания.Выбрать();
				
				Пока ВыборкаОснований.Следующий() Цикл
					НоваяСтрока = ДокументОбъект.ИдентификаторыОснованийВладельцаФайла.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаОснований);
				КонецЦикла;
				
				ДокументОбъект.УстановитьНовыйНомер();
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
				
				ВыборкаЭД = ПолучитьВыборкуЭД(Выборка.УникальныйИД, Выборка.Ссылка);
				
				Пока ВыборкаЭД.Следующий() Цикл
					СправочникОбъект = ВыборкаЭД.Ссылка.ПолучитьОбъект();
					СправочникОбъект.ВладелецФайла = ДокументОбъект.Ссылка;
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
				КонецЦикла;
				
				Если Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.Аннулирован
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ЗакрытПринудительно 
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ОбменЗавершен
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ОбменЗавершенСИсправлением
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.Отклонен
					ИЛИ Выборка.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ОшибкаПередачи Тогда
					
					ДокументОбъект.СостояниеЭДО = Выборка.СостояниеВерсииЭД;
					
					Если ПустаяСтрока(ДокументОбъект.ПричинаОтклонения) 
						И НЕ ПустаяСтрока(Выборка.Комментарий) Тогда
						
						ДокументОбъект.ПричинаОтклонения = Выборка.Комментарий;
					КонецЕсли;
					
					НаборЗаписей = РегистрыСведений.СостоянияЭД.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(Выборка.Ссылка,Истина);
					НаборЗаписей.Записать();
				Иначе
					
					Если ЗначениеЗаполнено(Выборка.ЭД) Тогда
						ДокументОбъект.СостояниеЭДО = ОбменСКонтрагентамиСлужебный.ОпределитьСостояниеВерсииПоСтатусуЭД(Выборка.ЭД);
					Иначе
						ДокументОбъект.СостояниеЭДО = Перечисления.СостоянияВерсийЭД.НеСформирован;
					КонецЕсли;
					
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
				
				ПроизвольныйДокумент = Выборка.Ссылка.ПолучитьОбъект();
				ПроизвольныйДокумент.ПометкаУдаления = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПроизвольныйДокумент);
			КонецЦикла;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЭлектронныйДокументИсходящийДокументыОснования.Ссылка КАК Ссылка,
			|	ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование КАК ДокументОснование,
			|	ВЫРАЗИТЬ(ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование КАК Документ.УдалитьПроизвольныйЭД).Направление КАК НаправлениеЭД,
			|	ЭлектронныйДокументИсходящийИдентификаторыОснованийВладельцаФайла.ИдентификаторДокументаОснования КАК ИдентификаторДокументаОснования,
			|	ЭлектронныйДокументИсходящийИдентификаторыОснованийВладельцаФайла.ИдентификаторЭДДокументаОснования КАК ИдентификаторЭДДокументаОснования
			|ПОМЕСТИТЬ вт_Документы
			|ИЗ
			|	Документ.ЭлектронныйДокументИсходящий.ДокументыОснования КАК ЭлектронныйДокументИсходящийДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящий.ИдентификаторыОснованийВладельцаФайла КАК ЭлектронныйДокументИсходящийИдентификаторыОснованийВладельцаФайла
			|		ПО ЭлектронныйДокументИсходящийДокументыОснования.Ссылка = ЭлектронныйДокументИсходящийИдентификаторыОснованийВладельцаФайла.Ссылка
			|ГДЕ
			|	ЭлектронныйДокументИсходящийДокументыОснования.Ссылка.ВидЭД = Значение(Перечисление.ВидыЭД.ПроизвольныйЭД)
			|	И ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование ССЫЛКА Документ.УдалитьПроизвольныйЭД
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЭлектронныйДокументВходящийДокументыОснования.Ссылка,
			|	ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование,
			|	ВЫРАЗИТЬ(ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование КАК Документ.УдалитьПроизвольныйЭД).Направление,
			|	ЭлектронныйДокументВходящийИдентификаторыОснованийВладельцаФайла.ИдентификаторДокументаОснования,
			|	ЭлектронныйДокументВходящийИдентификаторыОснованийВладельцаФайла.ИдентификаторЭДДокументаОснования
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящий.ДокументыОснования КАК ЭлектронныйДокументВходящийДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящий.ИдентификаторыОснованийВладельцаФайла КАК ЭлектронныйДокументВходящийИдентификаторыОснованийВладельцаФайла
			|		ПО (ЭлектронныйДокументВходящийИдентификаторыОснованийВладельцаФайла.Ссылка = ЭлектронныйДокументВходящийДокументыОснования.Ссылка)
			|ГДЕ
			|	ЭлектронныйДокументВходящийДокументыОснования.Ссылка.ВидЭД = Значение(Перечисление.ВидыЭД.ПроизвольныйЭД)
			|	И ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование ССЫЛКА Документ.УдалитьПроизвольныйЭД
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_Документы.Ссылка КАК Ссылка,
			|	вт_Документы.ДокументОснование КАК ДокументОснование,
			|	ЭДПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
			|ИЗ
			|	вт_Документы КАК вт_Документы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
			|		ПО вт_Документы.ИдентификаторДокументаОснования = ЭДПрисоединенныеФайлы.НомерЭД
			|			И (ЭДПрисоединенныеФайлы.НаправлениеЭД = вт_Документы.НаправлениеЭД)";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.ВладелецФайла) Тогда
					
					ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					
					СтрокаОснования = ДокументОбъект.ДокументыОснования.Найти(Выборка.ДокументОснование, "ДокументОснование");
					
					Если СтрокаОснования = Неопределено Тогда
						НоваяСтрока = ДокументОбъект.ДокументыОснования.Добавить();
						НоваяСтрока.ДокументОснование = Выборка.ВладелецФайла;
					Иначе
						СтрокаОснования.ДокументОснование = Выборка.ВладелецФайла;
					КонецЕсли;
					
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Параметры.ОбработкаЗавершена = Истина;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.6.4
// Удаляет распакованные пакеты ЭД и переводит на новую архитектуру нераспакованные.
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//
Процедура ПеревестиНаНовуюАрхитектуруПакетыЭД(Параметры) Экспорт 
	
	Попытка
		НачатьТранзакцию();
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПакетЭД.Ссылка,
		|	ПакетЭД.СтатусПакета,
		|	ПакетЭД.ПометкаУдаления
		|ПОМЕСТИТЬ вт_Пакеты
		|ИЗ
		|	Документ.ПакетЭД КАК ПакетЭД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Пакеты.Ссылка
		|ИЗ
		|	вт_Пакеты КАК вт_Пакеты
		|ГДЕ
		|	вт_Пакеты.СтатусПакета В(&УдаляемыеСтатусы)
		|	И НЕ вт_Пакеты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Пакеты.Ссылка
		|ИЗ
		|	вт_Пакеты КАК вт_Пакеты
		|ГДЕ
		|	НЕ вт_Пакеты.СтатусПакета В (&УдаляемыеСтатусы)";
		УдаляемыеСтатусы = Новый Массив;
		УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Отправлен);
		УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Распакован);
		Запрос.УстановитьПараметр("УдаляемыеСтатусы",УдаляемыеСтатусы);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			ПакетОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПакетОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
		Выборка = МассивРезультатов[2].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЭДПрисоединенныеФайлы.Ссылка
			|ИЗ
			|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
			|ГДЕ
			|	ЭДПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
			Запрос.УстановитьПараметр("ВладелецФайла", Выборка.Ссылка);

			ВыборкаЭД = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаЭД.Следующий() Цикл	
				
				ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаЭД.Ссылка,, Истина);
				
				ПараметрыФайла = Новый Структура();
				ПараметрыФайла.Вставить("Автор", Пользователи.АвторизованныйПользователь());
				ПараметрыФайла.Вставить("ВладелецФайлов", Выборка.Ссылка);
				ПараметрыФайла.Вставить("ИмяБезРасширения", ДанныеФайла.ИмяФайла);
				ПараметрыФайла.Вставить("РасширениеБезТочки", ДанныеФайла.Расширение);
				ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
				
				ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(ПараметрыФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
				
				ФайлОбъект = ВыборкаЭД.Ссылка.ПолучитьОбъект();
				ФайлОбъект.ПометкаУдаления = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ФайлОбъект);
				
			КонецЦикла;
			
			ПакетОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаВладельца Из ПакетОбъект.ЭлектронныеДокументы Цикл
				СтрокаВладельца.ОбъектВладелец = СтрокаВладельца.ЭлектронныйДокумент.ВладелецФайла;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПакетОбъект);
			
		КонецЦикла;

		Параметры.ОбработкаЗавершена = Истина;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.3.6.7
// Добавляет новые виды ЭД в справочники БЭД.
//
Процедура УдалитьНовыеВидыЭДУПД_УКД() Экспорт
	
	НачатьТранзакцию();

	// Обновим элементы справочника Профили настроек ЭДО.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрофилиНастроекЭДО.Ссылка
	|ИЗ
	|	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		
		ИскомыйПрофильНастроек = Результат.Ссылка.ПолучитьОбъект();
		ЗаписатьОбъект = Истина;
		
		СтрокаВидЭД = ИскомыйПрофильНастроек.ИсходящиеДокументы.Найти(Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПродавца, "ИсходящийДокумент");
		Если СтрокаВидЭД <> Неопределено Тогда
			ИскомыйПрофильНастроек.ИспользоватьУПД = СтрокаВидЭД.Формировать;
			ИскомыйПрофильНастроек.ИсходящиеДокументы.Удалить(СтрокаВидЭД);
		КонецЕсли;
		
		СтрокаВидЭД = ИскомыйПрофильНастроек.ИсходящиеДокументы.Найти(Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПродавца, "ИсходящийДокумент");
		Если СтрокаВидЭД <> Неопределено Тогда
			ИскомыйПрофильНастроек.ИспользоватьУКД = СтрокаВидЭД.Формировать;
			ИскомыйПрофильНастроек.ИсходящиеДокументы.Удалить(СтрокаВидЭД);
		КонецЕсли;
		
		Для каждого Строка Из ИскомыйПрофильНастроек.ИсходящиеДокументы Цикл
			
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.АктНаПередачуПрав Тогда
				Строка.Формировать = Не ИскомыйПрофильНастроек.ИспользоватьУПД;
				Строка.Приоритет = 1;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.АктИсполнитель Тогда
				Строка.Формировать = Не ИскомыйПрофильНастроек.ИспользоватьУПД;
				Строка.Приоритет = 2;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ТОРГ12Продавец Тогда
				Строка.Формировать = Не ИскомыйПрофильНастроек.ИспользоватьУПД;
				Строка.Приоритет = 3;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель Тогда
				Строка.Формировать = Не ИскомыйПрофильНастроек.ИспользоватьУКД;
				Строка.Приоритет = 5;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
				Строка.Приоритет = 7;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.КаталогТоваров Тогда
				Строка.Приоритет = 10;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.СчетНаОплату Тогда
				Строка.Приоритет = 11;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ПрайсЛист Тогда
				Строка.Приоритет = 12;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ЗаказТовара Тогда
				Строка.Приоритет = 13;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ОтветНаЗаказ Тогда
				Строка.Приоритет = 14;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ОтчетОПродажахКомиссионногоТовара Тогда
				Строка.Приоритет = 15;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ОтчетОСписанииКомиссионногоТовара Тогда
				Строка.Приоритет = 16;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ДокументУчета) Тогда
				Строка.ДокументУчета = ОбменСКонтрагентамиПовтИсп.ПредставлениеОснованияДляВидаЭД(Строка.ИсходящийДокумент);
			КонецЕсли;
			
		КонецЦикла;
		
		ИскомыйПрофильНастроек.ИсходящиеДокументы.Сортировать("Приоритет Возр");
		
		Если ЗаписатьОбъект Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ИскомыйПрофильНастроек);
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновим элементы справочника Настройки ЭДО.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭД.Ссылка
	|ИЗ
	|	Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|ГДЕ
	|	СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)";
	
	СпособыОбменаЭД = Новый Массив;
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
	Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		
		ИскомаяНастройка = Результат.Ссылка.ПолучитьОбъект();
		ЗаписатьОбъект = Истина;
		
		СтрокаВидЭД = ИскомаяНастройка.ИсходящиеДокументы.Найти(Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПродавца, "ИсходящийДокумент");
		Если СтрокаВидЭД <> Неопределено Тогда
			ИскомаяНастройка.ИспользоватьУПД = СтрокаВидЭД.Формировать;
			ИскомаяНастройка.ИсходящиеДокументы.Удалить(СтрокаВидЭД);
		КонецЕсли;
		
		СтрокаВидЭД = ИскомаяНастройка.ИсходящиеДокументы.Найти(Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПродавца, "ИсходящийДокумент");
		Если СтрокаВидЭД <> Неопределено Тогда
			ИскомаяНастройка.ИспользоватьУКД = СтрокаВидЭД.Формировать;
			ИскомаяНастройка.ИсходящиеДокументы.Удалить(СтрокаВидЭД);
		КонецЕсли;
		
		Для каждого Строка Из ИскомаяНастройка.ИсходящиеДокументы Цикл
			
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.АктНаПередачуПрав Тогда
				Строка.Формировать = Не ИскомаяНастройка.ИспользоватьУПД;
				Строка.Приоритет = 1;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.АктИсполнитель Тогда
				Строка.Формировать = Не ИскомаяНастройка.ИспользоватьУПД;
				Строка.Приоритет = 2;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ТОРГ12Продавец Тогда
				Строка.Формировать = Не ИскомаяНастройка.ИспользоватьУПД;
				Строка.Приоритет = 3;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель Тогда
				Строка.Формировать = Не ИскомаяНастройка.ИспользоватьУКД;
				Строка.Приоритет = 5;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
				Строка.Приоритет = 7;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.КаталогТоваров Тогда
				Строка.Приоритет = 10;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.СчетНаОплату Тогда
				Строка.Приоритет = 11;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ПрайсЛист Тогда
				Строка.Приоритет = 12;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ЗаказТовара Тогда
				Строка.Приоритет = 13;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ОтветНаЗаказ Тогда
				Строка.Приоритет = 14;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ОтчетОПродажахКомиссионногоТовара Тогда
				Строка.Приоритет = 15;
			КонецЕсли;
			Если Строка.ИсходящийДокумент = Перечисления.ВидыЭД.ОтчетОСписанииКомиссионногоТовара Тогда
				Строка.Приоритет = 16;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ДокументУчета) Тогда
				Строка.ДокументУчета = ОбменСКонтрагентамиПовтИсп.ПредставлениеОснованияДляВидаЭД(Строка.ИсходящийДокумент);
			КонецЕсли;
			
		КонецЦикла;
		
		ИскомаяНастройка.ИсходящиеДокументы.Сортировать("Приоритет Возр");
		
		Если ЗаписатьОбъект Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ИскомаяНастройка);
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновим элементы справочника Сертификаты ЭП.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат КАК Сертификат
	|ПОМЕСТИТЬ Сертификаты
	|ИЗ
	|	Справочник.ПрофилиНастроекЭДО.СертификатыПодписейОрганизации КАК ПрофилиНастроекЭДОСертификатыПодписейОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|		ПО (СоглашенияОбИспользованииЭД.ПрофильНастроекЭДО = ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Ссылка)
	|ГДЕ
	|	НЕ ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат.ПометкаУдаления
	|	И НЕ ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат.Отозван
	|	И НЕ СоглашенияОбИспользованииЭД.ПометкаУдаления
	|	И СоглашенияОбИспользованииЭД.СпособОбменаЭД В(&СпособыОбменаЭД)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрофилиНастроекЭДОСертификатыПодписейОрганизации.Сертификат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сертификаты.Сертификат КАК СертификатЭП,
	|	ПодписываемыеВидыЭД.ВидЭД,
	|	ПодписываемыеВидыЭД.Использовать
	|ИЗ
	|	Сертификаты КАК Сертификаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписываемыеВидыЭД КАК ПодписываемыеВидыЭД
	|		ПО Сертификаты.Сертификат.Ссылка = ПодписываемыеВидыЭД.СертификатЭП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сертификаты.Сертификат КАК СертификатЭП
	|ИЗ
	|	Сертификаты КАК Сертификаты";
	
	СпособыОбменаЭД = Новый Массив;
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезЭлектроннуюПочту);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезКаталог);
	СпособыОбменаЭД.Добавить(Перечисления.СпособыОбменаЭД.ЧерезFTP);
	Запрос.УстановитьПараметр("СпособыОбменаЭД", СпособыОбменаЭД);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[2].Выбрать();
	ТЗ = Результат[1].Выгрузить();
	Попытка
		Пока Выборка.Следующий() Цикл
			Отбор = Новый Структура("СертификатЭП", Выборка.СертификатЭП);
			КопияТЗ = ТЗ.Скопировать(Отбор);
			ЗаписатьОбъект = Ложь;
			
			СтрокаВидЭД = КопияТЗ.Найти(Перечисления.ВидыЭД.УдалитьУПД_ИнформацияПродавца, "ВидЭД");
			Если СтрокаВидЭД <> Неопределено Тогда
				КопияТЗ.Удалить(СтрокаВидЭД);
				ЗаписатьОбъект = Истина;
			КонецЕсли;
			
			СтрокаВидЭД = КопияТЗ.Найти(Перечисления.ВидыЭД.УдалитьУКД_ИнформацияПродавца, "ВидЭД");
			Если СтрокаВидЭД <> Неопределено Тогда
				КопияТЗ.Удалить(СтрокаВидЭД);
				ЗаписатьОбъект = Истина;
			КонецЕсли;
			
			Если ЗаписатьОбъект Тогда
				СохранитьПодписываемыеВидыЭД(Выборка.СертификатЭП, КопияТЗ);
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ВидОперации = НСтр("ru='Обновление информационной базы';uk='Оновлення інформаційної бази'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронноеВзаимодействиеСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки);
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПодписываемыеВидыЭД(СертификатСсылка, ПодписываемыеЭД)
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей = РегистрыСведений.ПодписываемыеВидыЭД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СертификатЭП.Установить(СертификатСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(ПодписываемыеЭД);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьВыборкуЭД(УникальныйИД, ВладелецФайла);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭДПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|ГДЕ
	|	ЭДПрисоединенныеФайлы.УникальныйИД = &УникальныйИД
	|	И ЭДПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("УникальныйИД",УникальныйИД);
	Запрос.УстановитьПараметр("ВладелецФайла",ВладелецФайла);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти
