
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Перем КлючФормы;
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ",КлючФормы) Тогда
		ВидЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КлючФормы,"ВидЭД");
		Если ВидЭД = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
			ВыбраннаяФорма = "Документ.ЭлектронныйДокументВходящий.Форма.ФормаПроизвольногоДокумента";
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
