
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Отчет.ДатаНачала) И НЕ ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
		
		Отчет.ДатаНачала    = НачалоГода(ТекущаяДата());
		Отчет.ДатаОкончания = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ЗаполнитьЗначениямиПоУмолчанию(Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) ИЛИ
		 НЕ ЗначениеЗаполнено(Отчет.СтруктурнаяЕдиница) ИЛИ
		 НЕ ЗначениеЗаполнено(Отчет.ДатаНачала) ИЛИ
		 НЕ ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
		Параметры.СформироватьПриОткрытии = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = Отчет.ДатаНачала;
	Диалог.Период.ДатаОкончания = Отчет.ДатаОкончания;
	
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если ЗначениеЗаполнено(Результат1) Тогда
		
		Отчет.ДатаНачала    = Диалог.Период.ДатаНачала;
		Отчет.ДатаОкончания = Диалог.Период.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет поля отчета значениями по умолчанию если они не заполнены.
//
&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию(Настройки)
	
	Если НЕ ЗначениеЗаполнено(Настройки.Получить("Отчет.Организация")) Тогда
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Отчет.Организация = ЗначениеНастройки;
		Иначе
			Отчет.Организация = Справочники.Организации.ОсновнаяОрганизация;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Настройки.Получить("Отчет.СтруктурнаяЕдиница")) Тогда
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойСклад");
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Отчет.СтруктурнаяЕдиница = ЗначениеНастройки;
		Иначе
			Отчет.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ФормаРасшифровки = ПолучитьФорму("Отчет.ТоварныйОтчетТОРГ29.Форма.ФормаОтчета",,, Расшифровка.Дата);
		РезультатОбработкаРасшифровкиНаСервере(Расшифровка, ФормаРасшифровки.Результат);
		ФормаРасшифровки.Элементы.ГруппаШапка.Видимость = Ложь;
		ФормаРасшифровки.Элементы.ГруппаРезультат.Видимость = Ложь;
		ФормаРасшифровки.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка, ПолеРезультат)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("МакетРасшифровки");
	
	СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Отчет.Организация, Расшифровка.Дата, ,);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ОрганизацияПредставление = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе);
	ОбластьМакета.Параметры.СтруктурнаяЕдиницаПредставление = Отчет.СтруктурнаяЕдиница.Наименование;
	ОбластьМакета.Параметры.Дата = Формат(Расшифровка.Дата, "ДФ=dd.MM.yyyy");
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Дата = Формат(Расшифровка.Дата, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Период КАК Период,
		|	""Установка цен"" КАК Регистратор,
		|	ТаблицаЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаЦен.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ЦеныНоменклатурыА.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ЦеныНоменклатурыБ.Цена, 0) КАК СтараяЦена,
		|	ЕСТЬNULL(ЦеныНоменклатурыА.Цена, 0) - ЕСТЬNULL(ЦеныНоменклатурыБ.Цена, 0) КАК Дельта,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаЦен.Номенклатура),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаЦен.Характеристика),
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток * ЕСТЬNULL(ЦеныНоменклатурыА.Цена, 0) КАК Стоимость,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток * ЕСТЬNULL(ЦеныНоменклатурыБ.Цена, 0) КАК СтараяСтоимость,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток * (ЕСТЬNULL(ЦеныНоменклатурыА.Цена, 0) - ЕСТЬNULL(ЦеныНоменклатурыБ.Цена, 0)) КАК ДельтаСтоимости
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЦеныНоменклатуры.Период КАК Период,
		|		МАКСИМУМ(ЦеныДоИзменения.Период) КАК ДатаПрошлогоИзменения,
		|		ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
		|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|		ЦеныНоменклатуры.Характеристика КАК Характеристика
		|	ИЗ
		|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныДоИзменения
		|			ПО ЦеныНоменклатуры.Период > ЦеныДоИзменения.Период
		|				И ЦеныНоменклатуры.Номенклатура = ЦеныДоИзменения.Номенклатура
		|				И ЦеныНоменклатуры.Характеристика = ЦеныДоИзменения.Характеристика
		|				И (&ВидЦен = ЦеныДоИзменения.ВидЦен)
		|				И (ЦеныДоИзменения.Актуальность)
		|	ГДЕ
		|		ЦеныНоменклатуры.ВидЦен = &ВидЦен
		|		И ЦеныНоменклатуры.Актуальность
		|		И ЦеныНоменклатуры.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	{ГДЕ
		|		ЦеныНоменклатуры.Номенклатура.*,
		|		ЦеныНоменклатуры.Характеристика.*}
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЦеныНоменклатуры.ВидЦен,
		|		ЦеныНоменклатуры.Номенклатура,
		|		ЦеныНоменклатуры.Характеристика,
		|		ЦеныНоменклатуры.Период) КАК ТаблицаЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатурыА
		|		ПО ТаблицаЦен.Период = ЦеныНоменклатурыА.Период
		|			И ТаблицаЦен.Номенклатура = ЦеныНоменклатурыА.Номенклатура
		|			И ТаблицаЦен.Характеристика = ЦеныНоменклатурыА.Характеристика
		|			И ТаблицаЦен.ВидЦен = ЦеныНоменклатурыА.ВидЦен
		|			И (ЦеныНоменклатурыА.Актуальность)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатурыБ
		|		ПО ТаблицаЦен.ДатаПрошлогоИзменения = ЦеныНоменклатурыБ.Период
		|			И ТаблицаЦен.Номенклатура = ЦеныНоменклатурыБ.Номенклатура
		|			И ТаблицаЦен.Характеристика = ЦеныНоменклатурыБ.Характеристика
		|			И ТаблицаЦен.ВидЦен = ЦеныНоменклатурыБ.ВидЦен
		|			И (ЦеныНоменклатурыБ.Актуальность)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(&ПериодНачалоГраница, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыНаСкладахОстатки
		|		ПО ТаблицаЦен.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|			И ТаблицаЦен.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		|ГДЕ
		|	ЦеныНоменклатурыА.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
		|ИТОГИ
		|	СУММА(Стоимость),
		|	СУММА(СтараяСтоимость),
		|	СУММА(ДельтаСтоимости)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ВидЦен", Отчет.СтруктурнаяЕдиница.РозничныйВидЦен);
	Запрос.УстановитьПараметр("ПериодНачало", НачалоДня(Расшифровка.Дата));
	Запрос.УстановитьПараметр("ПериодНачалоГраница", Новый Граница(НачалоДня(Расшифровка.Дата), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Расшифровка.Дата));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Отчет.СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтоги.Следующий() Тогда
		
		ИтогСтараяСтоимость = ВыборкаИтоги.СтараяСтоимость;
		ИтогСтоимость = ВыборкаИтоги.Стоимость;
		ИтогДельтаСтоимости = ВыборкаИтоги.ДельтаСтоимости;
		
		ВыборкаДетальныеЗаписи = ВыборкаИтоги.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Характеристика) Тогда
				ОбластьМакета.Параметры.НоменклатураХарактеристика = ""+ВыборкаДетальныеЗаписи.НоменклатураПредставление+
					" ("+ВыборкаДетальныеЗаписи.ХарактеристикаПредставление+")";
			Иначе
				ОбластьМакета.Параметры.НоменклатураХарактеристика = ВыборкаДетальныеЗаписи.Номенклатура;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	// Итоги.
	ОбластьМакета.Параметры.ИтогСтараяСтоимость = ИтогСтараяСтоимость;
	ОбластьМакета.Параметры.ИтогСтоимость = ИтогСтоимость;
	ОбластьМакета.Параметры.ИтогДельтаСтоимости = ИтогДельтаСтоимости;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ПолеРезультат.Очистить();
	ПолеРезультат.Вывести(ТабДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти
