
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Представление", Представление);
	
	Если Параметры.Свойство("ИдентификаторСтроки") Тогда
		ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
		Заголовок = НСтр("ru='Настройка разделителя';uk='Налаштування роздільника'");
	Иначе
		ИдентификаторСтроки = -1;
		Заголовок = НСтр("ru='Добавление разделителя';uk='Додавання роздільника'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройкуПоказателя(Команда)
	
	Если ПустаяСтрока(СокрЛП(Представление)) Тогда
		Возврат;
	КонецЕсли; 
	
	Результат = Новый Структура;
	Результат.Вставить("Событие", "НастройкаРазделителя");
	Если ИдентификаторСтроки>=0 Тогда
		Результат.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	КонецЕсли;
	Результат.Вставить("Представление", Представление);
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНастройкуПоказателя(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
 

