
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru='Нормы времени хранятся только для работ';uk='Норми часу зберігаються тільки для робіт'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		ИначеЕсли Номенклатура.ФиксированнаяСтоимость Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru='""Способ расчета стоимости работ"" должен быть ""Норма времени""';uk='""Спосіб розрахунків вартості робіт"" повинен бути ""Норма години""'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервере()